IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-PAY.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT EMPLOYEE-FILE ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD EMPLOYEE-FILE.
01 EMPLOYEE-RECORD.
    05 EMPLOYEE-ID            PIC X(10).
    05 EMPLOYEE-NAME          PIC X(30).
    05 EMPLOYEE-PAYRATE       PIC 9(6)V99.
    05 EMPLOYEE-HOURS-WORKED  PIC 9(6)V99.

WORKING-STORAGE SECTION.
01 GROSS-PAY                  PIC 9(6)V99 VALUE ZERO.
01 NET-PAY                    PIC 9(6)V99 VALUE ZERO.
01 TOTAL-PAYROLL              PIC 9(6)V99 VALUE ZERO.
01 PAY-DATE                   PIC X(8) VALUE "01/01/2020".
01 CONTROL-FLAG               PIC X VALUE "N".

PROCEDURE DIVISION.

MAIN-ROUTINE.

    OPEN INPUT EMPLOYEE-FILE.
    PERFORM UNTIL CONTROL-FLAG = "Y"
        READ EMPLOYEE-FILE
            AT END
                MOVE "Y" TO CONTROL-FLAG
            NOT AT END
                EVALUATE TRUE
                    WHEN EMPLOYEE-HOURS-WORKED > 40
                        COMPUTE GROSS-PAY = (EMPLOYEE-PAYRATE * 40) + ((EMPLOYEE-HOURS-WORKED - 40) * EMPLOYEE-PAYRATE * 1.5)
                    WHEN EMPLOYEE-HOURS-WORKED > 0 AND EMPLOYEE-HOURS-WORKED <= 40
                        COMPUTE GROSS-PAY = EMPLOYEE-PAYRATE * EMPLOYEE-HOURS-WORKED
                    WHEN OTHER
                        MOVE "Invalid hours worked" TO CONTROL-FLAG
                END-EVALUATE

                ADD GROSS-PAY TO TOTAL-PAYROLL
    END-PERFORM.

    CLOSE EMPLOYEE-FILE.

    MOVE TOTAL-PAYROLL TO NET-PAY.

    DISPLAY "Total payroll as of " PAY-DATE ": $" NET-PAY.

STOP-RUN.