IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-CALCULATION-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'INFILE.DAT'.
           SELECT OUTPUT-FILE ASSIGN TO 'OUTFILE.DAT'.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01  INPUT-RECORD.
           03  RECORD-KEY  PIC X(10).
           03  RECORD-DATA PIC X(50).
       FD OUTPUT-FILE.
       01  OUTPUT-RECORD      PIC X(60).
       WORKING-STORAGE SECTION.
       01  WS-VAR1             PIC S9(4) COMP-3.
       01  WS-VAR2             PIC S9(4) COMP-3.
       01  WS-VAR3             PIC S9(8) COMP-3.
       01  WS-TOTAL            PIC S9(8) COMP-3.
       01  WS-COUNTER          PIC S9(4) COMP-3 VALUE 1.
       01  WS-FILE-EOF         PIC A(1) VALUE 'N'.
       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.
           PERFORM UNTIL WS-FILE-EOF = 'Y'
               IF WS-FILE-EOF = 'N'
                   READ INPUT-FILE
                       AT END
                           MOVE 'Y' TO WS-FILE-EOF
                       NOT AT END
                           ADD 1 TO WS-COUNTER
                           MOVE RECORD-DATA TO OUTPUT-RECORD
                           UNSTRING OUTPUT-RECORD
                               DELIMITED BY ',' INTO WS-VAR1, WS-VAR2
                           STRING WS-VAR1, '/' WS-VAR2
                               DELIMITED BY '/' INTO WS-VAR3
                           WRITE OUTPUT-RECORD
               END-IF
           END-PERFORM.
           CLOSE INPUT-FILE.
           CLOSE OUTPUT-FILE.
           STOP RUN.