IDENTIFICATION DIVISION.
       * Annotated COBOL code snippet
       * This snippet calculates the perimeter of a rectangle
       * and prints the result to the screen
       
       PROGRAM-ID. RECTANGLE.
       
       DATA DIVISION.
        WORKING-STORAGE SECTION.
         01 LENGTH PIC 9(3).
         01 WIDTH PIC 9(3).
         01 PERIMETER PIC 9(4).
         
       PROCEDURE DIVISION.
       
       DISPLAY "PLEASE ENTER THE LENGTH OF THE RECTANGLE: ".
       ACCEPT LENGTH.
       DISPLAY "PLEASE ENTER THE WIDTH OF THE RECTANGLE: ".
       ACCEPT WIDTH.
       
       PERFORM CALCULATE-PERIMETER.
       DISPLAY "THE PERIMETER OF THE RECTANGLE IS: ", PERIMETER.
       STOP RUN.
       
       CALCULATE-PERIMETER.
       MULTIPLY LENGTH BY 2 GIVING PERIMETER.
       MULTIPLY WIDTH BY 2 GIVING PERIMETER.
       ADD PERIMETER BY PERIMETER.