IDENTIFICATION DIVISION.
      PROGRAM-ID. MY-PROGRAM.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
          01 WS-ARRAY.
              02 WS-INDEX PIC 99 VALUE 1.
              02 WS-NAME PIC X(20) OCCURS 5 TIMES.
          01 WS-SUM PIC 9(5)V9(2).
      PROCEDURE DIVISION.
      PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 5
          DISPLAY "Enter name: "
          ACCEPT WS-NAME(WS-INDEX)
      END-PERFORM
      PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 5
          MOVE WS-NAME(WS-INDEX) TO WS-ARRAY(WS-INDEX)
      END-PERFORM
      PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 5
          SET WS-SUM TO WS-SUM + FUNCTION LENGTH(WS-NAME(WS-INDEX))
      END-PERFORM
      DISPLAY "Total length of names: " WS-SUM
      STOP RUN.