01  STUDENT-RECORD.
           05  STUDENT-NAME         PIC X(20).
           05  STUDENT-ID           PIC 9(9).
           05  STUDENT-COURSES.
               10  COURSE-CODE      PIC X(6) OCCURS 5 TIMES.
       PROCEDURE DIVISION.
       100-MAIN.
           DISPLAY "STUDENT RECORD".
           MOVE CORRESPONDING COURSE-CODE TO STUDENT-COURSES.
           DISPLAY STUDENT-NAME " has the following courses:".
           PERFORM VARYING I FROM 1 BY 1
             UNTIL I > 5
               DISPLAY COURSE-CODE(I).
           END-PERFORM.
       END PROGRAM.