IDENTIFICATION DIVISION.
PROGRAM-ID. GENERATE-ARRAY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(2).
01 ARRAY OCCURS 0 TO 99 TIMES.
    05 VALUE PIC 9(5).

PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "Enter the size of the array: ".
    ACCEPT ARRAY-SIZE.

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
        MOVE FUNCTION RANDOM (10000) TO ARRAY(I)
    END-PERFORM.

    DISPLAY "Generated Array: ".

    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
        DISPLAY ARRAY(I)
    END-PERFORM.

STOP RUN.