IDENTIFICATION DIVISION.                          * Identification section
       PROGRAM-ID. myProgram.                              * Program name
       DATA DIVISION.                                      * Data section
       WORKING-STORAGE SECTION.                           * Local variables
       01 number1       PIC S9(3) VALUE 100.             * Define variable number 1
       01 number2       PIC S9(3) VALUE 200.             * Define variable number 2
       01 result        PIC S9(4) COMP.                  * Define variable result
       PROCEDURE DIVISION.                                * Procedure division
           COMPUTE result = number1 + number2.          * Add number1 and number2
           DISPLAY "Result: " result.                  * Display result
           STOP RUN.                                   * Stop the program