IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALARY.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT EMPLOYEE-FILE ASSIGN TO 'EMPLOYEES.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD EMPLOYEE-FILE.
01 EMPLOYEE-RECORD.
   05 EMPLOYEE-NAME        PIC X(20).
   05 EMPLOYEE-ID          PIC 9(6).
   05 EMPLOYEE-SALARY      PIC 9(9)V99.

WORKING-STORAGE SECTION.
01 TOTAL-SALARY           PIC 9(9)V99.

PROCEDURE DIVISION.
OPEN INPUT EMPLOYEE-FILE.
READ EMPLOYEE-FILE INTO EMPLOYEE-RECORD.
PERFORM UNTIL EMPLOYEE-FILE AT END
   ADD EMPLOYEE-SALARY TO TOTAL-SALARY
   READ EMPLOYEE-FILE INTO EMPLOYEE-RECORD
END-PERFORM.

CLOSE EMPLOYEE-FILE.
DISPLAY "TOTAL SALARY OF ALL EMPLOYEES: " TOTAL-SALARY.

STOP RUN.