IDENTIFICATION DIVISION.
   PROGRAM-ID. HelloWorld.
   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 MESSAGE PIC X(20) VALUE "Hello, World!".
   01 REVERSE-MESSAGE PIC X(20).
   PROCEDURE DIVISION.
       DISPLAY MESSAGE.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > LENGTH OF MESSAGE
           COMPUTE REVERSE-MESSAGE(I:I) = MESSAGE(LENGTH OF MESSAGE - I + 1:I).
       DISPLAY REVERSE-MESSAGE.
       STOP RUN.