IDENTIFICATION DIVISION.
       PROGRAM-ID. CHECK-SUM.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  INPUT-STR PIC X(80).
       01  CHKSUM-SUM  PIC S9(9) COMP VALUE 0.
       01  CHKSUM-C1   PIC S9(9) COMP VALUE 0.
       01  CHKSUM-C2   PIC S9(9) COMP VALUE 0.
       01  CHKSUM-C3   PIC S9(9) COMP VALUE 0.
       01  CHKSUM-C4   PIC S9(9) COMP VALUE 0.

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           PERFORM GET-INPUT-STRING
           PERFORM CALCULATE-CHECKSUM
           PERFORM DISPLAY-CHECKSUM
           STOP RUN.

       GET-INPUT-STRING.
           DISPLAY "ENTER A STRING OF CHARACTERS (MAXIMUM LENGTH 80): "
           ACCEPT INPUT-STR.

       CALCULATE-CHECKSUM.
       * CALCULATE CHECKSUM USING CRC-32 ALGORITHM
           MOVE 15263144 TO CHKSUM-C1
           ADD INPUT-STR TO CHKSUM-C1
           MULTIPLY CHKSUM-C1 BY 100001
           ADD 133037 TO CHKSUM-C1
           DIVIDE CHKSUM-C1 BY 100
           SET CHKSUM-C2 TO ZERO
           SET CHKSUM-C3 TO ZERO
           SET CHKSUM-C4 TO ZERO
           MOVE INPUT-STR(1:20) TO CHKSUM-C4
           MOVE INPUT-STR(21:20) TO CHKSUM-C3
           MOVE INPUT-STR(41:20) TO CHKSUM-C2
           ADD CHKSUM-C2 TO CHKSUM-C3
           ADD CHKSUM-C3 TO CHKSUM-C4
           ADD CHKSUM-C4 TO CHKSUM-SUM.

       DISPLAY-CHECKSUM.
       * DISPLAY CHECKSUM IN HEXADECIMAL FORMAT
           DISPLAY "CHECKSUM: "
           DISPLAY FUNCTION NUMVAL(CHKSUM-SUM) FORMAT "XXXXXXXXXXXXXXXX".