IDENTIFICATION DIVISION.
   PROGRAM-ID. SORT-PRIME.
   ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
   FILE-CONTROL.
       SELECT UNORDERED-FILE ASSIGN TO "UNORDFILE.TXT".
       SELECT PRIME-FILE    ASSIGN TO "PRIMEFILE.TXT".
   DATA DIVISION.
   FILE SECTION.
   FD UNORDERED-FILE
       VALUE OF FILE-ID IS UNORDERED-FILE.
   01 UNORDERED-RECORD.
       05 UNORDERED-KEY   PIC 999.
       05 UNORDERED-DATA  PIC X(50).
   SD PRIME-FILE
       VALUE OF FILE-ID IS PRIME-FILE.
   01 PRIME-RECORD.
       05 PRIME-KEY       PIC 999.
       05 PRIME-DATA      PIC X(50).
   WORKING-STORAGE SECTION.
   01 TOTAL            PIC 999.
   01 SUM              PIC 9.
   01 PRIME-NUMBER     PIC 999.
   01 END-FILE         PIC A.
   01 PRIME-ARRAY.
       05 PRIME-TABLE OCCURS 5000 INDEXED BY PRIME-INDEX.
          10 PRIME-NUM PIC 999.
   PROCEDURE DIVISION.
   000-MAIN.
       OPEN UNORDERED-FILE INPUT, PRIME-FILE OUTPUT.
       PERFORM 100-CALCULATE-TOTAL.
       PERFORM 200-GENERATE-PRIME-NUMBERS.
       PERFORM 300-SORT-PRIME.
       CLOSE UNORDERED-FILE, PRIME-FILE.
       STOP RUN.
   100-CALCULATE-TOTAL.
       MOVE ZERO TO TOTAL.
       PERFORM 110-READ-UNORDERED-FILE UNTIL END-READ = "Y".
       COMPUTE TOTAL = TOTAL + UNORDERED-KEY.
   110-READ-UNORDERED-FILE.
       READ UNORDERED-FILE INTO UNORDERED-RECORD AT END
           MOVE "Y" TO END-FILE.
   200-GENERATE-PRIME-NUMBERS.
       MOVE 2 TO PRIME-NUMBER.
       PERFORM 210-CHECK-PRIME UNTIL END-FILE = "Y".
   210-CHECK-PRIME.
       DIVIDE TOTAL BY PRIME-NUMBER GIVING SUM REMAINDER REMAINING.
       IF SUM = ZERO DISPLAY PRIME-NUMBER MOVE PRIME-NUMBER TO PRIME-TABLE(PRIME-INDEX)
                           ADD 1 TO PRIME-INDEX
       END-IF.
       ADD 1 TO PRIME-NUMBER.
   300-SORT-PRIME.
       SORT PRIME-TABLE ASCENDING USING PRIME-NUM.
       PERFORM 310-WRITE-SORTED-PRIME UNTIL PRIME-INDEX = ZERO.
   310-WRITE-SORTED-PRIME.
       MOVE PRIME-TABLE(PRIME-INDEX) TO PRIME-RECORD.
       WRITE PRIME-RECORD.
       SUBTRACT 1 FROM PRIME-INDEX.
   END PROGRAM SORT-PRIME.