IDENTIFICATION DIVISION.                                   
      PROGRAM-ID. SAMPLE.                                         
      ENVIRONMENT DIVISION.                                       
      DATA DIVISION.                                              
      WORKING-STORAGE SECTION.                                    
      01 WS-DATETIME-TODAY.                                        
         03 WS-YEAR PIC 9999 VALUE 2021.                           
         03 WS-MONTH PIC 99.                                       
         03 WS-DAY PIC 99.                                         
         03 WS-HOUR PIC 99.                                        
         03 WS-MINUTE PIC 99.                                      
         03 WS-SECOND PIC 99.                                      
      01 WS-DATETIME-TOMORROW.                                     
         03 WS-YEAR-TOMORROW PIC 9999 VALUE 0.                     
         03 WS-MONTH-TOMORROW PIC 99 VALUE 1.                      
         03 WS-DAY-TOMORROW PIC 99 VALUE 1.                        
      PROCEDURE DIVISION.                                          
      MAIN-PROCEDURE.                                              
         COMPUTE WS-YEAR-TOMORROW = WS-YEAR + 1.                   
         IF WS-MONTH = 12 THEN                                     
            MOVE 1 TO WS-MONTH-TOMORROW.                           
         ELSE                                                      
            COMPUTE WS-MONTH-TOMORROW = WS-MONTH + 1.              
         END-IF.                                                   
         IF (WS-DAY + 1) > 31                                       
            MOVE 1 TO WS-DAY-TOMORROW.                             
         ELSE                                                      
            COMPUTE WS-DAY-TOMORROW = WS-DAY + 1.                  
         END-IF.                                                   
         IF (WS-HOUR + 1) > 23                                      
            MOVE 0 TO WS-HOUR TOMORROW.                            
         ELSE                                                      
            COMPUTE WS-HOUR-TOMORROW = WS-HOUR + 1.                
         END-IF.                                                   
         IF (WS-MINUTE + 1) > 59                                    
            MOVE 0 TO WS-MINUTE-TOMORROW.                          
         ELSE                                                      
            COMPUTE WS-MINUTE-TOMORROW = WS-MINUTE + 1.            
         END-IF.                                                   
         IF (WS-SECOND + 1) > 59                                    
            MOVE 0 TO WS-SECOND-TOMORROW.                          
         ELSE                                                      
            COMPUTE WS-SECOND-TOMORROW = WS-SECOND + 1.            
         END-IF.