IDENTIFICATION DIVISION.
      PROGRAM-ID. generate-collatz.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 input-number PIC 9(7).
      01 steps-count PIC 9(7) VALUE 0.
      01 output-line PIC X(50).
      PROCEDURE DIVISION.
      0000-start.
      DISPLAY "Enter a number: ".
      ACCEPT input-number.
      COMPUTE output-line = "Collatz sequence generated for " 
             & input-number & ": ".
      DISPLAY output-line.
      PERFORM VARYING input-number FROM input-number BY 1 
             UNTIL input-number = 1
         COMPUTE steps-count = steps-count + 1.
         IF (MOD(input-number, 2) = 0)
         THEN
              COMPUTE input-number = input-number / 2.
              MOVE " "input-number " " TO output-line(45:50).
              DISPLAY output-line.
         ELSE
              COMPUTE input-number = (3 * input-number) + 1.
              MOVE " "input-number " " TO output-line(45:50).
              DISPLAY output-line.
         END-IF
      END-PERFORM.
      COMPUTE output-line = "Total number of steps: " & steps-count.
      DISPLAY output-line.
      STOP RUN.