IDENTIFICATION DIVISION.
PROGRAM-ID. ANNUAL-REPORT.
*
AUTHOR. JOHN DOE.
*
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
     SELECT SALES-FILE ASSIGN TO 'SALES.DAT'.
     READ SALES-FILE
        INVALID KEY DISPLAY 'SALES FILE COULD NOT BE READ'
                        STOP RUN.
*
DATA DIVISION.
FILE SECTION.
FD SALES-FILE.
01 SALES-RECORD.
   02 CUSTOMER-NAME      PIC X(30).
   02 CUSTOMER-ID        PIC X(10).
   02 SALES-YEAR         PIC 9(4).
   02 SALES-AMOUNT       PIC 9(9)V99.
*
WORKING-STORAGE SECTION.
01 TOTAL-SALES          PIC 9(9)V99.
*
PROCEDURE DIVISION.
DISPLAY "ANNUAL SALES REPORT FOR 2021".
PERFORM UNTIL SALES-FILE-STATUS NOT EQUAL TO '00'
   ADD SALES-AMOUNT TO TOTAL-SALES
   DISPLAY "SALES FOR" SALES-YEAR "WAS" SALES-AMOUNT
   READ SALES-FILE
      AT END DISPLAY "END OF REPORT"
              MOVE '01' TO SALES-FILE-STATUS
END-PERFORM.
DISPLAY "TOTAL SALES FOR 2021 WAS" TOTAL-SALES.
STOP RUN.