IDENTIFICATION DIVISION. 
       PROGRAM-ID. CALCULATE-INTEREST. 
       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 ACCOUNT-NUMBER PIC X(8). 
       01 PRINCIPAL AMOUNT PIC 9(5)V99. 
       01 INTEREST-RATE PIC 9(3)V99. 
       01 INTEREST-EARNED PIC 9(5)V99. 
       01 YEARS PIC 9(2). 
       01 FINAL-AMOUNT PIC 9(5)V99. 
       PROCEDURE DIVISION. 
       DISPLAY "Enter the Account Number: ". 
       ACCEPT ACCOUNT-NUMBER. 
       DISPLAY "Enter the Principal Amount: ". 
       ACCEPT PRINCIPAL-AMOUNT. 
       DISPLAY "Enter the Interest Rate: ". 
       ACCEPT INTEREST-RATE. 
       DISPLAY "Enter the Number of Years: ". 
       ACCEPT YEARS. 
       COMPUTE INTEREST-EARNED = (PRINCIPAL-AMOUNT * INTEREST-RATE * YEARS) / 100. 
       COMPUTE FINAL-AMOUNT = PRINCIPAL-AMOUNT + INTEREST-EARNED. 
       DISPLAY "Account Number: ", ACCOUNT-NUMBER. 
       DISPLAY "Final Amount: ", FINAL-AMOUNT. 
       STOP RUN.