IDENTIFICATION DIVISION.
       PROGRAM-ID. FIND-AVG.
       AUTHOR. YOURNAME.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MARKSFILE ASSIGN TO DISK "MARKS.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD MARKSFILE
       RECORDING MODE F.
       01 MARKS-RECORD.
           02 STUDENT-NAME PIC X(20).
           02 SUBJECT-NAME PIC X(20).
           02 MARK1 PIC 9(3).
           02 MARK2 PIC 9(3).
           02 MARK3 PIC 9(3).
           02 MARK4 PIC 9(3).
           02 MARK5 PIC 9(3).
       WORKING-STORAGE SECTION.
       01 MARKS-INFO.
           02 TOTAL-MARKS PIC 9(5).
           02 AVG-MARKS PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT MARKSFILE.
           PERFORM READ-PARA UNTIL STUDENT-NAME = "END".
           CLOSE MARKSFILE.
           COMPUTE AVG-MARKS = TOTAL-MARKS / 5.
           DISPLAY "Average marks for " STUDENT-NAME "is " AVG-MARKS.
           STOP RUN.
       READ-PARA.
           READ MARKSFILE INTO MARKS-RECORD.
           IF MARKSFILE NOT = END
               ADD MARK1 MARK2 MARK3 MARK4 MARK5 TO TOTAL-MARKS
           END-IF.