IDENTIFICATION DIVISION.                           * beginnning of identification division
PROGRAM-ID. MYPROGRAM.                              * program name is MYPROGRAM
DATA DIVISION.                                      * beginning of data division
WORKING-STORAGE SECTION.                            * declare working storage section
77 NUM1 PIC 99 VALUE 10.                            * declare variable NUM1 with format 99 and initial value 10
77 NUM2 PIC 99 VALUE 5.                             * declare variable NUM2 with format 99 and initial value 5
77 TOTAL PIC 99 VALUE 0.                            * declare variable TOTAL with format 99 and initial value 0
PROCEDURE DIVISION.                                 * beginning of procedure division
ADD NUM1 TO TOTAL.                                  * add NUM1 to TOTAL
ADD NUM2 TO TOTAL.                                  * add NUM2 to TOTAL
DISPLAY "The sum of NUM1 and NUM2 is: " TOTAL.       * display the sum
STOP RUN.                                           * end program execution