IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALARY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMPLOYEE-RECORD.
          05 EMPLOYEE-ID       PIC 9(9).
          05 EMPLOYEE-NAME     PIC X(20).
          05 HOURLY-RATE       PIC 9(3)V99.
          05 HOURS-WORKED      PIC 9(3).
          05 GROSS-SALARY      PIC 9(5)V99.
       PROCEDURE DIVISION.
          ACCEPT EMPLOYEE-ID, EMPLOYEE-NAME, HOURLY-RATE, HOURS-WORKED.
          COMPUTE GROSS-SALARY = HOURLY-RATE * HOURS-WORKED.
          DISPLAY "Employee ID: ", EMPLOYEE-ID.
          DISPLAY "Employee Name: ", EMPLOYEE-NAME.
          DISPLAY "Gross Salary: ", GROSS-SALARY.
          STOP RUN.