IDENTIFICATION DIVISION.                   * Begin identification division
PROGRAM-ID. SAMPLE.                         * Program name is SAMPLE
DATA DIVISION.                              * Begin data division
WORKING-STORAGE SECTION.                    * Begin working-storage section
01 SAMPLE-VARIABLE PIC X(10).               * Defines a variable called SAMPLE-VARIABLE with a pic X (allows for alphanumeric data) and a length of 10
01 SAMPLE-NUMBER PIC 9(5)V99 VALUE 100.50.   * Defines a variable called SAMPLE-NUMBER with a pic 9 (allows for numeric data) and a length of 5 with 2 decimal places, initialized to a value of 100.50
PROCEDURE DIVISION.                         * Begin procedure division
MAIN.                                       * Main program
ADD 5 TO SAMPLE-NUMBER.                     * Adds 5 to the value of SAMPLE-NUMBER
MOVE "Hello!" TO SAMPLE-VARIABLE.           * Moves the string "Hello!" into the variable SAMPLE-VARIABLE
DISPLAY "The value of SAMPLE-NUMBER is " SAMPLE-NUMBER.  * Displays the message "The value of SAMPLE-NUMBER is " followed by the value of SAMPLE-NUMBER
DISPLAY "Hello, " SAMPLE-VARIABLE.          * Displays the message "Hello, " followed by the value of SAMPLE-VARIABLE
STOP RUN.                                   * End program execution