IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.        * Program Name
       AUTHOR. JOHN SMITH.            * Author Name
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT FIRST-FILE ASSIGN TO "FIRSTFILE.DAT".   * Assigns a file to be read
       SELECT SECOND-FILE ASSIGN TO "SECONDFILE.DAT". * Assigns a file to be written
       DATA DIVISION.
       FILE SECTION.
       FD FIRST-FILE                                     * File descriptor for first file
          RECORD IS VARYING FROM 1 TO 50
          DEPENDING ON REC-COUNT.                        * Sets the number of records to be read
       01 FILE-RECORD.
          05 FILE-NAME       PIC X(20).                 * Defines the record structure
          05 FILE-ID         PIC 9(5).
          05 FILE-AMOUNT     PIC 9(9)V99.
       FD SECOND-FILE
          RECORD IS VARYING FROM 1 TO 50
          DEPENDING ON REC-COUNT.
       01 WRITE-RECORD.
          05 TRANS-NAME      PIC X(20).
          05 TRANS-ID        PIC 9(5).
          05 TRANS-AMOUNT    PIC 9(9)V99.
       WORKING-STORAGE SECTION.
       01 REC-COUNT         PIC 9(3) VALUE ZERO.        * Initializes record count
       PROCEDURE DIVISION.
       OPEN INPUT FIRST-FILE.                            * Opens first file for reading
       OPEN OUTPUT SECOND-FILE.                          * Opens second file for writing
       START READ FIRST-FILE                              * Begins reading first file
          AT END GO TO END-OF-FILE.
       PERFORM UNTIL REC-COUNT = 50                       * Reads 50 records
          MOVE FILE-NAME TO TRANS-NAME                    * Moves data from first file to second file
          MOVE FILE-ID TO TRANS-ID
          MOVE FILE-AMOUNT TO TRANS-AMOUNT
          WRITE WRITE-RECORD                             * Writes data to second file
          ADD 1 TO REC-COUNT.                            * Increments record count
          READ FIRST-FILE                                 
       END-PERFORM.
       CLOSE FIRST-FILE.                                 * Closes first file
       CLOSE SECOND-FILE.                                * Closes second file
       END PROCEDURE DIVISION.