IDENTIFICATION DIVISION.                            
       PROGRAM-ID. SAMPLE.                                   
       ENVIRONMENT DIVISION.                                
       INPUT-OUTPUT SECTION.                                
       FILE-CONTROL.                                        
       SELECT INFILE 
              ASSIGN TO "INPUT.DAT" 
              ORGANIZATION IS LINE SEQUENTIAL.               
       SELECT OUTFILE 
              ASSIGN TO "OUTPUT.DAT" 
              ORGANIZATION IS LINE SEQUENTIAL.               
       DATA DIVISION.                                        
       FILE SECTION.                                         
       FD INFILE.                                               
       01 FILE-RECORD-IN.                                           
          03 NAME-IN PIC X(20).                             
          03 ADDRESS-IN PIC X(30).                          
          03 CITY-IN PIC X(20).                             
          03 STATE-IN PIC X(2).                              
          03 ZIP-IN PIC X(5).                                
       FD OUTFILE.                                               
       01 FILE-RECORD-OUT.                                          
          03 NAME-OUT PIC X(20).                            
          03 ADDRESS-OUT PIC X(30).                         
          03 PHONE-OUT PIC X(12).                           
       WORKING-STORAGE SECTION.                              
       01 EOF-SWITCH PIC X(3) VALUE 'NO'.                     
       PROCEDURE DIVISION.                                    
       1000-MAIN-LOOP SECTION.                               
       OPEN INPUT INFILE.                                     
       OPEN OUTPUT OUTFILE.                                   
       READ INFILE INTO FILE-RECORD-IN.                       
       PERFORM UNTIL EOF-SWITCH = 'YES'.                      
           IF FILE-RECORD-IN(1:1) = 'A' OR                   
              FILE-RECORD-IN(1:1) = 'E' OR                   
              FILE-RECORD-IN(1:1) = 'I' OR                   
              FILE-RECORD-IN(1:1) = 'O' OR                   
              FILE-RECORD-IN(1:1) = 'U'                     
           ADD 1 TO CNT.                                      
           MOVE NAME-IN TO NAME-OUT.                          
           MOVE ADDRESS-IN TO ADDRESS-OUT.                    
           MOVE CITY-IN TO CITY-OUT.                          
           MOVE (STATE-IN, ZIP-IN) TO PHONE-OUT(1:12).        
           WRITE FILE-RECORD-OUT.                             
           ACCEPT FILE-RECORD-IN FROM INFILE.                 
           IF FILE-RECORD-IN(1:1) = 'Y'                      
           MOVE 'YES' TO EOF-SWITCH.                          
       END-IF.                                                
       END-PERFORM.                                             
       CLOSE INFILE.                                          
       CLOSE OUTFILE.                                         
       DISPLAY 'NUMBER OF CUSTOMERS WITH NAMES STARTING WITH A, E, I, O, U: ' CNT.        
       9999-EXIT SECTION.                                    
       STOP RUN.                                              
       END PROGRAM SAMPLE.