IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLEPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 USERNAME PIC X(20).
01 PASSWORD PIC X(20).
01 RESULT PIC X(3).

PROCEDURE DIVISION.
DISPLAY "Enter Username: ".
ACCEPT USERNAME.

DISPLAY "Enter Password: ".
ACCEPT PASSWORD.

IF USERNAME = "admin" AND PASSWORD = "password" THEN
    MOVE "YES" TO RESULT
ELSE
    MOVE "NO" TO RESULT.
END-IF.

DISPLAY "Access Granted: " RESULT.

STOP RUN.