IDENTIFICATION DIVISION.            \\ This is the first division of a COBOL program
PROGRAM-ID. SAMPLE.                 \\ Defines the program name as SAMPLE

DATA DIVISION.                      \\ This division declares all data used in the program
WORKING-STORAGE SECTION.            \\ This section is used to declare variables

01 STUDENT-DATA.                    \\ This is a group variable that will hold student data
    05 STUDENT-NAME PIC X(20).       \\ This variable will hold student's name
    05 STUDENT-ID PIC 9(9).          \\ This variable will hold student's ID number
    05 COURSES-TAKEN PIC 9(2).       \\ This variable will hold the number of courses taken

PROCEDURE DIVISION.                 \\ This division contains the actual program logic
MAIN-LOGIC.
    DISPLAY "WELCOME TO THE STUDENT RECORD SYSTEM." /* This displays a welcome message */
    ACCEPT STUDENT-NAME.             /* Prompts user to enter student's name */
    ACCEPT STUDENT-ID.               /* Prompts user to enter student's ID number */
    ACCEPT COURSES-TAKEN.            /* Prompts user to enter number of courses taken */
    IF COURSES-TAKEN > 0             /* Checks if student has taken any courses */
        PERFORM DISPLAY-COURSES      /* If true, execute DISPLAY-COURSES paragraph */
    ELSE
        DISPLAY "STUDENT HAS NOT TAKEN ANY COURSES." /* If false, display message */
    END-IF.
    STOP RUN.                       \\ Ends the program execution

DISPLAY-COURSES.                    \\ This paragraph will display list of courses taken
    DISPLAY "COURSES TAKEN:"
    PERFORM VARYING I FROM 1 BY 1    \\ Performs an iterative display using loop
        UNTIL I > COURSES-TAKEN      \\ Loop will stop when all courses are displayed
        DISPLAY "COURSE " I " :"
        ACCEPT COURSE-CODE(I, 5)     \\ Accepts input for course code up to 5 characters
        ACCEPT COURSE-NAME(I, 20)    \\ Accepts input for course name up to 20 characters
    END-PERFORM.