IDENTIFICATION DIVISION. 
      PROGRAM-ID. HELLO-WORLD. 
 
      DATA DIVISION. 
      WORKING-STORAGE SECTION. 
      01 HELLO-MESSAGE PIC X(22) VALUE 'HELLO, WORLD!'. 
 
      PROCEDURE DIVISION. 
      DISPLAY 'PROGRAM STARTING!'. 
      DISPLAY HELLO-MESSAGE. 
      STOP RUN.