01 CUSTOMER-RECORD.            # A level 01 data record called CUSTOMER-RECORD.
          05 CUSTOMER-NAME PIC X(20).  # A field called CUSTOMER-NAME with a length of 20 characters.
          05 CUSTOMER-ID PIC 9(6).     # A field called CUSTOMER-ID with a length of 6 numeric characters.
          05 CUSTOMER-ADDRESS.        # A group field called CUSTOMER-ADDRESS.
             10 ADDRESS-LINE-1 PIC X(30).  # A field called ADDRESS-LINE-1 with a length of 30 characters.
             10 ADDRESS-LINE-2 PIC X(30).  # A field called ADDRESS-LINE-2 with a length of 30 characters.
             10 CITY PIC X(20).            # A field called CITY with a length of 20 characters.
             10 STATE PIC X(2).            # A field called STATE with a length of 2 characters.
             10 ZIP-CODE PIC 9(5).         # A field called ZIP-CODE with a length of 5 numeric characters.
       01 INVOICE-RECORD.             # A level 01 data record called INVOICE-RECORD.
          05 INVOICE-NUMBER PIC 9(6).  # A field called INVOICE-NUMBER with a length of 6 numeric characters.
          05 CUSTOMER-INFO REDEFINES CUSTOMER-RECORD.  # A REDEFINES clause to restructure CUSTOMER-RECORD.
             10 CUSTOMER-NAME-INFO PIC X(20).        # A field called CUSTOMER-NAME-INFO with a length of 20 characters.
             10 CUSTOMER-ID-INFO PIC 9(6).           # A field called CUSTOMER-ID-INFO with a length of 6 numeric characters.
             10 CUSTOMER-ADDRESS-INFO REDEFINES CUSTOMER-ADDRESS.  # A REDEFINES clause to restructure CUSTOMER-ADDRESS.
                15 ADDRESS-LINE-1-INFO PIC X(30).    # A field called ADDRESS-LINE-1-INFO with a length of 30 characters.
                15 ADDRESS-INFO REDEFINES ADDRESS-LINE-2.        # A REDEFINES clause to restructure ADDRESS-LINE-2.
                   20 ADDRESS-LINE-2-INFO PIC X(30).  # A field called ADDRESS-LINE-2-INFO with a length of 30 characters.
                15 CITY-INFO PIC X(20).                # A field called CITY-INFO with a length of 20 characters.
                15 STATE-INFO PIC X(2).                # A field called STATE-INFO with a length of 2 characters.
                15 ZIP-CODE-INFO PIC 9(5).             # A field called ZIP-CODE-INFO with a length of 5 numeric characters.
          05 ITEM-INFO OCCURS 5 TIMES.   # An occurs clause to define ITEM-INFO as an array of size 5.
             10 ITEM-NUMBER PIC 9(6) OCCURS 5 TIMES.           # A field called ITEM-NUMBER with a length of 6 numeric characters, occurs 5 times.
             10 ITEM-DESCRIPTION PIC X(50) OCCURS 5 TIMES.    # A field called ITEM-DESCRIPTION with a length of 50 characters, occurs 5 times.
             10 ITEM-QUANTITY PIC 9(3) OCCURS 5 TIMES.        # A field called ITEM-QUANTITY with a length of 3 numeric characters, occurs 5 times.
             10 ITEM-PRICE PIC 9(6)V99 OCCURS 5 TIMES.        # A field called ITEM-PRICE with a length of 6 numeric characters and 2 decimal places, occurs 5 times.
             10 ITEM-TOTAL PIC 9(6)V99 OCCURS 5 TIMES COMPUTATIONAL-3.  # A field called ITEM-TOTAL with a length of 6 numeric characters and 2 decimal places, occurs 5 times, defined as a fixed decimal number in packed-decimal format.