IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(2).
01 NUM2 PIC 9(2).
01 SUMMATION PIC 9(3).

PROCEDURE DIVISION.
    DISPLAY "Enter first number: ".
    ACCEPT NUM1.
    DISPLAY "Enter second number: ".
    ACCEPT NUM2.
    ADD NUM1 TO NUM2 GIVING SUMMATION.
    DISPLAY "The sum is: " SUMMATION.
    STOP RUN.
END PROGRAM CALCULATION.