* This is a sample code snippet in COBOL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       * This is a comment statement.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO "INPUT.TXT" 
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT OUT-FILE ASSIGN TO "OUTPUT.TXT" 
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 INPUT-RECORD.
           05 STUDENT-ID PIC X(10).
           05 STUDENT-NAME PIC X(20).
           05 STUDENT-AGE PIC 9(2).

       FD OUT-FILE.
       01 OUTPUT-RECORD.
           05 FORMATTED-RECORD PIC X(45).

       WORKING-STORAGE SECTION.
       01 INDEX PIC 99 VALUE 1.

       PROCEDURE DIVISION.
       MAIN-PARA.
       OPEN INPUT IN-FILE
           OUTPUT OUT-FILE.
       
       PERFORM UNTIL INDEX > 50
           READ IN-FILE
               AT END MOVE "END OF FILE" TO FORMATTED-RECORD
               NOT AT END PERFORM PROCESS-PARA
           END-READ
           WRITE OUTPUT-RECORD.

       CLOSE IN-FILE OUT-FILE
       STOP RUN.

       PROCESS-PARA.
       MOVE STUDENT-NAME TO FORMATTED-RECORD(1:20)
       MOVE STUDENT-ID TO FORMATTED-RECORD(21:10)
       MOVE STUDENT-AGE TO FORMATTED-RECORD(31:2)
       ADD 1 TO INDEX.