*> This is a sample program in COBOL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
              SELECT EMPLOYEES-IN
                     ASSIGN TO "EMPLOYEE.DAT".
              SELECT EMPLOYEES-OUT
                     ASSIGN TO "EMPLOYEE.RPT".
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEES-IN.
              01 EMPLOYEE-RECORD-IN.
                  05 EMPLOYEE-ID-IN       PIC 9(5).
                  05 EMPLOYEE-NAME-IN     PIC X(20).
                  05 EMPLOYEE-SALARY-IN   PIC 9(6)V99.
       FD EMPLOYEES-OUT.
              01 EMPLOYEE-RECORD-OUT       PIC 9(5).
                  05 EMPLOYEE-NAME-OUT     PIC X(20).
                  05 EMPLOYEE-SALARY-OUT   PIC 9(6)V99.
       WORKING-STORAGE SECTION.
       01 SUBTOTALS                 PIC 9(6)V99.
       01 NUM-EMPLOYEES             PIC 99.
       01 EMPLOYEE-COUNT            PIC 99.
       01 TOTAL-SALARY              PIC 9(8)V99 VALUE ZERO.
       01 AVERAGE-SALARY            PIC 9(6)V99 VALUE ZERO.
       PROCEDURE DIVISION.
       OPEN-OUTPUT.
              OPEN EMPLOYEES-IN.
              OPEN EMPLOYEES-OUT.
       COUNT-EMPLOYEES.
              PERFORM UNTIL NUM-EMPLOYEES = 0
                     READ EMPLOYEES-IN
                     AT END SET NUM-EMPLOYEES TO EMPLOYEE-COUNT
                     IF EMPLOYEE-SALARY-IN > 100000
                            ADD 1 TO EMPLOYEE-COUNT
                            DISPLAY "High salary alert!"
                            DISPLAY EMPLOYEE-RECORD-IN
                     ELSE
                            MULTIPLY EMPLOYEE-SALARY-IN BY 1.1
                            MOVE EMPLOYEE-RECORD-IN TO EMPLOYEE-RECORD-OUT
                            WRITE EMPLOYEE-RECORD-OUT
              END-PERFORM.
       CALCULATE-TOTAL.
              MOVE ZERO TO SUBTOTALS
              PERFORM VARYING EMPLOYEE-COUNT FROM 1 BY 1
                     UNTIL EMPLOYEE-COUNT > NUM-EMPLOYEES
                     READ EMPLOYEES-IN
                     AT END SET EMPLOYEE-COUNT TO NUM-EMPLOYEES
                     ADD EMPLOYEE-SALARY-IN TO SUBTOTALS
                     ADD 1 TO NUM-EMPLOYEES
              END-PERFORM.
       CALCULATE-AVERAGE.
              DIVIDE SUBTOTALS BY NUM-EMPLOYEES
              MOVE SUBTOTALS TO TOTAL-SALARY
              MOVE AVERAGE-SALARY TO AVERAGE-SALARY
              DISPLAY "The total salary of all employees is" TOTAL-SALARY
              DISPLAY "The average salary is" AVERAGE-SALARY
       CLOSE-FILES.
              CLOSE EMPLOYEES-IN
              CLOSE EMPLOYEES-OUT.
       STOP RUN.