IDENTIFICATION DIVISION.
PROGRAM-ID. MY-COBOL-PROGRAM.

*This program calculates the average of three numbers given by the user

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1        PIC 999V99 VALUE 0.00.
01 NUM2        PIC 999V99 VALUE 0.00.
01 NUM3        PIC 999V99 VALUE 0.00.
01 AVERAGE     PIC 99V99 VALUE 0.00.
01 TOTAL       PIC 999V99 VALUE 0.00.

PROCEDURE DIVISION.
    DISPLAY "Please enter the first number: "
    ACCEPT NUM1
    DISPLAY "Please enter the second number: "
    ACCEPT NUM2
    DISPLAY "Please enter the third number: "
    ACCEPT NUM3

    COMPUTE TOTAL = NUM1 + NUM2 + NUM3
    COMPUTE AVERAGE = TOTAL/3

    DISPLAY "The average of " NUM1 ", " NUM2 " and " NUM3 " is " AVERAGE

STOP RUN.