Identification Division.
Program-ID. Main.
Author. John Doe.

Environment Division.
Configuration Section.
Source-Computer. IBM-PC.
Object-Computer. IBM-PC.

Data Division.
Working-Storage Section.
01 Employee-Record.
   05 Employee-ID			PIC 9(6).
   05 Employee-Name			PIC X(20).
   05 Salary		        PIC 9(9)V99.
   05 Department-Code			PIC 9(3).
01 Department-Table.
   05 Department-Code			PIC 9(3).
   05 Department-Name			PIC X(20).
   05 Department-Manager		PIC X(20).

Procedure Division.
Begin.
   Display "Please enter employee ID:".
   Accept Employee-ID.
   Display "Please enter department code:".
   Accept Department-Code.
   Perform Validate-Employee.
   Perform Validate-Department.
   Perform Calculate-Salary.
   Display Employee-Name "has a salary of" Salary "in the" Department-Name "department."
   Stop Run.
   
Validate-Employee.
   If Employee-ID > 999999
      Display "Invalid Employee ID, must be 6 digits.".
      Stop Run.
   End-If.
   
Validate-Department.
   Perform Varying Index from 1 by 1
      Until Index > 10
         If Department-Code = Department-Table(Index:3)
            Move Department-Table(Index:3) to Department-Name.
            Move Department-Table(Index:4) to Department-Manager.
         End-If.
      End-Perform.
   If Department-Name = Spaces
      Display "Invalid Department Code, please try again.".
      Stop Run.
   End-If.
   
Calculate-Salary.
   Multiply Salary by 1.05
   Giving Salary.
   If Department-Code = 018
      Add 50000 to Salary.
   End-If.
   
End Program Main.