* This is a sample program in COBOL that calculates the area of a circle.
IDENTIFICATION DIVISION.
PROGRAM-ID. CIRCLE-AREA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 PI PIC 9V9 COMP.
01 RADIUS PIC 9(2)V9(2).
01 AREA PIC 9(6)V99.
PROCEDURE DIVISION.
MAIN.
	* Input radius from user
	DISPLAY "Enter the radius of the circle: "
	ACCEPT RADIUS
	
	* Calculate PI using approximated value
	COMPUTE PI = 3.141592653589793
	
	* Calculate area using formula PI * radius squared
	COMPUTE AREA = PI * (RADIUS ** 2)
	
	* Display the calculated area
	DISPLAY "The area of the circle is: " AREA
	
	STOP RUN.