IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMER-INFO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT CUSTOMER-FILE ASSIGN TO "CUSTOMER.DAT"
            ORGANIZATION IS LINE SEQUENTIAL.
            SELECT OUTPUT-FILE ASSIGN TO "CUSTOMER-REPORT.TXT"
            ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMER-FILE.
       01 CUSTOMER-RECORD.
            05 CUSTOMER-ID        PIC 9(6).
            05 CUSTOMER-NAME      PIC X(20).
            05 CUSTOMER-ADDRESS   PIC X(30).
            05 CUSTOMER-AGE       PIC 9(2).
            05 CUSTOMER-BALANCE   PIC 9(10)V99.

       FD OUTPUT-FILE.
       01 REPORT-LINE             PIC X(80).

       WORKING-STORAGE SECTION.
       01 HEADER-LINE.
            05                   PIC X(40) VALUE "CUSTOMER INFORMATION REPORT".
            05                   PIC X(22) VALUE SPACES.
            05                   PIC X(8) VALUE "DATE:".
            05 DATE-PRINT         PIC XX/XX/XXXX.

       PROCEDURE DIVISION.
       OPEN INPUT CUSTOMER-FILE
       OUTPUT OUTPUT-FILE.
       READ CUSTOMER-FILE
          AT END
             MOVE "NO RECORDS FOUND" TO REPORT-LINE
             WRITE REPORT-LINE
             CLOSE CUSTOMER-FILE
             CLOSE OUTPUT-FILE
             STOP RUN.
       WRITE HEADER-LINE
       PERFORM UNTIL END-OF-FILE
           MOVE CUSTOMER-NAME TO REPORT-LINE
           WRITE REPORT-LINE
           READ CUSTOMER-FILE
       END-PERFORM.
       CLOSE CUSTOMER-FILE
       CLOSE OUTPUT-FILE
       STOP RUN.