IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "INFILE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT OUTPUT-FILE ASSIGN TO "OUTFILE.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD.
           05 NUM1 PIC 9(4).
           05 NUM2 PIC 9(4).
       FD OUTPUT-FILE.
       01 OUTPUT-RECORD.
           05 SUM PIC 9(5).

       WORKING-STORAGE SECTION.
       01 TOTAL-SUM PIC 9(5).
       01 EOF-FLAG PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE.
       OPEN OUTPUT OUTPUT-FILE.
       PERFORM UNTIL EOF-FLAG = 'Y'
           READ INPUT-FILE
           AT END
               MOVE 'Y' TO EOF-FLAG
           NOT AT END
               ADD NUM1 NUM2 TO TOTAL-SUM
               MOVE TOTAL-SUM TO SUM
               WRITE OUTPUT-RECORD
       END-PERFORM.
       CLOSE INPUT-FILE.
       CLOSE OUTPUT-FILE.
       STOP RUN.