IDENTIFICATION DIVISION.
      PROGRAM-ID. MULTIPLY.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
            SELECT INPUT-FILE ASSIGN TO "INPUT-FILE.DAT"
            ORGANIZATION IS LINE SEQUENTIAL.

            SELECT OUTPUT-FILE ASSIGN TO "OUTPUT-FILE.DAT"
            ORGANIZATION IS LINE SEQUENTIAL.

      DATA DIVISION.
      FILE SECTION.
      FD INPUT-FILE.
      01 INPUT-RECORD.
            05 INPUT-NUMBER PIC 9(5)V9(2).

      FD OUTPUT-FILE.
      01 OUTPUT-RECORD PIC 9(8)V9(2).

      WORKING-STORAGE SECTION.
      01 TEMP-NUMBER PIC 9(8)V9(2).
      01 MULTIPLIER PIC 9(2).

      PROCEDURE DIVISION.
      OPEN INPUT INPUT-FILE
           OUTPUT OUTPUT-FILE.

      MULTIPLY-LOOP.
           READ INPUT-FILE
                AT END MOVE 1 TO MULTIPLIER
           END-READ.

           MULTIPLY-AGAIN.
           MULTIPLY INPUT-NUMBER BY MULTIPLIER GIVING
                      TEMP-NUMBER.

           WRITE OUTPUT-RECORD FROM TEMP-NUMBER
           IF MULTIPLIER < 10
           ADD 1 TO MULTIPLIER
           GO TO MULTIPLY-AGAIN
           END-IF.

           CLOSE INPUT-FILE OUTPUT-FILE.

           STOP RUN.