IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "input.txt"
           SELECT OUTPUT-FILE ASSIGN TO "output.txt".
       
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-ID PIC 9(5).
           05 EMPLOYEE-NAME PIC X(25).
           05 EMPLOYEE-AGE PIC 9(2).
       
       FD OUTPUT-FILE.
       01 OUTPUT-RECORD PIC X(30).
       
       WORKING-STORAGE SECTION.
       77 TOTAL-EMPLOYEES PIC 9(3).
       77 TOTAL-AGES PIC 9(4).
       77 AVERAGE-AGE PIC 9(4)V9(2).
       
       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE
       
       PERFORM UNTIL EOF
           READ INPUT-FILE INTO EMPLOYEE-RECORD
           AT END MOVE "Y" TO EOF
           IF NOT EOF
               ADD 1 TO TOTAL-EMPLOYEES
               ADD EMPLOYEE-AGE TO TOTAL-AGES
           END-IF
       END-PERFORM.
       
       DIVIDE TOTAL-AGES BY TOTAL-EMPLOYEES GIVING AVERAGE-AGE.
       
       MOVE "The total number of employees is " TO OUTPUT-RECORD
       DISPLAY OUTPUT-RECORD
       MOVE TOTAL-EMPLOYEES TO OUTPUT-RECORD
       DISPLAY OUTPUT-RECORD
       MOVE "The average age is " TO OUTPUT-RECORD
       DISPLAY OUTPUT-RECORD
       MOVE AVERAGE-AGE TO OUTPUT-RECORD
       DISPLAY OUTPUT-RECORD.
       
       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE.
       
       STOP RUN.