IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME-IN PIC X(20).
01 NAME-OUT PIC X(20).
02 TOTAL-SALARY-IN PIC 9(5)V99.
02 TOTAL-SALARY-OUT PIC 9(5)V99.
01 BONUS PIC 9(3).
01 TAX-RATE PIC 9(3).
PROCEDURE DIVISION.
ACCEPT NAME-IN
DISPLAY "TEAM MEMBER NAME:" PP 05
MOVE NAME-IN TO NAME-OUT
ACCEPT TOTAL-SALARY-IN
DISPLAY "TOTAL SALARY:" PP 05
DIVIDE TOTAL-SALARY-IN BY 12 GIVING TOTAL-SALARY-OUT
ACCEPT BONUS
DISPLAY "BONUS PERCENTAGE:" PP 05
MULTIPLY TOTAL-SALARY-OUT BY BONUS GIVING TOTAL-SALARY-OUT
ACCEPT TAX-RATE
DISPLAY "TAX RATE:" PP 05
MULTIPLY TOTAL-SALARY-OUT BY TAX-RATE GIVING TOTAL-SALARY-OUT
DISPLAY "TEAM MEMBER NAME:" PP 05 NAME-OUT
DISPLAY "TOTAL SALARY:" PP 05 TOTAL-SALARY-OUT
STOP RUN.