EVALUATE TRUE
WHEN condition1
   PERFORM display-section1
WHEN condition2
   PERFORM display-section2
WHEN condition3
   PERFORM display-section3
OTHERWISE
   PERFORM display-section4
END-EVALUATE