IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPROGRAM.
       ENVIRONMENT DIVISION.
	 CONFIGURATION SECTION.
	 SOURCE-COMPUTER. IBM-370.
	 OBJECT-COMPUTER. IBM-370.
	 DATA DIVISION.
	 FILE SECTION.
	 FD INFILE
	 	EXTERNAL FILE IS 'INPUTFILE.DAT'
	 	RECORD CONTAINS 80 CHARACTERS
	 	BLANK RECORD IS OMITTED
	 	LABEL RECORD IS STANDARD
	 	RECORDING MODE IS F
	 	BLOCK CONTAINS 0 RECORDS
	 	BLANK WHEN ZERO
	 RECORD SECTION.
	 01 INFILE-RECORD.
	 	05 NAME-FIELD PIC X(30).
	 	05 ADDRESS-FIELD PIC X(40).
	 	05 SALARY-FIELD PIC 9(6)V99.
	 	05 DEPT-FIELD PIC 99.
	 WORKING-STORAGE SECTION.
	 01 TOTAL-SALARY PIC 9(8)V99 VALUE 0.
	 01 AVG-SALARY PIC 9(6)V99 VALUE 0.
	 PROCEDURE DIVISION.
	 000-MAIN.
	 	DISPLAY "CALCULATING AVERAGE SALARY...".
	 	OPEN INPUT INFILE.
	 	READ INFILE
	 		AT END
	 			GO TO 999-EXIT.
	 	ADD SALARY-FIELD TO TOTAL-SALARY
	 	GO TO 000-MAIN.
	 999-EXIT.
	 	CLOSE INFILE.
	 	DIVIDE TOTAL-SALARY BY 100
	 		GIVING AVG-SALARY.
	 	DISPLAY "THE AVERAGE SALARY IS " AVG-SALARY.