IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "input.txt".
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 TEXT PIC X(20).
       WORKING-STORAGE SECTION.
       77 CHAR-COUNT PIC 9 DIGITS.
       77 WORD-COUNT PIC 9 DIGITS.
       77 CHECK PIC 9.
       77 SPACE PIC X.
       PROCEDURE DIVISION.
       OPEN INPUT INFILE.
       READ INFILE INTO TEXT.
       PERFORM VARYING CHAR-COUNT FROM 1 BY 1 
           UNTIL CHAR-COUNT > 20
           IF CHAR-COUNT >= 20
               MOVE 20 TO CHAR-COUNT
           END-IF
       END-PERFORM.
       PERFORM VARYING CHAR-COUNT FROM 1 BY 1 
           UNTIL CHAR-COUNT > 20
           IF CHAR-COUNT = SPACE OR CHAR-COUNT = CHECK
               ADD 1 TO WORD-COUNT
           END-IF
       END-PERFORM.
       MOVE WORD-COUNT TO CHECK.
       CLOSE INFILE.
       DISPLAY "TOTAL NUMBER OF CHARACTERS READ: ", CHAR-COUNT.
       DISPLAY "TOTAL NUMBER OF WORDS READ: ", WORD-COUNT.
       STOP RUN.