IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATION-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NUMBER PIC 9(5).
       01 SECOND-NUMBER PIC 9(5).
       01 RESULT PIC 9(6).
       PROCEDURE DIVISION.
       MAIN-PROGRAM.
          DISPLAY "Enter the first number: ".
          ACCEPT FIRST-NUMBER.
          DISPLAY "Enter the second number: ".
          ACCEPT SECOND-NUMBER.
          MULTIPLY FIRST-NUMBER BY SECOND-NUMBER GIVING RESULT.
          DISPLAY "The result is: ", RESULT.
          STOP RUN.