IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-SALARY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-BASIC-SALARY PIC 9(5).
    88 WS-SALARY-ERROR VALUE 0 THRU 50000.
    88 WS-SALARY-OK VALUE 50001 THRU 99999.
    88 WS-SALARY-HIGH VALUE 100000 THRU 999999.
01 WS-EXTRA-ALLOWANCE PIC 9(5).
    88 WS-ALLOWANCE-ERROR VALUE 0 THRU 5000.
    88 WS-ALLOWANCE-OK VALUE 5001 THRU 9999.
    88 WS-ALLOWANCE-HIGH VALUE 10000 THRU 99999.
01 WS-TOTAL-SALARY PIC 9(7).
01 WS-TAX-RATE PIC 9(2) VALUE 20.
01 WS-TAX-AMOUNT PIC 9(7).
01 WS-SOCIAL-SECURITY-TAX PIC 9(2) VALUE 5.
01 WS-EMPLOYEE-CONTRIBUTION PIC 9(7).
01 WS-EMPLOYER-CONTRIBUTION PIC 9(7).
PROCEDURE DIVISION.
ACCEPT WS-BASIC-SALARY.
ACCEPT WS-EXTRA-ALLOWANCE.
IF WS-SALARY-ERROR
    DISPLAY "BASIC SALARY MUST BE BETWEEN 0 AND 50,000."
ELSE IF WS-ALLOWANCE-ERROR
    DISPLAY "EXTRA ALLOWANCE MUST BE BETWEEN 0 AND 5,000."
ELSE
    COMPUTE WS-TOTAL-SALARY = WS-BASIC-SALARY + WS-EXTRA-ALLOWANCE.
    IF WS-SALARY-OK
        COMPUTE WS-TAX-AMOUNT = WS-TOTAL-SALARY * (WS-TAX-RATE / 100).
        COMPUTE WS-EMPLOYEE-CONTRIBUTION = WS-TOTAL-SALARY * (WS-SOCIAL-SECURITY-TAX / 100).
        COMPUTE WS-EMPLOYER-CONTRIBUTION = WS-EMPLOYEE-CONTRIBUTION.
        DISPLAY "TOTAL SALARY IS " WS-TOTAL-SALARY " WITH " WS-TAX-AMOUNT " DEDUCTED FOR TAX AND " WS-EMPLOYEE-CONTRIBUTION " DEDUCTED FOR SOCIAL SECURITY."
    ELSE IF WS-SALARY-HIGH
        DISPLAY "TOTAL SALARY IS " WS-TOTAL-SALARY " WITH " WS-EMPLOYER-CONTRIBUTION " DEDUCTED FOR SOCIAL SECURITY."
    END IF.
END IF.
STOP RUN.