IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 STUDENT-NAME PIC X(20).
01 STUDENT-ID PIC 9(9).
01 COURSE