IDENTIFICATION DIVISION.                            * `IDENTIFICATION DIVISION` identifies the beginning of the program. It contains the name of the program and other informational details.
PROGRAM-ID. SAMPLE.                                  * `PROGRAM-ID` is used to give the program a unique name.
AUTHOR. JOHN DOE.                                    * `AUTHOR` specifies the name of the program's author.
*
* Working-Storage Section.                          * `Working-Storage Section` allows you to declare variables used in the program.
*
WORKING-STORAGE SECTION.
01 NUM-A     PIC 9(02).                               * `01` is the level number and `NUM-A` is the name of the variable. `PIC` signifies that it is a numeric field and `9` indicates that it can hold numbers from 0 to 9. `(02)` denotes that it can hold 2 digits.
01 NUM-B     PIC 9(02).
01 RESULT    PIC 9(03).
*
* Procedure Division.                                * `Procedure Division` is where the main logic of the program is written.
*
PROCEDURE DIVISION.
ADD NUM-A TO NUM-B GIVING RESULT.                    * `ADD` is a COBOL arithmetic statement that adds the values of `NUM-A` and `NUM-B` and stores the result in `RESULT`.
DISPLAY 'The result of addition is: ' RESULT.         * `DISPLAY` is used to print the result on the screen.
STOP.                                                * `STOP` terminates the program.
END PROGRAM SAMPLE.                                  * `END PROGRAM` signifies the end of the program and `SAMPLE` is the name of the program.