identification division.
 program-id. myProgram.
 data division.
 working-storage section.
 01 myNumber pic 9(6) value 12345.
 procedure division.
 multiply myNumber by 2 giving myNumber.
 display myNumber
 stop run.