IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-NUMBER PIC 9(3)V99.
01 SECOND-NUMBER PIC 9(3)V99.
01 RESULT PIC 9(3)V99.

PROCEDURE DIVISION.
DISPLAY 'PLEASE ENTER THE FIRST NUMBER:'.
ACCEPT FIRST-NUMBER.

DISPLAY 'PLEASE ENTER THE SECOND NUMBER:'.
ACCEPT SECOND-NUMBER.

COMPUTE RESULT = FIRST-NUMBER + SECOND-NUMBER.

IF RESULT > 100 THEN
DISPLAY 'THE SUM IS GREATER THAN 100'.
ELSE 
DISPLAY 'THE SUM IS LESS THAN OR EQUAL TO 100'.
END-IF.

STOP RUN.