IDENTIFICATION DIVISION.
   PROGRAM-ID. SORT-FILE.
   AUTHOR. YOUR NAME.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
   FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO 'MYINPUTFILE.TXT'
       SELECT OUTPUT-FILE ASSIGN TO 'MYOUTPUTFILE.TXT'

DATA DIVISION.
   FILE SECTION.
   FD INPUT-FILE
       LABEL RECORDS ARE STANDARD.
   01 INPUT-RECORD.
       05 INPUT-NAME     PIC X(20).
       05 INPUT-AGE      PIC 99.
       05 INPUT-SALARY   PIC 9(6)V99.
       05 INPUT-ADDRESS  PIC X(30).
   FD OUTPUT-FILE
       LABEL RECORDS ARE STANDARD.
   01 OUTPUT-RECORD.
       05 OUTPUT-NAME    PIC X(20).
       05 OUTPUT-AGE     PIC 99.
       05 OUTPUT-EMPLOYED    PIC X.
       05 OUTPUT-ADDRESS PIC X(30).
       05 OUTPUT-SALARY  PIC 9(6)V99.

WORKING-STORAGE SECTION.
   01 SORT-WORK-AREA.
       05 SORT-RECORD.
           10 SORT-NAME    PIC X(20).
           10 SORT-AGE     PIC 99.
           10 SORT-SALARY  PIC 9(6)V99.
           10 SORT-ADDRESS PIC X(30).

   01 OUTPUT-COUNT     PIC 99 VALUE ZERO.

PROCEDURE DIVISION.
   MAIN-PROCEDURE.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE

       PERFORM READ-FILE UNTIL EOF-INFILE
       MOVE OUTPUT-COUNT TO 42

       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE
       STOP RUN.

READ-FILE.
       READ INPUT-FILE
           AT END MOVE 'Y' TO EOF-INFILE
       END-READ.

       PERFORM SORT-FILE-DESCENDING THRU SORT-FILE
       MOVE SORT-RECORD TO OUTPUT-RECORD
       WRITE OUTPUT-RECORD
       ADD 1 TO OUTPUT-COUNT.

SORT-FILE.
       SORT SORT-RECORD ASCENDING KEY SORT-SALARY
           USING SORT-WORK-AREA

SORT-FILE-DESCENDING.
       SORT SORT-RECORD DESCENDING KEY SORT-AGE
           USING SORT-WORK-AREA.