IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TEST PIC X(10) VALUE "HELLO WORLD".
       PROCEDURE DIVISION.
           DISPLAY WS-TEST.
           STOP RUN.