IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-PRIME.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LIMIT PIC 9(4).
01 PRIME-COUNT PIC 9(4).
01 I PIC 9(4).
01 J PIC 9(4).
01 PRIME-TABLE OCCURS 0 TO 9999 TIMES
    DEPENDING ON LIMIT INDEXED BY I.
    02 PRIME-NUMBER PIC 9(4).
    02 PRIME-FLAG PIC X(1).

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "ENTER THE LIMIT: ".
    ACCEPT LIMIT.
    MOVE 0 TO PRIME-COUNT.
    PERFORM INIT-TABLE UNTIL I > LIMIT.
    PERFORM FIND-PRIMES UNTIL I > LIMIT.
    DISPLAY "THERE ARE " PRIME-COUNT " PRIMES BETWEEN 1 AND " LIMIT " :".
    PERFORM PRINT-PRIMES UNTIL I > LIMIT.
    STOP RUN.

INIT-TABLE.
    MOVE 1 TO I.
    PERFORM VARYING I FROM 2 BY 1 UNTIL I > LIMIT
        IF I < 3
            MOVE " " TO PRIME-FLAG(I)
        ELSE
            MOVE "Y" TO PRIME-FLAG(I).

FIND-PRIMES.
    PERFORM VARYING J FROM I BY I UNTIL J > LIMIT
        IF PRIME-FLAG(J) = "Y"
            MOVE " " TO PRIME-FLAG(J).

PRINT-PRIMES.
    PERFORM VARYING I FROM 2 BY 1 UNTIL I > LIMIT
        IF PRIME-FLAG(I) = "Y"
            DISPLAY I
            ADD 1 TO PRIME-COUNT.