IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATION-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 VALUE-1 PIC 9(11)V99.
  01 VALUE-2 PIC S9(9)V99.
  01 RESULT PIC 9(11)V99.

PROCEDURE DIVISION.
  MULTIPLY VALUE-1 BY VALUE-2 GIVING RESULT.
  DISPLAY "The result is: " RESULT.

STOP RUN.