PROGRAM-ID. SAMPLE.      /* This is the program identification */
      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO 'INPUT.TXT'
                       STATUS IS IN-STATUS.
           SELECT OUT-FILE ASSIGN TO 'OUTPUT.TXT'
                       STATUS IS OUT-STATUS.
      DATA DIVISION.
           FILE SECTION.
           FD  IN-FILE
           01  IN-REC.
               05  NAME-INPUT       PIC X(15).
               05  AGE-INPUT        PIC 99.
               05  SALARY-INPUT     PIC 9(5)V99.
           FD  OUT-FILE
           01  OUT-REC.
               05  NAME-OUTPUT      PIC X(15).
               05  AGE-OUTPUT       PIC 99.
               05  SALARY-OUTPUT    PIC $$,$$9.99.
      WORKING-STORAGE SECTION.
           01  TOTAL-SALARY         PIC 9(7)V99.
           01  AMOUNT-OWED          PIC 9(7)V99.
      PROCEDURE DIVISION.
           OPEN INPUT IN-FILE
                OUTPUT OUT-FILE.
           PERFORM UNTIL IN-STATUS = '10'.
                ADD SALARY-INPUT TO TOTAL-SALARY
                IF AGE-INPUT > 40
                     MULTIPLY SALARY-INPUT BY 1.15
                     MOVE SALARY-INPUT TO SALARY-OUTPUT
                ELSE
                     MOVE SALARY-INPUT TO SALARY-OUTPUT
                     DIVIDE SALARY-INPUT BY 2
                END-IF
                MOVE NAME-INPUT TO NAME-OUTPUT
                MOVE AGE-INPUT TO AGE-OUTPUT
                WRITE OUT-REC.
           END-PERFORM.
           COMPUTE AMOUNT-OWED = TOTAL-SALARY * 0.2.
           WRITE 'Total Salary paid: ' TOTAL-SALARY.
           WRITE 'Amount owed to the government: ' AMOUNT-OWED.
           CLOSE IN-FILE
                 OUT-FILE.
           STOP RUN.