IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-COMPENSATION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMEMP PIC 9(3) VALUE 0.
01 ACTEMP PIC 9(3) VALUE 0.
01 EMPLOYEE.
   02 EMPLOYEE-NAME PIC X(20).
   02 EMPLOYEE-ID PIC 9(3).
   02 EMPLOYEE-SALARY PIC 9(6)V99.
   02 EMPLOYEE-ACTUAL-SAL PIC 9(6)V99 VALUE 0.
   02 EMPLOYEE-COMPENSATION PIC 9(6)V99 VALUE 0.
01 TOTAL-COMPENSATION PIC 9(8)V99.
01 AVG-COMPENSATION PIC 9(8)V99.
PROCEDURE DIVISION.
START-OF-PROGRAM.
    ACCEPT NUMEMP.
    PERFORM CALCULATE-COMPENSATION TIMES.
END-OF-PROGRAM.
CALCULATE-COMPENSATION.
    ADD 1 TO ACTEMP.
    DISPLAY 'Enter employee name:'
    ACCEPT EMPLOYEE-NAME.
    DISPLAY 'Enter employee ID:'
    ACCEPT EMPLOYEE-ID.
    DISPLAY 'Enter employee salary:'
    ACCEPT EMPLOYEE-SALARY.
    COMPUTE EMPLOYEE-ACTUAL-SAL = EMPLOYEE-SALARY * 1.2.
    DISPLAY 'Employee actual salary is: ' EMPLOYEE-ACTUAL-SAL.
    COMPUTE EMPLOYEE-COMPENSATION = (EMPLOYEE-ACTUAL-SAL - EMPLOYEE-SALARY) * 1.1.
    DISPLAY 'Employee compensation is: ' EMPLOYEE-COMPENSATION.
    ADD EMPLOYEE-COMPENSATION TO TOTAL-COMPENSATION.
    IF ACTEMP > 1 THEN
        COMPUTE AVG-COMPENSATION = TOTAL-COMPENSATION / ACTEMP.
        DISPLAY 'Average compensation of employees is: ' AVG-COMPENSATION.
    END-IF.
    DISPLAY 'Total compensation of all employees is: ' TOTAL-COMPENSATION.
END PROGRAM CALCULATE-COMPENSATION.