IDENTIFICATION DIVISION.
PROGRAM-ID. ORDERS.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT ORDERS-FILE ASSIGN TO 'ORDERS.DAT'.

DATA DIVISION.
FILE SECTION.
FD ORDERS-FILE
RECORDING MODE IS F
LABEL RECORDS ARE STANDARD.

01 ORDERS-RECORD.
05 ORDERS-ID PIC 9(4).
05 ORDERS-NAME PIC X(20).
05 ORDERS-QUANTITY PIC 9(3).
05 ORDERS-PRICE PIC 9(5)V99.

WORKING-STORAGE SECTION.
01 TOTAL-PRICE PIC 9(5)V99.

PROCEDURE DIVISION.
100-MAIN.
    OPEN INPUT ORDERS-FILE
    PERFORM 200-PROCESS UNTIL ORDERS-ID = 0
    CLOSE ORDERS-FILE
    DISPLAY "TOTAL PRICE: " TOTAL-PRICE
    STOP RUN.

200-PROCESS.
    READ ORDERS-FILE INTO ORDERS-RECORD
    IF ORDERS-ID = 0
        MOVE TOTAL-PRICE TO ORDERS-PRICE
    ELSE
        COMPUTE TOTAL-PRICE = TOTAL-PRICE + (ORDERS-QUANTITY * ORDERS-PRICE)
    END-IF.