IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO "INPUT.TXT"
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS IN-FILE-STATUS.
           SELECT OUT-FILE ASSIGN TO "OUTPUT.TXT"
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS OUT-FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 80 CHARACTERS.
       01 IN-RECORD.
           05 IN-NAME                 PIC X(20).
           05 IN-AGE                  PIC 9(3).
           05 IN-ADDRESS              PIC X(30).
           05 IN-SALARY               PIC 9(5)V99.
       FD OUT-FILE
           RECORDING MODE IS F
           RECORD CONTAINS 90 CHARACTERS.
       01 OUT-RECORD.
           05 OUT-NAME                PIC X(20).
           05 OUT-ADDRESS             PIC X(30).
           05 OUT-AGE                 PIC 9(3).
           05 OUT-SALARY              PIC ZZ,ZZ9.99.
       WORKING-STORAGE SECTION.
       01 WS-EOF                    PIC X(03) VALUE "NO".
       01 IN-FILE-STATUS            PIC XX.
       01 OUT-FILE-STATUS           PIC XX.
       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT IN-FILE
               OUTPUT OUT-FILE.
           PERFORM UNTIL WS-EOF = "YES"
               READ IN-FILE
                   AT END
                       SET WS-EOF TO "YES"
                   NOT AT END
                       PERFORM 200-PROCESS
               END-READ
           END-PERFORM.
           CLOSE IN-FILE
               OUT-FILE.
           STOP RUN.
       200-PROCESS.
           MOVE IN-NAME TO OUT-NAME.
           MOVE IN-ADDRESS TO OUT-ADDRESS.
           MOVE IN-AGE TO OUT-AGE.
           COMPUTE OUT-SALARY = IN-SALARY * 1.10.
           WRITE OUT-RECORD.