IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SCORE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT STUDENT-FILE ASSIGN TO 'STUDENTS.DAT'
ACCESS MODE IS SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD STUDENT-FILE.
01 STUDENT-RECORD.
    05  STUDENT-ID      PIC X(10).
    05  STUDENT-NAME    PIC X(20).
    05  EXAM-SCORES.
        10  MATH-SCORE      PIC 9(3).
        10  ENGLISH-SCORE   PIC 9(3).
        10  SCIENCE-SCORE   PIC 9(3).

WORKING-STORAGE SECTION.
01 TOTAL-SCORE      PIC 9(3).
01 AVG-SCORE        PIC 9(3).
01 STUDENT-COUNT    PIC 9(3).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN INPUT STUDENT-FILE.
    READ STUDENT-FILE INTO STUDENT-RECORD AT END
        DISPLAY "NO RECORDS FOUND"
        GO TO END-MAIN.
    PERFORM CALCULATE-AVG UNTIL END-OF-FILE
    CLOSE STUDENT-FILE.
    DISPLAY "TOTAL SCORE: " TOTAL-SCORE
    DISPLAY "AVERAGE SCORE: " AVG-SCORE
    DISPLAY "NUMBER OF STUDENTS: " STUDENT-COUNT.
END-MAIN.
CALCULATE-AVG.
    COMPUTE TOTAL-SCORE = MATH-SCORE + ENGLISH-SCORE + SCIENCE-SCORE
    COMPUTE AVG-SCORE = TOTAL-SCORE / 3
    ADD 1 TO STUDENT-COUNT.
    READ STUDENT-FILE INTO STUDENT-RECORD AT END
        MOVE "YES" TO END-OF-FILE.