01 STUDENT-DATA.
           03 STUDENT-ID       PIC 9(4)     VALUE ZERO.       *student ID number   
           03 STUDENT-NAME.                                     *student name
               05 LAST-NAME    PIC X(20) VALUE SPACES.          *last name
               05 FIRST-NAME   PIC X(15) VALUE SPACES.          *first name
               05 MIDDLE-INIT  PIC X(1)  VALUE SPACES.          *middle initial
           03 STUDENT-AGE      PIC 99       VALUE ZERO.       *student age
           03 STUDENT-ADDRESS.
               05 NUMBER       PIC 9999     VALUE ZERO.      *house number
               05 STREET       PIC X(25)   VALUE SPACES.     *street name
               05 CITY         PIC X(20)   VALUE SPACES.     *city name
               05 STATE        PIC X(2)    VALUE SPACES.     *state abbreviation
               05 ZIP-CODE     PIC 99999   VALUE ZERO.       *zip code
       01 COURSE-DATA.
           03 COURSE-NAME      PIC X(25)  VALUE SPACES.      *course name 
           03 COURSE-CODE      PIC X(10)  VALUE SPACES.      *course code
           03 COURSE-TEACHER.                                 *course teacher's information
               05 LAST-NAME    PIC X(20) VALUE SPACES.       *teacher's last name
               05 FIRST-NAME   PIC X(15) VALUE SPACES.       *teacher's first name
           03 COURSE-ENROLLMENT PIC 99999999 VALUE ZERO.     *number of students enrolled in the course
       
       PROCEDURE DIVISION.
           00 START-PROGRAM.
               PERFORM INPUT-STUDENT.
               PERFORM INPUT-COURSE.
               PERFORM DISPLAY-STUDENT.
               PERFORM DISPLAY-COURSE.
               EXIT PROGRAM.
           00 INPUT-STUDENT.
               DISPLAY "Enter student ID number: "
               ACCEPT STUDENT-ID.
               DISPLAY "Enter last name: "
               ACCEPT LAST-NAME.
               DISPLAY "Enter first name: "
               ACCEPT FIRST-NAME.
               DISPLAY "Enter age: "
               ACCEPT STUDENT-AGE.
               DISPLAY "Enter house number: "
               ACCEPT NUMBER.
               DISPLAY "Enter street name: "
               ACCEPT STREET.
               DISPLAY "Enter city: "
               ACCEPT CITY.
               DISPLAY "Enter state: "
               ACCEPT STATE.
               DISPLAY "Enter zip code: "
               ACCEPT ZIP-CODE.
           00 INPUT-COURSE.
               DISPLAY "Enter course name: "
               ACCEPT COURSE-NAME.
               DISPLAY "Enter course code: "
               ACCEPT COURSE-CODE.
               DISPLAY "Enter teacher's last name: "
               ACCEPT LAST-NAME.
               DISPLAY "Enter teacher's first name: "
               ACCEPT FIRST-NAME.
               DISPLAY "Enter number of students enrolled: "
               ACCEPT COURSE-ENROLLMENT.
           00 DISPLAY-STUDENT.
               DISPLAY "Student ID Number: ", STUDENT-ID.
               DISPLAY "Student Name: ", LAST-NAME, ", ", FIRST-NAME.
               DISPLAY "Age: ", STUDENT-AGE.
               DISPLAY "Address: ", NUMBER, " ", STREET, " ", CITY, " ", STATE, " ", ZIP-CODE.
           00 DISPLAY-COURSE.
               DISPLAY "Course Name: ", COURSE-NAME.
               DISPLAY "Course Code: ", COURSE-CODE.
               DISPLAY "Teacher: ", LAST-NAME, ", ", FIRST-NAME.
               DISPLAY "Number of Students Enrolled: ", COURSE-ENROLLMENT.
       END PROGRAM.