IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLYEX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 num1 PIC 9(4) VALUE 1234.
       01 num2 PIC 9(4) VALUE 5678.
       01 result PIC 9(9).
       PROCEDURE DIVISION.
       MULTIPLY num1 BY num2 GIVING result.
       DISPLAY "The result of multiplying " num1 "and " num2 "is: " result.
       STOP RUN.