IDENTIFICATION DIVISION.
PROGRAM-ID. ADDRESS-BLOCK.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    	SELECT IN-FILE-A  ASSIGN TO 'INPUT.TXT'.
    	SELECT OUT-FILE  ASSIGN TO 'OUTPUT.TXT'.
DATA DIVISION.
FILE SECTION.
FD IN-FILE-A.
01 IN-RECORD PIC X(80).

FD OUT-FILE.
01 OUT-RECORD PIC X(50).
WORKING-STORAGE SECTION.
01 INPUT-LENGTH    PIC S9(4) USAGE BINARY.
01 INPUT-COUNT     PIC S9(4) USAGE BINARY VALUE 0.
01 OUTPUT-COUNT    PIC S9(4) USAGE BINARY VALUE 0.
01 OUTPUT-LENGTH   PIC S9(4) USAGE BINARY.
01 BLANK-SPACE     PIC X(1) VALUE SPACE.
01 BUFFER.
04 LINE-BUFFER     PIC X(192) VALUE SPACES.
03 RECORD-LENGTH   PIC S9(4) USAGE BINARY VALUE 192.
01 ADDRESS-RECORD.
03 ADDRESS-LINE-1 PIC X(30) VALUE SPACES.
03 ADDRESS-LINE-2 PIC X(30) VALUE SPACES.
03 ADDRESS-LINE-3 PIC X(30) VALUE SPACES.
03 ADDRESS-CITY   PIC X(30) VALUE SPACES.
03 ADDRESS-STATE  PIC X(2)  VALUE SPACES.
03 ADDRESS-ZIP    PIC X(5)  VALUE SPACES.
PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    	OPEN INPUT IN-FILE-A,OUTPUT OUT-FILE.
LOOP-PARAGRAPH.
    	READ IN-FILE-A
    		AT END MOVE 'END-OF-FILE' TO ADDRESS-LINE-1
    	END-READ.
    	IF ADDRESS-LINE-1 = 'END-OF-FILE'
    		MOVE 'END-OF-FILE' TO ADDRESS-CITY
    		MOVE 'END-OF-FILE' TO ADDRESS-STATE
    		MOVE 'END-OF-FILE' TO ADDRESS-ZIP
    		GO TO END-PROGRAM
    	END-IF.
    	PERFORM PROCESS-ADDRESS
    	ADD 1 TO INPUT-COUNT
    	IF INPUT-COUNT = 50
    	COMPUTE OUTPUT-COUNT = OUTPUT-COUNT + 1
    		MOVE OUTPUT-COUNT TO OUT-RECORD
    		WRITE OUT-RECORD
    		MOVE 0 TO INPUT-COUNT
    	END-IF.
    	MOVE BLANK-SPACE TO IN-RECORD (INPUT-LENGTH:1)
    	MOVE ADDRESS-LINE-1 TO IN-RECORD (INPUT-LENGTH + 1:30)
    	MOVE ADDRESS-LINE-2 TO IN-RECORD (INPUT-LENGTH + 31:30)
    	MOVE ADDRESS-LINE-3 TO IN-RECORD (INPUT-LENGTH + 61:30)
    	MOVE ADDRESS-CITY   TO IN-RECORD (INPUT-LENGTH + 91:30)
    	MOVE ADDRESS-STATE  TO IN-RECORD (INPUT-LENGTH + 121:2)
    	MOVE ADDRESS-ZIP    TO IN-RECORD (INPUT-LENGTH + 123:5)
    	WRITE IN-RECORD
    	GOTO LOOP-PARAGRAPH.
PROCESS-ADDRESS.
    	MOVE 80 TO INPUT-LENGTH
    	MOVE IN-RECORD TO BUFFER
    	MOVE 1 TO OUTPUT-LENGTH
    	MOVE BUFFER TO OUT-RECORD
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-LINE-1 TO LINE-BUFFER (OUTPUT-LENGTH:30)
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-LINE-2 TO LINE-BUFFER (OUTPUT-LENGTH:30)
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-LINE-3 TO LINE-BUFFER (OUTPUT-LENGTH:30)
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-CITY TO LINE-BUFFER (OUTPUT-LENGTH:30)
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-STATE TO LINE-BUFFER (OUTPUT-LENGTH:2)
    	ADD 1 TO OUTPUT-LENGTH
    	MOVE ADDRESS-ZIP TO LINE-BUFFER (OUTPUT-LENGTH:5)
    	ADD 1 TO OUTPUT-LENGTH.
END-PROGRAM.
    	CLOSE IN-FILE-A,OUT-FILE.
    	STOP RUN.