IDENTIFICATION DIVISION.	\\ start of code snippet
PROGRAM-ID. PRIME-GAME.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT PRIME-INPUT ASSIGN TO 'PRIME.INP'.
SELECT PRIME-OUTPUT ASSIGN TO 'PRIME.OUT'.

DATA DIVISION.
FILE SECTION.
FD PRIME-INPUT
	...
01 PRIME-REC.
	...
	.
	.
	.

WORKING-STORAGE SECTION.
01 TEMP PIC 9(10).

LINKAGE SECTION.
01 INPUT-X PIC 9(10).

PROCEDURE DIVISION.
MAIN-PARA.
	\\ main executable code
	CALL 'CHECK-PRIME' USING INPUT-X.
	CALL 'WRITE-RESULT'.
STOP RUN.

CHECK-PRIME.
	\\ subroutine to check for prime numbers
	\\ using Sieve of Eratosthenes algorithm
	\\ INPUT-X is passed by reference to this subroutine
	MOVE 2 TO TEMP.
	PERFORM UNTIL TEMP > INPUT-X.
		IF PRIME-REC(TEMP) = 0 THEN
			ADD TEMP TO TEMP.
		ELSE
			MULTIPLY INPUT-X BY TEMP.
			DIVIDE INPUT-X BY TEMP.
			COMPARE 0 WITH TEMP
			IF GREATER
				ADD 1 TO TEMP.
			END-IF.
		END-IF.
	END-PERFORM.
	
WRITE-RESULT.
	\\ subroutine to write the result to PRIME.OUT file
	OUTPUT-REC = INPUT-X.
	WRITE PRIME-OUTPUT FROM OUTPUT-REC.