ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMP-FILE
              ASSIGN TO 'EMPLOYEE.DAT'.

       DATA DIVISION.
       FILE SECTION.
       FD EMP-FILE.
       01 EMP-RECORD.
          05 EMP-NAME                PIC X(20).
          05 EMP-DEPARTMENT          PIC X(10).
          05 EMP-AGE                 PIC 9(3).
          05 EMP-SALARY              PIC 9(7)V99.
          05 EMP-HIRE-DATE.
             10 EMP-HIRE-MONTH       PIC 99.
             10 EMP-HIRE-DAY         PIC 99.
             10 EMP-HIRE-YEAR        PIC 9(4).
          
       WORKING-STORAGE SECTION.
       01 READ-FLAG                   PIC X.
       01 SORTED-FLAG                 PIC X.
       01 EMPLOYEE-COUNT              PIC 9(3) VALUE ZERO.
       01 SORT-COUNTER                PIC 9(3) VALUE ZERO. 
       01 TEMP-RECORD-SIZE            PIC 9(3).
       01 TEMP-EMP-RECORD.
          05 TEMP-EMP-NAME            PIC X(20).
          05 TEMP-EMP-DEPARTMENT      PIC X(10).
          05 TEMP-EMP-AGE             PIC 9(3).
          05 TEMP-EMP-SALARY          PIC 9(7)V99.
          05 TEMP-EMP-HIRE-DATE.
             10 TEMP-EMP-HIRE-MONTH   PIC 99.
             10 TEMP-EMP-HIRE-DAY     PIC 99.
             10 TEMP-EMP-HIRE-YEAR    PIC 9(4).

       PROCEDURE DIVISION.
       SORT-EMPLOYEE.
           OPEN INPUT EMP-FILE
           PERFORM READ-EMPLOYEE-DATA
           PERFORM SORT-RECORDS
           PERFORM WRITE-SORTED-DATA
           CLOSE EMP-FILE
           STOP RUN. 
       READ-EMPLOYEE-DATA.
           PERFORM UNTIL READ-FLAG = 'N'
               READ EMP-FILE NEXT RECORD
                   AT END
                       MOVE 'N' TO READ-FLAG
                   NOT AT END
                       ADD 1 TO EMPLOYEE-COUNT
                       MOVE EMP-RECORD TO TEMP-EMP-RECORD
                       PERFORM SORT-RECORD
               END-READ
           END-PERFORM. 
       SORT-RECORDS.
           PERFORM VARYING SORT-COUNTER FROM 1 BY 1 UNTIL SORT-COUNTER >= EMPLOYEE-COUNT
               PERFORM VARYING SORT-COUNTER2 FROM 1 BY 1 UNTIL SORT-COUNTER2 >= (EMPLOYEE-COUNT - SORT-COUNTER)
                  IF TEMP-EMP-SALARY (SORT-COUNTER2 + 1) > TEMP-EMP-SALARY (SORT-COUNTER2)
                      MOVE TEMP-EMP-RECORD (SORT-COUNTER2) TO TEMP-EMP-RECORD
                      MOVE TEMP-EMP-RECORD (SORT-COUNTER2 + 1) TO TEMP-EMP-RECORD (SORT-COUNTER)
                  END-IF
               END-PERFORM
           END-PERFORM.
       SORT-RECORD.
           MOVE TEMP-EMP-RECORD TO TEMP-EMP-RECORD.
           IF SORTED-FLAG = "N"
               MOVE "Y" TO SORTED-FLAG
           END-IF. 
       WRITE-SORTED-DATA.
           WRITE EMP-RECORD FROM TEMP-EMP-RECORD.
           PERFORM VARYING SORT-COUNTER FROM 1 BY 1 UNTIL SORT-COUNTER >= EMPLOYEE-COUNT
               IF EMP-RECORD (SORT-COUNTER).EMP-NAME = TEMP-EMP-RECORD
                   WRITE EMP-RECORD(SORT-COUNTER).
               END-IF
           END-PERFORM.