IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-PRIME-NUMBERS.

DATA DIVISION.

01 LIMIT NUMBER PIC 9(4).

01 NUMBER-COUNT PIC 9(4) VALUE 0.

01 PRIME-NUMBERS OCCURS 10 TIMES.
   02 PRIME-NUMBER PIC 9(4).

WORKING-STORAGE SECTION.

01 DIVISOR NUMBER PIC 9(4).

PROCEDURE DIVISION.

MAIN-PERFORM SECTION.

    DISPLAY "Enter the limit:".
    ACCEPT LIMIT.

    PERFORM VARYING NUMBER-COUNT FROM 2 BY 1 UNTIL NUMBER-COUNT > LIMIT
        PERFORM CALCULATE-PRIME
        DISPLAY PRIME-NUMBER
    END-PERFORM.

* This is a comment.

CALCULATE-PRIME SECTION.

    PERFORM VARYING DIVISOR FROM 2 BY 1 UNTIL DIVISOR > NUMBER-COUNT
        IF NUMBER-COUNT / DIVISOR = 0
            GO TO END-CALCULATE
        END-IF
    END-PERFORM.

    MOVE NUMBER-COUNT TO PRIME-NUMBER(INDEX).
    ADD 1 TO INDEX.

END-CALCULATE SECTION.

    EXIT.