IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLECODE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  COUNTER         PIC 9(5) VALUE ZERO.
       01  PRINT-VAR       PIC X(20) VALUE SPACES.

       PROCEDURE DIVISION.
           PERFORM PRINT-HEADER.
           PERFORM PRINT-LINE THRU PRINT-LINE-EXIT
               VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER = 10.
           STOP RUN.

       PRINT-HEADER.
           MOVE 'HEADER' TO PRINT-VAR.
           DISPLAY PRINT-VAR.
           MOVE SPACES TO PRINT-VAR.

       PRINT-LINE.
           DISPLAY 'LINE' COUNTER 'PRINTED'.
       
       PRINT-LINE-EXIT.
           DISPLAY 'LINE PRINTING COMPLETE'.