IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-CODE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERIC-VARIABLE PIC 9(5)V9(2) VALUE 1234.56.
PROCEDURE DIVISION.
DISPLAY NUMERIC-VARIABLE.