IDENTIFICATION DIVISION.
       PROGRAM-ID. PYTHAGORAS.

       * THIS PROGRAM CALCULATES THE HYPOTENUSE OF A RIGHT ANGLE TRIANGLE USING THE PYTHAGOREAN THEOREM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SIDE-A PIC 9(3).
       01 SIDE-B PIC 9(3).
       01 HYPOTENUSE PIC 9(3).

       PROCEDURE DIVISION.
       START-CALCULATION.

           * GET INPUT FROM USER FOR SIDE A AND B
           DISPLAY "ENTER SIDE A:".
           ACCEPT SIDE-A.
           DISPLAY "ENTER SIDE B:".
           ACCEPT SIDE-B.

           * CALCULATE HYPOTENUSE USING PYTHAGOREAN THEOREM
           COMPUTE HYPOTENUSE = SQRT((SIDE-A ** 2) + (SIDE-B ** 2)).

           * DISPLAY RESULTS
           DISPLAY "THE HYPOTENUSE IS:" HYPOTENUSE.

           * CHECK IF THE TRIANGLE IS A RIGHT ANGLE TRIANGLE
           IF HYPOTENUSE ** 2 = (SIDE-A ** 2) + (SIDE-B ** 2)
           DISPLAY "THIS IS A RIGHT ANGLE TRIANGLE".
           ELSE
           DISPLAY "THIS IS NOT A RIGHT ANGLE TRIANGLE".
       STOP RUN.
       
       END PROGRAM PYTHAGORAS.