IDENTIFICATION DIVISION.
       PROGRAM-ID. TestProgram.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 var1 PIC 9(5).
       01 var2 PIC S9(5).
       01 result PIC 9(5).
       PROCEDURE DIVISION.
       MAIN-EXEC.
           MOVE 100 TO var1.
           MOVE -500 TO var2.
           ADD var1 TO var2 GIVING result.
           DISPLAY "Result is " result.
           STOP RUN.