IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX-CALCULATION.

* This program performs various complex calculations using COBOL.
* It also handles user inputs and outputs the results.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-NUMERICAL-VARIABLE PIC 9(4)V9(2).
01 INPUT-CHARACTER-VARIABLE PIC A(10).
01 CALCULATION-RESULT PIC 9(5)V9(3).
01 OUTPUT-MESSAGE PIC A(20).

PROCEDURE DIVISION.
MAIN-ROUTINE.
    DISPLAY "Please input a number: ".
    ACCEPT INPUT-NUMERICAL-VARIABLE.
    DISPLAY "Please input a word: ".
    ACCEPT INPUT-CHARACTER-VARIABLE.
    PERFORM CALCULATION-1.
    PERFORM CALCULATION-2.
    PERFORM CALCULATION-3.
    DISPLAY "The result of complex calculations is: ".
    DISPLAY CALCULATION-RESULT.
    DISPLAY "Thank you for using this program!".

CALCULATION-1.
    MULTIPLY INPUT-NUMERICAL-VARIABLE BY 5.
    DIVIDE 100 INTO INPUT-NUMERICAL-VARIABLE GIVING CALCULATION-RESULT.

CALCULATION-2.
    INSPECT INPUT-CHARACTER-VARIABLE REPLACING "A" BY "B".
    STRING INPUT-CHARACTER-VARIABLE DELIMITED BY SPACE
    " Hello!" DELIMITED BY SIZE
    INTO OUTPUT-MESSAGE.
    DISPLAY OUTPUT-MESSAGE.

CALCULATION-3.
    IF INPUT-NUMERICAL-VARIABLE < 15
        ADD 100 TO INPUT-NUMERICAL-VARIABLE
    ELSE
        ADD 50 TO INPUT-NUMERICAL-VARIABLE.