IDENTIFICATION DIVISION.
PROGRAM-ID. TALLY.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 INPUT-NUMBER PIC 9(3).
77 DIGITS PIC 9(3).
77 TALLY-TOTAL PIC 9(6) VALUE 0.
77 I PIC 9(3) VALUE 1.

PROCEDURE DIVISION.
ACCEPT INPUT-NUMBER.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > INPUT-NUMBER
    COMPUTE DIGITS = I ** 2
    IF DIGITS = 0 THEN
        CONTINUE
    ELSE
        ADD DIGITS TO TALLY-TOTAL
        DISPLAY I "squared is:" DIGITS
    END-IF
END-PERFORM.
DISPLAY "The total of all squared numbers between 1 and" INPUT-NUMBER "is:" TALLY-TOTAL.

STOP RUN.