IDENTIFICATION DIVISION.                                           
       PROGRAM-ID. CALC-SUM.                                               
       DATA DIVISION.                                                      
       WORKING-STORAGE SECTION.                                            
       01 NUMBER-1                                         PIC 9(5) VALUE ZERO.
       01 NUMBER-2                                         PIC 9(5) VALUE ZERO.
       01 RESULT                                           PIC 9(5) VALUE ZERO.
       PROCEDURE DIVISION.                                                  
       DISPLAY "Enter first number: " WITH NO ADVANCING.                    
       ACCEPT NUMBER-1.                                                     
       DISPLAY "Enter second number: " WITH NO ADVANCING.                   
       ACCEPT NUMBER-2.                                                     
       COMPUTE RESULT = NUMBER-1 + NUMBER-2.                                
       DISPLAY "The sum of " NUMBER-1 " and " NUMBER-2 " is " RESULT.
       STOP RUN.