* This code snippet is a COBOL program that calculates the average of three numbers       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AVG-CALC.
       AUTHOR. [Your Name].
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-1 PIC 9(3).
       01 NUM-2 PIC 9(3).
       01 NUM-3 PIC 9(3).
       01 AVG-RESULT PIC 9(3).       
      *
       PROCEDURE DIVISION.
       CALCULATE-AVG.
           DISPLAY "Enter first number: ".
           ACCEPT NUM-1.
           DISPLAY "Enter second number: ".
           ACCEPT NUM-2.
           DISPLAY "Enter third number: ".
           ACCEPT NUM-3.
           COMPUTE AVG-RESULT = (NUM-1 + NUM-2 + NUM-3) / 3.
           DISPLAY "The average of " NUM-1 " , " NUM-2 " , and " NUM-3 " is " AVG-RESULT.
       END PROGRAM AVG-CALC.