IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTING-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMS PIC 9(3) OCCURS 100 TIMES.
       01 TEMP PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PARA.
           INITIALIZE NUMS.
           PERFORM VARYING I FROM 1 BY 1
             UNTIL I > 100
               COMPUTE NUMS(I) = FUNCTION RANDOM(100).
           END-PERFORM.
           PERFORM VARYING I FROM 100 BY -1
             UNTIL I = 0
               PERFORM VARYING J FROM 1 BY 1
                 UNTIL J = I
                   IF NUMS(J) > NUMS(J+1)
                     MOVE NUMS(J+1) TO TEMP.
                     MOVE NUMS(J) TO NUMS(J+1).
                     MOVE TEMP TO NUMS(J).
                   END-IF.
               END-PERFORM.
           PERFORM VARYING K FROM 1 BY 1
             UNTIL K > 100
               DISPLAY NUMS(K).
               END-PERFORM.
       STOP RUN.