IDENTIFICATION DIVISION.
      PROGRAM-ID. PROGRAM1.
     *
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 COUNT PIC 99.
      01 NAME1 PIC X.
      01 NAME2 PIC X.
      01 TOTAL PIC 99.
     *
      PROCEDURE DIVISION.
      DISPLAY "ENTER NAME 1: ".
      ACCEPT NAME1.
      DISPLAY "ENTER NAME 2: ".
      ACCEPT NAME2.
      DISPLAY "ENTER COUNT: ".
      ACCEPT COUNT.
      COMPUTE TOTAL = COUNT * 10.
      IF TOTAL > 100
           DISPLAY "TOTAL IS GREATER THAN 100".
      ELSE IF TOTAL = 100
           DISPLAY "TOTAL IS EQUAL TO 100".
      ELSE
           DISPLAY "TOTAL IS LESS THAN 100".
      END-IF.