IDENTIFICATION DIVISION.              // starts the identification division
PROGRAM-ID. HELLO-WORLD.              // sets the program name
DATA DIVISION.                        // starts the data division
WORKING-STORAGE SECTION.              // declares variables for work storage
01 HELLO-MESSAGE PIC X(13) VALUE 'HELLO, WORLD'.      // sets the value of the hello message

PROCEDURE DIVISION.                    // starts the procedure division
DISPLAY HELLO-MESSAGE.                 // displays the hello message
STOP RUN.                              // stops the program execution