IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NUM-OF-STUDENTS PIC 9(3) VALUE 15.
       77 GRADE-TABLE OCCURS 15 TIMES.
          01 GRADE-ENTRY.
             02 STUDENT-NAME PIC X(20).
             02 SCORES OCCURS 5 TIMES PIC 9(3).
       77 TOTAL-SCORE PIC 9(4).
       77 AVERAGE PIC 9(3)V99.
       PROCEDURE DIVISION.
       PERFORM CALCULATE-AVERAGE VARYING I
          FROM 1 BY 1 UNTIL I > NUM-OF-STUDENTS
          COMPUTE TOTAL-SCORE = 0
          PERFORM CALCULATE-TOTAL-SCORE 
             VARYING J FROM 1 BY 1 UNTIL J > 5
             COMPUTE TOTAL-SCORE = TOTAL-SCORE
                + SCORES(J) OF GRADE-ENTRY(I)
          COMPUTE AVERAGE = TOTAL-SCORE / 5
       END-PERFORM.
       DISPLAY "The average score for" NUM-OF-STUDENTS 
          "students is" AVERAGE.
       STOP RUN.
       CALCULATE-AVERAGE.
          COMPUTE AVERAGE = TOTAL-SCORE / I.
       CALCULATE-TOTAL-SCORE.
          DISPLAY "Enter score for subject" J
          ACCEPT SCORES(J) OF GRADE-ENTRY(I).