01  STUDENT-DATA.
           05  STUDENT-NAME             PIC X(20).
           05  STUDENT-ID               PIC 9(9).
           05  STUDENT-ADDRESS          PIC X(30).
       01  STUDENT-MARKS.
           05  SUBJECT-1                PIC 99.
           05  SUBJECT-2                PIC 99.
           05  SUBJECT-3                PIC 99.
           05  SUBJECT-4                PIC 99.
           05  SUBJECT-5                PIC 99.
           05  TOTAL-MARKS              PIC 999.

       01  STUDENT-GRADES.
           05  GRADE-A                  PIC 9(2) VALUE 90.
           05  GRADE-B                  PIC 9(2) VALUE 80.
           05  GRADE-C                  PIC 9(2) VALUE 70.
           05  GRADE-D                  PIC 9(2) VALUE 60.
           05  GRADE-E                  PIC 9(2) VALUE 50.
           05  GRADE-F                  PIC 9(2) VALUE 40.
           05  GRADE-G                  PIC 9(2) VALUE 30.
           05  GRADE-H                  PIC 9(2) VALUE 20.
           05  GRADE-F                  PIC 9(2) VALUE 10.

       01  LOOP-COUNTER                 PIC 99 VALUE 1.

       PERFORM VARYING LOOP-COUNTER FROM 1 BY 1 UNTIL LOOP-COUNTER > 5
           ADD SUBJECT-1 OF STUDENT-MARKS(LOOP-COUNTER) TO TOTAL-MARKS
           IF TOTAL-MARKS >= GRADE-A
               DISPLAY "Student " STUDENT-NAME "has achieved an A grade"
           ELSE IF TOTAL-MARKS >= GRADE-B
               DISPLAY "Student " STUDENT-NAME "has achieved a B grade"
           ELSE IF TOTAL-MARKS >= GRADE-C
               DISPLAY "Student " STUDENT-NAME "has achieved a C grade"
           ELSE IF TOTAL-MARKS >= GRADE-D
               DISPLAY "Student " STUDENT-NAME "has achieved a D grade"
           ELSE IF TOTAL-MARKS >= GRADE-E
               DISPLAY "Student " STUDENT-NAME "has achieved an E grade"
           ELSE IF TOTAL-MARKS >= GRADE-F
               DISPLAY "Student " STUDENT-NAME "has achieved an F grade"
           ELSE IF TOTAL-MARKS >= GRADE-G
               DISPLAY "Student " STUDENT-NAME "has achieved a G grade"
           ELSE IF TOTAL-MARKS >= GRADE-H
               DISPLAY "Student " STUDENT-NAME "has achieved an H grade"
           ELSE
               DISPLAY "Student " STUDENT-NAME "has achieved an F grade"
       END-PERFORM.