IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 INPUT-VARIABLES.
           05 INPUT-1                 PIC X(10).
           05 INPUT-2                 PIC X(10).
       01 OUTPUT-VARIABLES.
           05 RESULT                  PIC 9(5).
       01 TEMP-VARIABLES.
           05 TEMP-1                  PIC 9(5).
           05 TEMP-2                  PIC 9(5).
           05 TEMP-3                  PIC 9(5).

       PROCEDURE DIVISION.
       MAIN-SECTION.

       PERFORM READ-DATA.
       IF INPUT-1 IS NUMERIC AND INPUT-2 IS NUMERIC
           PERFORM PROCESS-DATA
       ELSE
           DISPLAY "Please enter numeric values only."

       PERFORM PRINT-OUTPUT.

       STOP RUN.

       READ-DATA.
           DISPLAY "Enter first input value: "
           ACCEPT INPUT-1.
           DISPLAY "Enter second input value: "
           ACCEPT INPUT-2.
       
       PROCESS-DATA.
           COMPUTE RESULT = TEMP-1 + TEMP-2 + TEMP-3.

       PRINT-OUTPUT.
           DISPLAY "The result is: " RESULT.