IDENTIFICATION DIVISION.                           //Declares the beginning of the program
       PROGRAM-ID. SAMPLEPROGRAM.                         //Specifies the program name as "SAMPLEPROGRAM".
       DATA DIVISION.                                     //Declares the beginning of the data division
       WORKING-STORAGE SECTION.                           //Specifies the section for declaring variables
       01 NUM1 PIC X(5) VALUE '12345'.                     //Declares a variable named NUM1 with a length of 5 and an initial value of '12345'
       01 NUM2 PIC X(5) VALUE '67890'.                     //Declares a variable named NUM2 with a length of 5 and an initial value of '67890'
       01 RESULT PIC X(10).                               //Declares a variable named RESULT with a length of 10 to store the result
       PROCEDURE DIVISION.                                //Declares the beginning of the procedure division
       ADD NUM1, NUM2 GIVING RESULT.                      //Adds the values of NUM1 and NUM2 and stores the result in RESULT
       DISPLAY 'The result of the addition is: ' RESULT.   //Displays the result to the user
       STOP RUN.                                          //Stops the execution of the program