IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-TOTAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3) VALUE 100.
       01 NUM2 PIC 9(3) VALUE 200.
       01 TOTAL PIC 9(4).
       PROCEDURE DIVISION.
       MULTIPLY NUM1 BY NUM2 GIVING TOTAL.
       DISPLAY "THE TOTAL IS " TOTAL.
       END PROGRAM CALCULATE-TOTAL.