identification division.
program-id. myProgram.
environment division.
configuration section.
source-computer. myComputer.
object-computer. myComputer.
input-output section.
file-control.
    select inputFile assign to "myInputFile.txt".
    select outputFile assign to "myOutputFile.txt".
data division.
file section.
fd inputFile.
01 inputFileRecord.
    05 myInputField1 pic x(10).
    05 myInputField2 pic 9(2).
    05 myInputField3 pic s9(3).
fd outputFile.
01 outputFileRecord.
    05 myOutputField1 pic x(10).
    05 myOutputField2 pic 9(2).
    05 myOutputField3 pic s9(3).
working-storage section.
01 inputValue pic x(10).
01 totalValue pic 9(5)v99.
procedure division.
    perform readInput until inputValue = "exit".
    perform calculateTotal.
    perform writeOutput.
    stop run.
readInput.
    read inputFile at end move "exit" to inputValue.
calculateTotal.
    compute totalValue = myInputField2 + myInputField3.
writeOutput.
    move myInputField1 to myOutputField1.
    move myInputField2 to myOutputField2.
    move totalValue to myOutputField3.
    write outputFile.