IDENTIFICATION DIVISION.
* This is a comment line.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
* This is a comment line.
WORKING-STORAGE SECTION.
* Define some variables.
77 EXAMPLE-VARIABLE1 PIC X(10).
77 EXAMPLE-VARIABLE2 PIC 9(5)V99.
77 EXAMPLE-VARIABLE3 PIC S9(3)V99 COMP-3.
77 EXAMPLE-VARIABLE4 PIC S9(4) USAGE DISPLAY-1.
77 EXAMPLE-VARIABLE5 PIC X(20) VALUE "Hello, World!".
PROCEDURE DIVISION.

* Start of program.
BEGIN.
* Perform arithmetic.
   COMPUTE EXAMPLE-VARIABLE2 = EXAMPLE-VARIABLE2 + 10 / 3.
* Output variables.
   DISPLAY "EXAMPLE-VARIABLE1: " EXAMPLE-VARIABLE1.
   DISPLAY "EXAMPLE-VARIABLE2: " EXAMPLE-VARIABLE2.
   DISPLAY "EXAMPLE-VARIABLE3: " EXAMPLE-VARIABLE3.
   DISPLAY "EXAMPLE-VARIABLE4: " EXAMPLE-VARIABLE4.
   DISPLAY "EXAMPLE-VARIABLE5: " EXAMPLE-VARIABLE5.
STOP RUN.