IDENTIFICATION DIVISION.
    PROGRAM-ID. SAMPLE.
    ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
    SOURCE-COMPUTER. IBM-370.
    OBJECT-COMPUTER. IBM-370.
    
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT IN-FILE ASSIGN TO 'INPUT.DAT'.
        SELECT OUT-FILE ASSIGN TO 'OUTPUT.DAT'.
        
    DATA DIVISION.
    FILE SECTION.
    FD IN-FILE.
    01 IN-RECORD.
        05 IN-AGE         PIC 99.
        05 IN-NAME        PIC X(15). 
        05 IN-GENDER      PIC X.
    
    FD OUT-FILE.
    01 OUT-RECORD.
        05 OUT-NAME       PIC X(20).
        05 OUT-SALARY     PIC 9(6)V99.
        05 OUT-STATUS     PIC X(3).
        
    WORKING-STORAGE SECTION.
    01 TOTAL-SALARY     PIC S9(10)V99 VALUE 0.
    01 HIGH-SALARY      PIC 9(6)V99 VALUE 0.
    01 LOW-SALARY       PIC 9(6)V99 VALUE 999999.
    
    PROCEDURE DIVISION.
    000-MAIN.
        OPEN INPUT IN-FILE.
        OPEN OUTPUT OUT-FILE.
        PERFORM UNTIL IN-RECORD = 'EOF'
            MOVE ZERO TO TOTAL-SALARY
            PERFORM 100-DISPLAY-HEADER
            PERFORM READ-PROCESS-IN-FILE
            PERFORM TOTAL-SALARY-CALCULATIONS
            PERFORM WRITE-PROCESS-OUT-FILE
            IF OUT-SALARY > HIGH-SALARY
                MOVE OUT-SALARY TO HIGH-SALARY
            END-IF
            IF OUT-SALARY < LOW-SALARY
                MOVE OUT-SALARY TO LOW-SALARY
            END-IF
        END-PERFORM.
    100-DISPLAY-HEADER.
        DISPLAY 'NAME'        SPACES 5 'SALARY'    SPACES 5 'STATUS'.
        DISPLAY '-----------------------------------------------------'.
        
    READ-PROCESS-IN-FILE.
        READ IN-FILE INTO IN-RECORD
        AT END MOVE 'EOF' TO IN-RECORD.
        
    TOTAL-SALARY-CALCULATIONS.
        COMPUTE TOTAL-SALARY = TOTAL-SALARY + OUT-SALARY.
        
    WRITE-PROCESS-OUT-FILE.
        MOVE OUT-NAME TO OUT-RECORD.
        MOVE TOTAL-SALARY TO OUT-SALARY.
        IF TOTAL-SALARY > 10000
            MOVE 'ORM' TO OUT-STATUS
        ELSE
            MOVE 'NRM' TO OUT-STATUS
        END-IF.
        WRITE OUT-RECORD.
        
    900-DISPLAY-TOTALS.
        DISPLAY 'TOTAL SALARY:'  SPACES 5 TOTAL-SALARY.
        DISPLAY 'HIGHEST SALARY:' SPACES 5 HIGH-SALARY.
        DISPLAY 'LOWEST SALARY:'  SPACES 5 LOW-SALARY.
        
    1000-EXIT.
        CLOSE IN-FILE, OUT-FILE.
        STOP RUN.