IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ws-hello-world PIC X(14) VALUE "Hello, World!".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
	        DISPLAY ws-hello-world.
	        STOP RUN.
       END PROGRAM HelloWorld.