IDENTIFICATION DIVISION.
 PROGRAM-ID. CALC-TOTAL.
 
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. IBM-MAINFRAME.
 OBJECT-COMPUTER. IBM-MAINFRAME.
 
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 PROMPT-FLAG PIC X(01).
 01 TOTAL-AMOUNT PIC S9(6)V99.
 
 PROCEDURE DIVISION.
 MAIN-ROUTINE.
     DISPLAY 'Please input expenses (Y/N): ' WITH NO ADVANCING.
     ACCEPT PROMPT-FLAG.
     IF PROMPT-FLAG = 'Y'
          PERFORM INPUT-EXPENSES UNTIL PROMPT-FLAG = 'N'
     ELSE
          EXIT MAIN-ROUTINE.
     END-IF.
     DISPLAY 'Total expenses = ' TOTAL-AMOUNT.
     STOP RUN.
 
 INPUT-EXPENSES.
     DISPLAY 'Please input amount: ' WITH NO ADVANCING.
     ACCEPT TOTAL-AMOUNT.
     ADD TOTAL-AMOUNT TO TOTAL-AMOUNT.
     DISPLAY TOTAL-AMOUNT.