IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-AGE.
DATE-WRITTEN. 01-01-2021.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CURRENT-DATE PIC 9(8).
01 BIRTHDATE PIC 9(8).
01 AGE PIC 9.

PROCEDURE DIVISION.
    DISPLAY "Enter your birthdate (MMDDYYYY): ".
    ACCEPT BIRTHDATE.

    CALL "CBL_GET_CURRENT_DATE" USING CURRENT-DATE.
    COMPUTE AGE = FUNCTION INTEGER(CURRENT-DATE - (BIRTHDATE + 10000)) / 10000.

    DISPLAY "Your age is: " AGE.
    
    STOP RUN.