IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COBOL-VAR-1 PIC 9(4).
       01 COBOL-VAR-2 PIC 9(4).
       01 COBOL-RESULT PIC 9(4).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Welcome to my sample program!".
           ACCEPT COBOL-VAR-1.
           ACCEPT COBOL-VAR-2.
           IF COBOL-VAR-1 < COBOL-VAR-2
              MOVE COBOL-VAR-1 TO COBOL-RESULT
           ELSE
              MOVE COBOL-VAR-2 TO COBOL-RESULT
           END-IF.
           DISPLAY "The larger number is: " COBOL-RESULT.
           STOP RUN.