ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 IN-FILE-RECORD.
          03 IN-CUSTNUM      PIC 9(10).
          03 IN-NAME         PIC X(20).
          03 IN-DEPT         PIC 9(2).
          03 IN-AMOUNT       PIC 9(5)V99.

       FD OUT-FILE.
       01 OUT-FILE-RECORD.
          03 OUT-CUSTNUM     PIC 9(10).
          03 OUT-NAME        PIC X(20).
          03 OUT-DEPT        PIC 9(2).
          03 OUT-AMOUNT      PIC 9(5)V99.

       WORKING-STORAGE SECTION.
       01 WS-TOTAL-AMOUNT      PIC 9(7)V99 VALUE 0.
       01 WS-HIGHEST-AMOUNT    PIC 9(7)V99 VALUE 0.
       01 WS-LOWEST-AMOUNT     PIC 9(7)V99 VALUE 999999.99.
       01 WS-HIGHEST-CUSTNUM   PIC 9(10) VALUE 0.
       01 WS-LOWEST-CUSTNUM    PIC 9(10) VALUE 9999999999.

       PROCEDURE DIVISION.
       OPEN INPUT IN-FILE
       OPEN OUTPUT OUT-FILE

       PERFORM UNTIL EOF-FLAG = 'Y'
          READ IN-FILE
             AT END SET EOF-FLAG = 'Y'
             NOT AT END
                IF IN-AMOUNT > WS-HIGHEST-AMOUNT
                   MOVE IN-AMOUNT TO WS-HIGHEST-AMOUNT
                   MOVE IN-CUSTNUM TO WS-HIGHEST-CUSTNUM
                END-IF
                IF IN-AMOUNT < WS-LOWEST-AMOUNT
                   MOVE IN-AMOUNT TO WS-LOWEST-AMOUNT
                   MOVE IN-CUSTNUM TO WS-LOWEST-CUSTNUM
                END-IF
                ADD IN-AMOUNT TO WS-TOTAL-AMOUNT
             END-NOT-AT-END
          END-READ
       END-PERFORM

       MOVE WS-HIGHEST-CUSTNUM TO OUT-CUSTNUM
       MOVE WS-LOWEST-CUSTNUM TO OUT-CUSTNUM
       MOVE WS-HIGHEST-AMOUNT TO OUT-AMOUNT
       MOVE WS-LOWEST-AMOUNT TO OUT-AMOUNT
       MOVE WS-TOTAL-AMOUNT TO OUT-AMOUNT

       WRITE OUT-FILE-RECORD
       CLOSE IN-FILE
       CLOSE OUT-FILE
       
       STOP RUN.