IDENTIFICATION DIVISION.
PROGRAM-ID. SORTING-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-LENGTH PIC 9(3).
01 ARRAY OCCURS 0 TO 999 TIMES
DEPENDING ON ARRAY-LENGTH.
05 ARRAY-ELEMENT PIC 9(3) OCCURS 1 TIMES.
01 TEMP PIC 9(3).
PROCEDURE DIVISION.
START-PROCESS.
	ACCEPT ARRAY-LENGTH FROM CONSOLE.
	PERFORM READ-ARRAY.
	PERFORM SORT.
	PERFORM DISPLAY-ARRAY.
STOP-RUN.

READ-ARRAY.
	DISPLAY "ENTER THE ELEMENTS OF ARRAY:".
	PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-LENGTH
		ACCEPT ARRAY(I).
	END-PERFORM.

SORT.
	PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-LENGTH - 1
		PERFORM VARYING J FROM I + 1 BY 1 UNTIL J > ARRAY-LENGTH
			IF ARRAY(I) > ARRAY(J)
				MOVE ARRAY(I) TO TEMP.
				MOVE ARRAY(J) TO ARRAY(I).
				MOVE TEMP TO ARRAY(J).
			END-IF.
		END-PERFORM.
	END-PERFORM.

DISPLAY-ARRAY.
	DISPLAY "THE SORTED ARRAY IS:".
	PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-LENGTH
		DISPLAY ARRAY(I).
	END-PERFORM.