DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIBO-NUMS.
          05 FIBO-ARRAY OCCURS 20 TIMES.
             10 FIBO-NUM PIC 9(10).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           MOVE 0 TO FIBO-ARRAY(1).
           MOVE 1 TO FIBO-ARRAY(2).
           PERFORM FIBO-ITERATE VARYING I FROM 3 TO 20.
           DISPLAY "Fibonacci Numbers: ".
           PERFORM PRINT-FIBOS VARYING I FROM 1 TO 20.
       EXIT.
       FIBO-ITERATE SECTION.
           COMPUTE FIBO-NUM = FIBO-ARRAY(I-1) + FIBO-ARRAY(I-2).
           MOVE FIBO-NUM TO FIBO-ARRAY(I).
       EXIT.
       PRINT-FIBOS SECTION.
           DISPLAY FIBO-ARRAY(I).
       EXIT.