WORKING-STORAGE SECTION.                 * Declaration of working storage section
       01 MY-NUMBER PIC 9(3) VALUE ZERO.         * Declares a variable with initial value of 0
       01 MY-STRING PIC X(10) VALUE 'HELLO'.     * Declares a string variable with initial value of 'HELLO'
       77 MY-COUNTER PIC 9(2) VALUE 1.           * Declares a counter variable with initial value of 1
      
       PROCEDURE DIVISION.                      * Start of procedure division
       MAIN-PROCEDURE.                          * Main procedure
           PERFORM                          * Start of PERFORM loop
               VARYING MY-COUNTER           * Loop through MY-COUNTER variable
               FROM 1 BY 1                  * Starting value is 1, increment by 1
               UNTIL MY-COUNTER > MY-NUMBER  * Loop until MY-COUNTER is greater than MY-NUMBER
               DISPLAY MY-STRING            * Output MY-STRING value
               SET MY-STRING TO 'WORLD'      * Change MY-STRING value to 'WORLD'
          END-PERFORM.                       * End of PERFORM loop
          
          DISPLAY 'Loop finished'.            * Output message indicating loop is finished
          STOP.                               * End program execution
       END MAIN-PROCEDURE.                    * End main procedure
       
       END PROGRAM SAMPLE_PROGRAM.             * End program declaration