identification division.
program-id. HELLO-WORLD.

environment division.
configuration section.
source-computer. my-computer.
object-computer. my-computer.

data division.
working-storage section.
01 name pic x(20) value "John Smith".
01 age pic 99 value 25.
01 salary pic 9(6)v99 value 100000.

procedure division.
begin
	display "Hello, World! My name is " name " and I am " age " years old."
	if salary is less than 50000 then
		display "I am underpaid."
	else if salary is greater than 100000 then
		display "I am overpaid."
	else
		display "My salary is just right."
end