Identification Division.                                  *identifier division for program
Program-ID. Test-Program.                                  *program name
Author. Abigail Smith.                                     *name of author
Environment Division.
Configuration Section.
Source-Computer. IBM-PC.                                   *computer used for program
Object-Computer. IBM-PC.                                   *computer used to run program
Data Division.
Working-Storage Section.
01 Student-Record.
   05 First-Name Pic X(10).                                 *variable for first name
   05 Last-Name Pic X(15).                                  *variable for last name
   05 Age Pic 99.                                           *variable for age
   05 GPA Pic 99V99.                                        *variable for GPA (floating point)
   05 Section Pic X(5).                                     *variable for section
   05 Address Pic X(30).                                    *variable for address
   05 Contact-Info.                                         *group variable for contact information
      10 Phone-Number Pic 999-999-9999.                     *sub-variable for phone number
      10 Email Pic X(30).                                   *sub-variable for email
Procedure Division.
Main-Procedure.                                             *start of main procedure
   Display "Enter student information:".
   Accept Student-Record.                                   *prompt user to enter student info
   Display "Student record entered:".
   Display "First Name: " First-Name.
   Display "Last Name: " Last-Name.
   Display "Age: " Age.
   Display "GPA: " GPA.
   Display "Section: " Section.
   Display "Address: " Address.
   Display "Phone Number: " Phone-Number.
   Display "Email: " Email.
   Stop Run.                                                *end of program
End Program Test-Program.                                   *end program statement