IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM-1 PIC 99.
77 NUM-2 PIC 99.
77 RESULT PIC 999.

PROCEDURE DIVISION.
MAIN-PROGRAM.
    DISPLAY "Enter first number: ".
    ACCEPT NUM-1.
    DISPLAY "Enter second number: ".
    ACCEPT NUM-2.

    IF NUM-1 > NUM-2 THEN
        PERFORM MULTIPLY-LOOP

    ELSE IF NUM-1 = NUM-2 THEN
        PERFORM ADDITION-LOOP

    ELSE
        PERFORM SUBTRACT-LOOP

    END-IF.

MULTIPLY-LOOP.
    PERFORM UNTIL NUM-2 = 0.
        ADD NUM-1 TO RESULT.
        SUBTRACT 1 FROM NUM-2.
    END-PERFORM.

    DISPLAY "The product is: " RESULT.

ADDITION-LOOP.
    ADD NUM-1, NUM-2 TO RESULT.
    DISPLAY "The sum is: " RESULT.

SUBTRACT-LOOP.
    SUBTRACT NUM-1 FROM NUM-2 GIVING RESULT.
    DISPLAY "The difference is: " RESULT.

STOP RUN.