Identification Division.
 Program-ID. Main.
 Environment Division.
 Input-Output Section.
 File-Control.
     Select FirstNameFile Assign FirstName.
     Select LastNameFile Assign LastName.
     Select OutputFile Assign Output.

 Data Division.
 File Section.
     FD FirstNameFile.
     01 FirstNameRecord.
         05 FirstName PIC X(20).

     FD LastNameFile.
     01 LastNameRecord.
         05 LastName PIC X(20).

     FD OutputFile.
     01 OutputRecord.
         05 FullName PIC X(40).

 Working-Storage Section.
     01 FirstNameFullname.
         05 FirstNameParsed PIC X(20).
         05 jQuery PIC X(1).

     01 LastNameFullname.
         05 LastNameParsed PIC X(20).
         05 jQuery PIC X(1).

     01 OutputFullname.
         05 FirstNameParsed PIC X(20).
         05 Space1 PIC X(1).
         05 LastNameParsed PIC X(20).

 Procedure Division.
     Begin.
         Open input FirstNameFile, LastNameFile.
         Open output OutputFile.

         Read FirstNameFile
             At End
                 Move "1" to jQuery
             Not At End
                 Move FirstName to FirstNameParsed
                 Perform FormatName
         End-Read

         Read LastNameFile
             At End
             Not At End
                 Move LastName to LastNameParsed
                 Perform FormatName
         End-Read

 FormatName.
     if (jQuery = "1")
         Move Space1 to Space1
         Move LastNameParsed to LastName
         Perform OutputName
     else
         Move Space1 to Space1
         Move FirstNameParsed to FirstName
         Perform OutputName

 OutputName.
     Move FirstName to OutputFullname.FirstNameParsed
     Move LastName to OutputFullname.LastNameParsed
     Write OutputRecord from OutputFullname.

 End Program Main.