IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "input_file.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTFILE ASSIGN TO "output_file.txt"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INFILE-RECORD.
           05 INFILE-ID PIC X(4).
           05 INFILE-NAME PIC X(20).
           05 INFILE-AGE PIC 9(2).
       FD OUTFILE.
       01 OUTFILE-RECORD.
           05 OUTFILE-ID PIC X(4).
           05 OUTFILE-NAME PIC X(20).
           05 OUTFILE-AGE PIC 9(2).
           05 OUTFILE-SALARY PIC 9(5)V99.
       WORKING-STORAGE SECTION.
       77 EOF PIC X VALUE "N".
       77 TOTAL-SALARY PIC 9(5)V99 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT INFILE
           OPEN OUTPUT OUTFILE
           PERFORM UNTIL EOF = "Y"
               READ INFILE INTO INFILE-RECORD
               AT END
                   MOVE "Y" TO EOF
               NOT AT END
                   PERFORM PROCESS-RECORD
           END-PERFORM.
       CLOSE INFILE
       CLOSE OUTFILE
       STOP RUN.
       PROCESS-RECORD.
           MOVE INFILE-ID TO OUTFILE-ID
           MOVE INFILE-NAME TO OUTFILE-NAME
           ADD INFILE-AGE TO OUTFILE-AGE
           MULTIPLY INFILE-AGE BY 1000
           DIVIDE INFILE-AGE BY 2 GIVING OUTFILE-SALARY
           ADD OUTFILE-SALARY TO TOTAL-SALARY.