IDENTIFICATION DIVISION.
  PROGRAM-ID. FACTORIAL-PROGRAM.
  DATA DIVISION.
    WORKING-STORAGE SECTION.
      01 NUM    PIC 9(4).
      01 FACT  PIC 9(9).
      01 I      PIC 9(4).
  PROCEDURE DIVISION.
    DISPLAY "ENTER A NUMBER: ".
    ACCEPT NUM.
    COMPUTE FACT = 1.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
      COMPUTE FACT = FACT * I.
    END-PERFORM.
    DISPLAY "FACTORIAL OF " NUM " IS " FACT ".".
  STOP RUN.