IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(4)V9(2).
01 NUM2 PIC 9(4)V9(2).
01 RESULT PIC 9(5)V9(2).
01 OPERAND PIC X.
01 ERROR-DIVISION PIC 9(4).
01 ERROR-MSG PIC X(50).

PROCEDURE DIVISION.
ACCEPT NUM1.
ACCEPT NUM2.
ACCEPT OPERAND.
MULTIPLY NUM1 BY NUM2 GIVING RESULT.
IF OPERAND = '/' THEN
   DIVIDE NUM1 BY NUM2 GIVING RESULT
ELSE IF OPERAND = '*' THEN
   MULTIPLY NUM1 BY NUM2 GIVING RESULT
ELSE IF OPERAND = '+' THEN
   ADD NUM1 TO NUM2 GIVING RESULT
ELSE IF OPERAND = '-' THEN
   SUBTRACT NUM2 FROM NUM1 GIVING RESULT
ELSE
   MOVE 1 TO ERROR-DIVISION
   MOVE 'Invalid operand given, please use one of the following: +, -, *, /' TO ERROR-MSG

IF ERROR-DIVISION = 1 THEN
   DISPLAY ERROR-MSG

DISPLAY "The result is: ", RESULT.

STOP RUN.