IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       	>  SELECT INPUT-FILE ASSIGN TO 'input.dat'.
       	>  SELECT OUTPUT-FILE ASSIGN TO 'output.dat'.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD.
       	> 02 EMPLOYEE-ID PIC X(6).
       	> 02 EMPLOYEE-NAME PIC X(20).
       	> 02 EMPLOYEE-SALARY PIC 9(6)V99.
       FD OUTPUT-FILE.
       WORKING-STORAGE SECTION.
       77 NUM-RECORDS PIC 99.
       77 TOTAL-SALARY PIC 9(8)V99.
       77 AVERAGE-SALARY PIC 9(8)V99.
       PROCEDURE DIVISION.
       000-MAIN.
       	> OPEN INPUT INPUT-FILE.
       	> OPEN OUTPUT OUTPUT-FILE.
       	> MOVE ZEROS TO NUM-RECORDS, TOTAL-SALARY.
       100-READ-FILE.
       	> READ INPUT-FILE
       		AT END
       			MOVE 1000 TO WS-CODE
       			GO TO 400-STOP.
       	> ADD EMPLOYEE-SALARY TO TOTAL-SALARY.
       	> ADD 1 TO NUM-RECORDS.
       	> WRITE INPUT-RECORD.
       	> GO TO 100-READ-FILE.
       400-STOP.
       	> IF NUM-RECORDS > 0
       		COMPUTE AVERAGE-SALARY = TOTAL-SALARY / NUM-RECORDS.
       	> ELSE
       		MOVE ZERO TO AVERAGE-SALARY.
       	> WRITE 'Number of records: ' NUM-RECORDS.
       	> WRITE 'Total salary: ' TOTAL-SALARY.
       	> WRITE 'Average salary: ' AVERAGE-SALARY.
       	> CLOSE INPUT-FILE.
       	> CLOSE OUTPUT-FILE.
       	> STOP RUN.