ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
     
       FILE-CONTROL.
           SELECT FILE-A ASSIGN TO "input1.txt".
           SELECT FILE-B ASSIGN TO "input2.txt".
           SELECT FILE-C ASSIGN TO "output.txt".
     
       DATA DIVISION.
     
       FILE SECTION.
     
       FD FILE-A.
           01 CONTENT-A PIC X(20).
     
       FD FILE-B.
           01 CONTENT-B PIC X(20).
     
       FD FILE-C.
           01 CONTENT-C PIC X(40).
     
       WORKING-STORAGE SECTION.
     
       01 INPUT-VAR PIC 9(6)V99.
     
       01 OUTPUT-VAR PIC 9(8)V99.
     
       PROCEDURE DIVISION.
     
       000-START.
           OPEN INPUT FILE-A
           OPEN INPUT FILE-B
           OPEN OUTPUT FILE-C
           PERFORM UNTIL CONTENT-A = "END"
               READ FILE-A
               AT END MOVE "END" TO CONTENT-A
               PERFORM UNTIL CONTENT-B = "END"
                   READ FILE-B
                   AT END MOVE "END" TO CONTENT-B
                   COMPUTE INPUT-VAR = FUNCTION NUMVAL(CONTENT-A) + FUNCTION NUMVAL(CONTENT-B)
                   COMPUTE OUTPUT-VAR = INPUT-VAR * 2
                   WRITE CONTENT-C FROM NUMVAL(INPUT-VAR)
                   ADD 1 TO INPUT-VAR
               END-PERFORM
           END-PERFORM.
     
       000-END.
           CLOSE FILE-A
           CLOSE FILE-B
           CLOSE FILE-C
           STOP RUN.