* This program will calculate the average of three numbers
IDENTIFICATION DIVISION.
PROGRAM-ID. AVERAGE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 0.
01 NUM2 PIC 9(3) VALUE 0.
01 NUM3 PIC 9(3) VALUE 0.
01 AVG PIC 9(3)V99 VALUE 0.
01 TOTAL PIC 9(3)V99 VALUE 0.

PROCEDURE DIVISION.
* Get input from user
GET_INPUTS.
    DISPLAY "Enter the first number: ".
    ACCEPT NUM1.
    DISPLAY "Enter the second number: ".
    ACCEPT NUM2.
    DISPLAY "Enter the third number: ".
    ACCEPT NUM3.

* Calculate average
CALCULATE_AVERAGE.
    COMPUTE TOTAL = NUM1 + NUM2 + NUM3.
    COMPUTE AVG = TOTAL / 3.

* Display result
DISPLAY_MESSAGE.
    DISPLAY "The average of " NUM1 " , " NUM2 " and " NUM3 " is: " AVG.

STOP RUN.