IDENTIFICATION DIVISION.                            * This is the Identification Division
PROGRAM-ID. MYPROGRAM.                               * The program name is MYPROGRAM
ENVIRONMENT DIVISION.                               * This is the Environment Division
DATA DIVISION.                                      * This is the Data Division
WORKING-STORAGE SECTION.                            * This is the Working-Storage Section
77 NUMBER-1 PIC 9(5) VALUE 12345.                    * Declare a variable named NUMBER-1 with value of 12345
77 NUMBER-2 PIC 9(5) VALUE 98765.                    * Declare a variable named NUMBER-2 with value of 98765
77 RESULT PIC 9(6) VALUE 0.                          * Declare a variable named RESULT with initial value of 0
PROCEDURE DIVISION.                                  * This is the Procedure Division
ADD NUMBER-1 TO NUMBER-2 GIVING RESULT.               * Add NUMBER-1 to NUMBER-2 and store in RESULT
DISPLAY 'The sum of ' NUMBER-1 ' and ' NUMBER-2       * Display the value of NUMBER-1 and NUMBER-2
        ' is ' RESULT.                               * along with the result
STOP RUN.                                            * End the program