IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(37) VALUE 'HELLO, WORLD, THE ELEPHANT IS IN THE HALL'.
       PROCEDURE DIVISION.
       DISPLAY GREETING.
       GOBACK.