IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SALE-RECORD ASSIGN TO DISK
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD SALE-RECORD.
       01 SALE-ENTRY.
           05 SALE-ID PIC X(6).
           05 SALE-DATE PIC X(8).
           05 SALE-AMOUNT PIC 9(8)V99.

       WORKING-STORAGE SECTION.
       01 TOTAL-SALES PIC 9(10)V99.
       01 ERROR-FLAG PIC X.
       01 ERROR-MESSAGE PIC X(50).

       PROCEDURE DIVISION.
           PERFORM UNTIL SALE-ID = '999999'
               DISPLAY 'Enter sale ID:'
               ACCEPT SALE-ID
               DISPLAY 'Enter sale date (mmddyyyy):'
               ACCEPT SALE-DATE
               DISPLAY 'Enter sale amount:'
               ACCEPT SALE-AMOUNT
               WRITE SALE-ENTRY
                   INVALID KEY
                     MOVE 'I' TO ERROR-FLAG
                     MOVE 'Error writing to file' TO ERROR-MESSAGE
               NOT INVALID KEY
                   ADD SALE-AMOUNT TO TOTAL-SALES
           END-PERFORM.

           IF ERROR-FLAG = 'I'
               DISPLAY ERROR-MESSAGE
           ELSE
               DISPLAY 'Total sales: ' TOTAL-SALES
           END-IF.

           CLOSE SALE-RECORD.
           STOP RUN.