IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.

01 INPUT-DATA.
 05 NUM-OF-EMPLOYEES PIC 9(5).
 05 EMP-RECORD OCCURS 0 TO 999 TIMES 
   DEPENDING ON NUM-OF-EMPLOYEES.
    10 EMPLOYEE-ID PIC 9(5).
    10 EMPLOYEE-NAME PIC X(20).
    10 EMPLOYEE-SALARY PIC 9(6).

01 OUTPUT-DATA.
 05 NUM-OF-EMPLOYEES PIC 9(5).
 05 AVERAGE-SALARY PIC 9(6).
 
PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM GET-DATA.
    PERFORM PROCESS-DATA
    PERFORM DISPLAY-DATA.
    STOP RUN.
    
GET-DATA.
    DISPLAY "ENTER THE NUMBER OF EMPLOYEES: ".
    ACCEPT NUM-OF-EMPLOYEES.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-OF-EMPLOYEES
    PERFORM 
        DISPLAY "ENTER EMPLOYEE ID: ".
        ACCEPT EMPLOYEE-ID (I).
        DISPLAY "ENTER EMPLOYEE NAME: ".
        ACCEPT EMPLOYEE-NAME (I).
        DISPLAY "ENTER EMPLOYEE SALARY: ".
        ACCEPT EMPLOYEE-SALARY (I).
        ADD EMPLOYEE-SALARY (I) TO TOTAL-SALARY.
    END-PERFORM.
    
PROCESS-DATA.
    COMPUTE AVERAGE-SALARY = TOTAL-SALARY / NUM-OF-EMPLOYEES.

DISPLAY-DATA.
    DISPLAY "THE AVERAGE SALARY OF ALL EMPLOYEES IS: ", AVERAGE-SALARY.

END PROGRAM MY-PROGRAM.