IDENTIFICATION DIVISION.                                           
       PROGRAM-ID. SAMPLE-PROGRAM.                                         
       DATA DIVISION.                                                      
       WORKING-STORAGE SECTION.                                            
       01  NUM1                PIC 9(5).                                    
       01  NUM2                PIC 9(5).                                    
       01  SUM                 PIC 9(6).                                     
                                                                           
       PROCEDURE DIVISION.                                                  
           DISPLAY "Enter first number: "                                   
           ACCEPT NUM1                                                      
           DISPLAY "Enter second number: "                                  
           ACCEPT NUM2                                                      
           ADD NUM1, NUM2 GIVING SUM.
           DISPLAY "The sum of "                                      
                   NUM1 SPACE "and "                                  
                   NUM2 SPACE "is "                                  
                   SUM                                                      
           STOP RUN.                                                       
        END PROGRAM SAMPLE-PROGRAM.