WORKING-STORAGE SECTION.
     01  EMPLOYEE-TABLE.
         02 EMPLOYEE-RECORD OCCURS 50 TIMES
             INDEXED BY EMPLOYEE-INDEX.
             03 EMPLOYEE-ID           PIC X(6).
             03 EMPLOYEE-NAME         PIC X(30).
             03 EMPLOYEE-AGE          PIC 99.
             03 EMPLOYEE-DEPARTMENT   PIC X(20).
             03 EMPLOYEE-SALARY       PIC 9(8)V99.
     01  TOTAL-SALARY                PIC 9(8)V99.
     
     PROCEDURE DIVISION.
         PERFORM VARYING EMPLOYEE-INDEX FROM 1 BY 1
             UNTIL EMPLOYEE-INDEX > 50
             IF (EMPLOYEE-DEPARTMENT(EMPLOYEE-INDEX) = 'SALES')
                ADD EMPLOYEE-SALARY(EMPLOYEE-INDEX) TO TOTAL-SALARY
             END-IF
         END-PERFORM
         DISPLAY 'Total salary for Sales department is 'TOTAL-SALARY
     END PROGRAM.