IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
AUTHOR. YOUR-NAME.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INFILE ASSIGN TO "SAMPLE.TXT"
ORGANIZATION IS LINE SEQUENTIAL.
SELECT OUTFILE ASSIGN TO "OUTPUT.TXT"
ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD INFILE.
01 EMPLOYEE-DATA.
O2 EMPLOYEE-NAME PIC X(20).
O2 EMPLOYEE-ID PIC 9(5).
O2 EMPLOYEE-DEPARTMENT PIC X(10).
O2 EMPLOYEE-SALARY PIC 9(10)V99.
FD OUTFILE.
01 REPORT-LINE.
02 REPORT-NAME PIC X(20).
02 REPORT-DEPARTMENT PIC X(10).
02 REPORT-SALARY PIC 9(10)V99.
WORKING-STORAGE SECTION.
01 NUM-EMPLOYEES PIC 9(5).
01 AVG-SAL PIC 9(10)V99.
01 TOTAL-SAL PIC 9(10)V99.
01 MAX-SAL PIC 9(10)V99.
01 MIN-SAL PIC 9(10)V99.
PROCEDURE DIVISION.
OPEN INPUT INFILE.
OPEN OUTPUT OUTFILE.
MOVE 0 TO TOTAL-SAL.
MOVE 0 TO MAX-SAL.
MOVE 999999.99 TO MIN-SAL.
READ INFILE AT END GO TO END-PARAGRAPH.
PERFORM UNTIL INFILE-EOF
ADD EMPLOYEE-SALARY TO TOTAL-SAL
IF EMPLOYEE-SALARY > MAX-SAL
THEN MOVE EMPLOYEE-SALARY TO MAX-SAL.
IF EMPLOYEE-SALARY < MIN-SAL
THEN MOVE EMPLOYEE-SALARY TO MIN-SAL.
MOVE EMPLOYEE-NAME TO REPORT-NAME.
MOVE EMPLOYEE-DEPARTMENT TO REPORT-DEPARTMENT.
MOVE EMPLOYEE-SALARY TO REPORT-SALARY.
WRITE REPORT-LINE.
READ INFILE AT END GO TO END-PARAGRAPH.
END-PARAGRAPH.
MOVE 0 TO NUM-EMPLOYEES.
MOVE TOTAL-SAL TO AVG-SAL.
DIVIDE AVG-SAL BY NUM-EMPLOYEES GIVING AVG-SAL.
WRITE AVG-SAL.
WRITE MAX-SAL.
WRITE MIN-SAL.
CLOSE INFILE.
CLOSE OUTFILE.
STOP RUN.