IDENTIFICATION DIVISION.
       PROGRAM-ID. complex-calculation.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 input1    PIC S9(4)V9(2).
       01 input2    PIC S9(4)V9(2).
       01 input3    PIC S9(4)V9(2).
       01 result    PIC S9(9)V9(2).

       01 temp-input1    PIC S9(9)V9(2).
       01 temp-input2    PIC S9(9)V9(2).

       01 temp-result    PIC S9(9)V9(2).
       01 final-result   PIC S9(9)V9(2).

       PROCEDURE DIVISION.

       MAIN-PROCEDURE SECTION.

       DISPLAY 'Enter first number: '.
       ACCEPT input1.

       DISPLAY 'Enter second number: '.
       ACCEPT input2.

       DISPLAY 'Enter third number: '.
       ACCEPT input3.

       IF input1 < 0
           MOVE input1 TO temp-input1
           MULTIPLY -1 BY temp-input1
           MOVE temp-input1 TO input1
       END-IF.

       IF input2 < 0
           MOVE input2 TO temp-input2
           MULTIPLY -1 BY temp-input2
           MOVE temp-input2 TO input2
       END-IF.

       COMPUTE result = (input1 * input2) / input3.

       IF input1 < 0
           MOVE input1 TO temp-input1
           MULTIPLY -1 BY temp-input1
           MOVE temp-input1 TO input1
       END-IF.

       IF result < 0
           MULTIPLY -1 BY result
       END-IF.

       IF input2 < 0
           MULTIPLY -1 BY input2
       END-if.

       IF input3 < 0
           MULTIPLY -1 BY input3
       END-IF.

       COMPUTE final-result = result + (input1 * input2 * input3).

       DISPLAY 'The final result is: ' final-result.

       STOP RUN.