IDENTIFICATION DIVISION.                                           
       PROGRAM-ID.  MYCOBOLPROGRAM.                                        
                                                                             
       ENVIRONMENT DIVISION.                                               
       INPUT-OUTPUT SECTION.                                               
       FILE-CONTROL.                                                       
           SELECT IN-FILE ASSIGN TO 'INFILE.DAT'.                           
           SELECT OUT-FILE ASSIGN TO 'OUTFILE.DAT'.                         
                                                                             
       DATA DIVISION.                                                      
       FILE SECTION.                                                       
       FD IN-FILE                                                           
       RECORDING MODE IS F                                                
       LABEL RECORDS ARE STANDARD                                           
       DATA RECORD IS IN-RECORD.                                           
       01  IN-RECORDS.                                                     
           05  IN-NAME           PIC X(10).                                 
           05  IN-AGE            PIC 99.                                   
                                                                             
       FD OUT-FILE                                                          
       RECORDING MODE IS F.                                                
       LABEL RECORDS ARE STANDARD.                                          
       DATA RECORD IS OUT-RECORD.                                           
       01 OUT-RECORDS.                                                     
           05  OUT-NAME          PIC X(10).                                 
           05  OUT-AGE           PIC 99.                                   
                                                                             
       WORKING-STORAGE SECTION.                                            
       01 NAME-COUNT            PIC 9(3) VALUE 0.                           
                                                                             
       PROCEDURE DIVISION.                                                  
       100-MAIN-ROUTINE.                                                    
           OPEN INPUT IN-FILE                                               
           OPEN OUTPUT OUT-FILE                                             
           PERFORM UNTIL EOF                                                 
               READ IN-FILE INTO IN-RECORD                                  
               IF NOT EOF                                                    
                   ADD 1 TO NAME-COUNT                                         
                   PERFORM 200-PROCESS-RECORD                                    
               END-IF                                                             
           END-PERFORM                                                          
           CLOSE IN-FILE                                                         
           CLOSE OUT-FILE                                                        
           STOP RUN.                                                             
                                                                                 
       200-PROCESS-RECORD.                                                       
           MOVE IN-NAME TO OUT-NAME                                               
           MOVE IN-AGE TO OUT-AGE                                                 
           WRITE OUT-RECORD                                                       
           EXIT.                                                                  
                                                                                 
       END PROGRAM MYCOBOLPROGRAM.