IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-STRING PIC X(15) VALUE 'HELLO, WORLD'.
01 OUTPUT-STRING PIC X(15).
PROCEDURE DIVISION.
    MOVE INPUT-STRING TO OUTPUT-STRING.
    DISPLAY OUTPUT-STRING.
    STOP RUN.