IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SALESFILE ASSIGN TO "SALES.DAT" ORGANIZATION IS LINE SEQUENTIAL.
           SELECT INVENTORYFILE ASSIGN TO "INVENTORY.DAT" ORGANIZATION IS INDEXED.
       DATA DIVISION.
       FILE SECTION.
       FD SALESFILE.
       01 SALES-RECORD.
           05 SALES-DATE.
               10 SALES-YEAR    PIC 9(4).
               10 SALES-MONTH   PIC 9(2).
               10 SALES-DAY     PIC 9(2).
           05 SALES-TOTAL       PIC 9(6).
       FD INVENTORYFILE.
       01 ITEM-TABLE.
           05 ITEM-NUM           PIC 9(4).
           05 ITEM-NAME          PIC X(20).
           05 ITEM-PRICE         PIC 9(5)V99.
           05 ITEM-QUANTITY      PIC 9(3).
       WORKING-STORAGE SECTION.
       01 DATE-TABLE.
           05 CURR-YEAR     PIC 9(4).
           05 CURR-MONTH    PIC 9(2).
           05 CURR-DAY      PIC 9(2).
       01 TOTAL-SALES         PIC 9(8)V99 VALUE 0.
       01 AVG-SALES           PIC 9(8)V99 VALUE 0.
       01 ITEM-NAME-SALES.
           05 ITEM-NAME-ARRAY OCCURS 20 TIMES.
               10 SALES-ITEM PIC X(20).
       01 COUNTER-NUM  PIC 99 VALUE 0.
       PROCEDURE DIVISION.
       BEGIN.
       OPEN INPUT SALESFILE
       OPEN I-FILE.
       READ SALESFILE
       MOVE CURR-YEAR TO SALES-YEAR
       ACCEPT CURR-MONTH
       SET CURR-DAY TO 00
       WHILE SALES-DATE < CURR-YEAR
           ADD SALES-TOTAL TO TOTAL-SALES
           ADD 1 TO ITEM-QUANTITY
           MOVE ITEM-NAME TO SALES-ITEM(COUNTER-NUM)
           ADD 1 TO COUNTER-NUM
       END-WHILE.
       MOVE TOTAL-SALES TO AVG-SALES
       CLOSE SALESFILE
       CLOSE I-FILE.
       STOP RUN.