IDENTIFICATION DIVISION.
    PROGRAM-ID. SAMPLE-PROGRAM.

    DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 NUM1 PIC S9(4) VALUE 2000.
    01 NUM2 PIC S9(4) VALUE 1000.
    01 RESULT PIC S9(5) VALUE 0.

    PROCEDURE DIVISION.
    COMPUTE RESULT = NUM1 + NUM2.

    DISPLAY 'The result is: ' RESULT.
    STOP RUN.