IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MESSAGE PIC X(30) VALUE 'HELLO, WORLD!'.
PROCEDURE DIVISION.
MAIN-RTN.
DISPLAY MESSAGE
STOP RUN.