IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ARRAY.
          05 NUMBERS OCCURS 5 TIMES PIC 9(3).
          05 MAXIMUM PIC 9(3).
          05 MINIMUM PIC 9(3).
          05 AVG-VALUE PIC 9(3).
       01 SUM PIC 9(4).
       PROCEDURE DIVISION.
       PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 5
          ACCEPT NUMBERS(COUNT)
          IF COUNT = 1
             MOVE NUMBERS(COUNT) TO MAXIMUM
             MOVE NUMBERS(COUNT) TO MINIMUM
             ADD NUMBERS(COUNT) TO SUM
          ELSE
             IF NUMBERS(COUNT) > MAXIMUM
                MOVE NUMBERS(COUNT) TO MAXIMUM
             END-IF
             IF NUMBERS(COUNT) < MINIMUM
                MOVE NUMBERS(COUNT) TO MINIMUM
             END-IF
             ADD NUMBERS(COUNT) TO SUM
          END-IF
        END-PERFORM
        COMPUTE AVG-VALUE = SUM / 5
        DISPLAY "Maximum number: " MAXIMUM
        DISPLAY "Minimum number: " MINIMUM
        DISPLAY "Average value: " AVG-VALUE
        STOP RUN.