IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(3).
01 RESULT PIC 9(9).
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY 'Enter the value of N: '
    ACCEPT N
    PERFORM FIBONACCI UNTIL N <= 0
    DISPLAY 'Fibonacci of N = ' RESULT
    STOP RUN.
FIBONACCI.
    IF N = 1 OR N = 2
        SET RESULT TO 1
    ELSE
        SET RESULT TO 0 
        PERFORM FIB-ADD UNTIL N <= 2 
    END-IF.
FIB-ADD.
    SET RESULT UP BY 1 
    SET N DOWN BY 1 
    IF N = 1 OR N = 2 
        SET RESULT UP BY 1 
    ELSE 
        PERFORM FIB-ADD 
    END-IF.
END PROGRAM FIBONACCI.