*(a) Division to calculate factorial of a number.*

    IDENTIFICATION DIVISION. 
    PROGRAM-ID. FACTORIAL. 
    DATA DIVISION. 
    WORKING-STORAGE SECTION.
    01 INPUT-NUMBER PIC 9(3). # Declaring a variable for input number
    01 FACT-TABLE OCCURS 0 TO 100 TIMES 
       DEPENDING ON INPUT-NUMBER. # Declaring a table to store factorials 
    * and specifying its size based on input number.

    PROCEDURE DIVISION. 
    MAIN-PARA.
        DISPLAY 'Enter a number to find its factorial: '. 
        ACCEPT INPUT-NUMBER.
        IF INPUT-NUMBER IS NUMERIC
           PERFORM FACT-CALC VARYING I FROM 1 BY 1 # Loop to calculate factorial 
           UNTIL I > INPUT-NUMBER 
        ELSE
           DISPLAY 'Invalid input. Please enter a numeric value.' 
           GO TO MAIN-PARA.
        END-IF.
        DISPLAY 'Factorial of ' INPUT-NUMBER ' is: ' 
        DISPLAY FACT-TABLE(INPUT-NUMBER). # Outputting the factorial result 
        STOP RUN.

    FACT-CALC.
        MULTIPLY FACT-TABLE(I) BY I. # Calculating factorial by multiplying 
        IF I > 2                     # each number in the table
           SUBTRACT 1 FROM I 
           MULTIPLY FACT-TABLE(I) BY FACT-TABLE(I-1) # Multiplying the current
                                                     # number with the previously 
                                                     # calculated factorial
        END-IF.
    END PROGRAM FACTORIAL.