IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 HELLO-MESSAGE PIC X(16) VALUE 'HELLO, WORLD!'.
       PROCEDURE DIVISION.
       DISPLAY HELLO-MESSAGE.
       STOP RUN.