IDENTIFICATION DIVISION.                         *Start of identification division
      PROGRAM-ID. EQUATION.                             *Program name is equation
      ENVIRONMENT DIVISION.                            *Start of environment division
      DATA DIVISION.                                   *Start of data division
      WORKING-STORAGE SECTION.                         *Start of working-storage section
      77 OPERATOR PIC X(1) VALUE '+'.                   *Operator for addition
      01 NUMBER1 PIC 9(4).                              *Variable for first number
      01 NUMBER2 PIC 9(4).                              *Variable for second number
      01 RESULT PIC 9(5).                               *Variable for result

      PROCEDURE DIVISION.                               *Start of procedure division
      MAIN-PROGRAM.                                     *Main program to perform calculation
          ACCEPT NUMBER1.                               *Accept first number
          ACCEPT NUMBER2.                               *Accept second number
          CALL "ADD" USING NUMBER1, NUMBER2, RESULT.    *Call addition subroutine
          DISPLAY "The result of addition is: ", RESULT.*Display result
          STOP RUN.                                     *Terminate program

       ADD.                                             *Subroutine for addition
          ADD NUMBER1, NUMBER2 GIVING RESULT.           *Add both numbers and store in result
          EXIT.                                         *Exit from subroutine