IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(5).
01 SUM PIC 9(5).

PROCEDURE DIVISION.
PERFORM VARYING NUM FROM 10 BY -2 UNTIL NUM < 1
    COMPUTE SUM = SUM + NUM
END-PERFORM.

DISPLAY "The sum of the numbers is " SUM.

STOP RUN.