IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-CODE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SNIPPET-CODE PIC X(100).
       01 INDEX-POSITIVE PIC 9(3) VALUE 1.
       01 INDEX-NEGATIVE PIC 9(3) VALUE -1.
       PROCEDURE DIVISION.
       PERFORM GENERATE-CODE VARYING INDEX-POSITIVE FROM 1 BY 1
                UNTIL INDEX-POSITIVE > 10
            PERFORM GENERATE-CODE VARYING INDEX-NEGATIVE FROM -1 BY -1
                    UNTIL INDEX-NEGATIVE < -10.
       DISPLAY "Generated code snippet:".
       DISPLAY SNIPPET-CODE(1:100).
       STOP RUN.

   GENERATE-CODE.
       SET SNIPPET-CODE(INDEX-POSITIVE:1) TO '!'
       SET SNIPPET-CODE(INDEX-NEGATIVE:1) TO '!'
       ADD 1 TO INDEX-POSITIVE
       ADD -1 TO INDEX-NEGATIVE.