****** INCREASE COMPLETION COUNT BY 1 ******
IDENTIFICATION DIVISION.
PROGRAM-ID. INCREASE-COUNT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CURRENT-COUNT PIC 9(5).
01 INCREASE-BY PIC 9(5).
01 NEW-COUNT PIC 9(5).
01 COMPLETION-RANGE.
   05 MIN-COUNT PIC 9(5) VALUE 0.
   05 MAX-COUNT PIC 9(5) VALUE 100.

PROCEDURE DIVISION.
MAIN-LOGIC SECTION.

   MOVE 10 TO CURRENT-COUNT.           *Example initial value of completion count
   MOVE 1 TO INCREASE-BY.              *Amount to increase count by
   COMPUTE NEW-COUNT = CURRENT-COUNT + INCREASE-BY.   *Add the increase value to current count
   IF NEW-COUNT > MAX-COUNT            *Check if new count is above max completion count
   THEN                                *If yes, reset to min value
       MOVE MIN-COUNT TO CURRENT-COUNT
   ELSE                                *If no, assign new count value
       MOVE NEW-COUNT TO CURRENT-COUNT
   END-IF.

   DISPLAY "Completion count is now: " CURRENT-COUNT.    *Print new completion count
STOP RUN.                                            *End of program