IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO-WORLD.
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 MSG-LENGTH PIC S9(3) VALUE 13.
      01 MSG PIC X(13) VALUE 'HELLO, WORLD'.
      PROCEDURE DIVISION.
      DISPLAY 'OUTPUT:'.
      DISPLAY MSG.
      STOP RUN.