IDENTIFICATION DIVISION.

PROGRAM-ID. SAMPLE-PROGRAM.

ENVIRONMENT DIVISION.

CONFIGURATION SECTION.

SOURCE-COMPUTER. MY-COMPUTER.

OBJECT-COMPUTER. MY-COMPUTER.

DATA DIVISION.

WORKING-STORAGE SECTION.

01 WS-SUM PIC 9(2) VALUE ZEROS.
01 WS-NUM1 PIC 9(2) VALUE ZEROS.
01 WS-NUM2 PIC 9(2) VALUE ZEROS.

PROCEDURE DIVISION.

MAIN-PARAGRAPH.

    DISPLAY "ENTER FIRST NUMBER:"
    ACCEPT WS-NUM1

    DISPLAY "ENTER SECOND NUMBER:"
    ACCEPT WS-NUM2

    MULTIPLY WS-NUM1 BY WS-NUM2 GIVING WS-SUM

    DISPLAY "THE SUM IS: " WS-SUM

    STOP RUN.