IDENTIFICATION DIVISION.                                // Indicates start of program
PROGRAM-ID. MYPROGRAM.                                   // Defines program name
DATA DIVISION.                                          // Contains program data
WORKING-STORAGE SECTION.                                // Declares working variables
01 NUM-A          PIC 9(5).                             // Defines variable NUM-A as 5-digit number
01 NUM-B          PIC 9(5).                             // Defines variable NUM-B as 5-digit number
01 RESULT         PIC 9(6).                             // Defines variable RESULT as 6-digit number
PROCEDURE DIVISION.                                     // Contains program logic
MAIN-LOGIC.                                             // Defines main logic
    MOVE 12345 TO NUM-A.                                 // Assigns value of 12345 to NUM-A
    MOVE 67890 TO NUM-B.                                 // Assigns value of 67890 to NUM-B
    ADD NUM-A, NUM-B GIVING RESULT.                      // Adds values of NUM-A and NUM-B and stores result in RESULT
    DISPLAY "The result is: " RESULT.                    // Displays result
STOP RUN.                                               // Stops program execution