IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT1 PIC 9(2).
01 INPUT2 PIC 9(2).
01 RESULT PIC 9(4).
PROCEDURE DIVISION.
MAIN-LOGIC.
DISPLAY "Enter first number:".
ACCEPT INPUT1.
DISPLAY "Enter second number:".
ACCEPT INPUT2.
ADD INPUT1, INPUT2 GIVING RESULT.
DISPLAY "Result is: " RESULT.
STOP RUN.