* This program calculates the average of 10 numbers
IDENTIFICATION DIVISION.
PROGRAM-ID. AVG-CALC.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-ARRAY.
    05 NUMERIC-NUM OCCURS 10 TIMES PIC 9(3).
01 SUM PIC 9(3).
01 CNT PIC 9(2) VALUE 10.
01 AVG PIC 9(3).

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "Enter 10 numbers:"
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        ACCEPT NUM-ARRAY(I)
    END-PERFORM.

    PERFORM ADDITION-PARA.
    PERFORM DIVISION-PARA.
    DISPLAY "The average of the 10 numbers is " AVG.

ADDITION-PARA.
    MOVE 0 TO SUM.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        ADD NUM-ARRAY(I) TO SUM
    END-PERFORM.

DIVISION-PARA.
    DIVIDE SUM BY CNT GIVING AVG.