IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO 'input.dat'
               FILE STATUS IS FILE-STATUS.
           SELECT OUTFILE ASSIGN TO 'output.dat'.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
           01 IN-RECORD.
               05 IN-NAME PIC X(20).
               05 IN-AGE PIC 9(3).
               05 IN-GENDER PIC X.
               05 IN-SALARY PIC 9(6).
       FD OUTFILE.
           01 OUT-RECORD.
               05 OUT-NAME PIC X(20).
               05 OUT-AGE PIC 9(3).
               05 OUT-GENDER PIC X.
               05 OUT-SALARY PIC $9(6).
       WORKING-STORAGE SECTION.
       01 FILE-STATUS PIC XX.
       01 TOTAL-SALARY PIC 9(8).
       77 END-OF-FILE VALUE 'EOF'.
       PROCEDURE DIVISION.
       OPEN INPUT INFILE
       OPEN OUTPUT OUTFILE
       PERFORM UNTIL FILE-STATUS EQUALS END-OF-FILE
           READ INFILE
           AT END MOVE END-OF-FILE TO FILE-STATUS
           NOT AT END
               IF IN-GENDER EQUALS 'F'
                   ADD IN-SALARY TO TOTAL-SALARY
                   MOVE IN-NAME TO OUT-NAME
                   MOVE IN-AGE TO OUT-AGE
                   MOVE IN-GENDER TO OUT-GENDER
                   MOVE IN-SALARY TO OUT-SALARY
                   WRITE OUT-RECORD
               END-IF
       END-PERFORM
       CLOSE INFILE
       CLOSE OUTFILE
       STOP RUN.