IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBER-1 PIC 9(3).
01 NUMBER-2 PIC 9(3).
01 SUM PIC 9(4).

PROCEDURE DIVISION.
DISPLAY "Enter first number: " UPON CONSOLE.
ACCEPT NUMBER-1 FROM CONSOLE.
DISPLAY "Enter second number: " UPON CONSOLE.
ACCEPT NUMBER-2 FROM CONSOLE.

IF (NUMBER-1 > 999 OR NUMBER-2 > 999) THEN
    DISPLAY "Invalid input. Please enter numbers less than 1000." UPON CONSOLE
ELSE
    COMPUTE SUM = NUMBER-1 + NUMBER-2.
    DISPLAY "The sum of " NUMBER-1 " and " NUMBER-2 " is " SUM UPON CONSOLE.
END-IF.

STOP RUN.