IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM1 PIC 9(3) VALUE 100. 
77 NUM2 PIC 9(3) VALUE 200.
77 RESULT PIC 9(6) VALUE 0.
PROCEDURE DIVISION.
    MULTIPLY NUM1 BY NUM2 GIVING RESULT.
    DISPLAY "The result of multiplying " NUM1 " by " NUM2 " is " RESULT.
    STOP RUN.