IDENTIFICATION DIVISION.
    PROGRAM-ID. SAMPLEPROGRAM.
        
   ENVIRONMENT DIVISION.
   CONFIGURATION SECTION.
   SOURCE-COMPUTER. IBM-370.
   OBJECT-COMPUTER. IBM-370.
        
   DATA DIVISION.
   WORKING-STORAGE SECTION.

   01 NAME.
      05 FIRST-NAMEM LAST-NAMEM.
         10 FIRST-NAME     PIC X(10) VALUE SPACES.
         10 LAST-NAME      PIC X(10) VALUE SPACES.

   01 ADDRESS.
      05 STREET-NUM     PIC 99.
      05 STREET-NAME    PIC X(20).
      05 APARTMENT-NUM  PIC 99.
        
   PROCEDURE DIVISION.
   DISPLAY "Please enter your first name."
   ACCEPT FIRST-NAME.
   DISPLAY "Please enter your last name."
   ACCEPT LAST-NAME.
   DISPLAY "Please enter your street number."
   ACCEPT STREET-NUM.
   DISPLAY "Please enter your street name."
   ACCEPT STREET-NAME.
   DISPLAY "Please enter your apartment number."
   ACCEPT APARTMENT-NUM.
   DISPLAY "Thank you for entering your information."

   DISPLAY "Hello " FIRST-NAME " " LAST-NAME "."
   DISPLAY "Your address is " STREET-NUM " " STREET-NAME ", APT " APARTMENT-NUM "."
        
   STOP RUN.