IDENTIFICATION DIVISION.
PROGRAM-ID. HELLOWORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WELCOME-MSG PIC X(30) VALUE 'Hello, World!'.

PROCEDURE DIVISION.
    DISPLAY WELCOME-MSG.
    STOP RUN.