IDENTIFICATION DIVISION.
 
 PROGRAM-ID. EXAMPLE.
 
 ENVIRONMENT DIVISION.
 
 INPUT-OUTPUT SECTION.
 
 FILE-CONTROL.
 
     SELECT INPUT-FILE ASSIGN TO "INPUT.TXT".
     SELECT OUTPUT-FILE ASSIGN TO "OUTPUT.TXT".
     
 DATA DIVISION.
 
 FILE SECTION.
 
 FD INPUT-FILE.
 
 01 INPUT-RECORD.
    05 INPUT-NAME       PIC X(20).
    05 INPUT-AGE        PIC 99.
    05 INPUT-SALARY     PIC 999999.99.
    05 INPUT-LOCATION   PIC X(15).
    
 FD OUTPUT-FILE.
 
 01 OUTPUT-RECORD.
    05 FILLER           PIC X(20).
    05 OUTPUT-NAME      PIC X(20).
    05 FILLER           PIC X(5).
    05 OUTPUT-AGE       PIC 99.
    05 FILLER           PIC X(8).
    05 OUTPUT-SALARY    PIC 999999.99.
    05 FILLER           PIC X(6).
    05 OUTPUT-LOCATION  PIC X(15).
 
 WORKING-STORAGE SECTION.
 
 01 TOTAL-SALARY      PIC 999999.99.
 
 PROCEDURE DIVISION.
 
     OPEN INPUT INPUT-FILE
     OPEN OUTPUT OUTPUT-FILE
 
     PERFORM UNTIL INPUT-FILE-END
         READ INPUT-FILE
             AT END SET INPUT-FILE-END TO TRUE
         NOT AT END
             COMPUTE TOTAL-SALARY = TOTAL-SALARY + INPUT-SALARY
             
             MOVE INPUT-NAME TO OUTPUT-NAME
             MOVE INPUT-AGE TO OUTPUT-AGE
             MOVE INPUT-LOCATION TO OUTPUT-LOCATION
             
             WRITE OUTPUT-RECORD
         END-READ
     END-PERFORM
     
     MOVE "TOTAL SALARY:" TO OUTPUT-NAME
     MOVE TOTAL-SALARY TO OUTPUT-SALARY
     
     WRITE OUTPUT-RECORD
 
     CLOSE INPUT-FILE
     CLOSE OUTPUT-FILE.