IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MESSAGE PIC X(11) VALUE 'HELLO WORLD'.
       PROCEDURE DIVISION.
           DISPLAY MESSAGE.
           STOP RUN.
       END PROGRAM HELLO-WORLD.