IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-SALARY.
       AUTHOR. JOHANNA SMITH.
      *
      *This program calculates the monthly salary
      *of an employee based on their hourly rate and hours worked
      *
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SAL-MASTER ASSIGN TO 'SALARY.MST'.
           SELECT SAL-OUT ASSIGN TO 'SALARY.RPT'.

       DATA DIVISION.
       FILE SECTION.
       FD SAL-MASTER
       LABEL RECORDS ARE STANDARD
       RECORD CONTAINS 17 CHARACTERS
       DATA RECORD IS SAL-REC.
       01 SAL-REC.
           02 EMP-ID PIC X(5).
           02 HOURLY-RATE PIC 99V99.
       FD SAL-OUT
       LABEL RECORDS ARE STANDARD
       RECORD CONTAINS 35 CHARACTERS
       DATA RECORD IS OUT-REC.
       01 OUT-REC.
           02 EMP-ID PIC X(5).
           02 TOTAL-SALARY PIC 9(8)V99.
       WORKING-STORAGE SECTION.
      *Variables to hold user input
       01 INPUT-EMP-ID PIC X(5).
       01 INPUT-HOURS-WORKED PIC 999.
       01 INPUT-HOURLY-RATE PIC 99V99.
      *Variables used for calculations
       01 BASE-SALARY PIC S9(6)V99 VALUE 0.
       01 TOTAL-SALARY PIC S9(6)V99 VALUE 0.
       01 COMPUTED-SALARY PIC S9(6)V99 VALUE 0.
       PROCEDURE DIVISION.
      *Open input and output files
       OPEN INPUT SAL-MASTER.
       OPEN OUTPUT SAL-OUT.
      *Loop through each record in the input file
       READ SAL-MASTER
       AT END GO TO END-OF-FILE.
       PERFORM CALC-SALARY
      *Format output record
       MOVE INPUT-EMP-ID TO OUT-REC(1:5).
       MOVE TOTAL-SALARY TO OUT-REC(6:8).
      *Write record to output file
       WRITE OUT-REC.
       GO TO PROCEDURE-DIVISION.
      *Calculate salary based on input data
       CALC-SALARY.
           MULTIPLY INPUT-HOURS-WORKED BY INPUT-HOURLY-RATE
           GIVING BASE-SALARY.
           IF BASE-SALARY GREATER THAN 4000
               MULTIPLY BASE-SALARY BY 1.5
               GIVING COMPUTED-SALARY.
           ELSE
                MULTIPLY BASE-SALARY BY 1.25
                GIVING COMPUTED-SALARY.
           SUBTRACT INPUT-HOURS-WORKED FROM COMPUTED-SALARY
           GIVING TOTAL-SALARY.
           GO TO PROCEDURE-DIVISION.
       END-OF-FILE.
      *Close input and output files
       CLOSE SAL-MASTER.
       CLOSE SAL-OUT.
       STOP RUN.