IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM1.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT INFILE ASSIGN TO 'INPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT OUTFILE ASSIGN TO 'OUTPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-RECORD.
           05 IN-NAME PIC A(20).
           05 IN-AGE PIC 99.
       FD OUTFILE.
       01 OUT-RECORD.
           05 OUT-NAME PIC X(20).
           05 OUT-AGE PIC X(3).

       WORKING-STORAGE SECTION.
       01 LINE-COUNTER PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
       OPEN INPUT INFILE
            OUTPUT OUTFILE
       PERFORM UNTIL EOF = 'Y'
            READ INFILE
               AT END
                    MOVE 'Y' TO EOF
               NOT AT END
                    ADD 1 TO LINE-COUNTER
                    IF LINE-COUNTER = 1
                        MOVE IN-NAME TO OUT-NAME
                        PERFORM VARYING I FROM 1 BY 1 UNTIL I = 20
                            IF OUT-NAME(I : 1) > ' '
                                CONTINUE
                            ELSE
                                MOVE ' ' TO OUT-NAME(I : 1)
                            END-IF
                        END-PERFORM
                        MOVE IN-AGE TO OUT-AGE
                    ELSE
                        MOVE IN-RECORD TO OUT-RECORD
                    END-IF
                    WRITE OUT-RECORD
            END-READ
       END-PERFORM
       CLOSE INFILE
            OUTFILE
       STOP RUN.