IDENTIFICATION DIVISION.
       PROGRAM-ID. GREETING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG PIC X(50).
       01 NAME PIC X(20).
       01 LENGTH PIC 9(2).
       PROCEDURE DIVISION.
       DISPLAY "Please enter your name: ".
       ACCEPT NAME.
       MOVE "Hello, " TO MSG.
       STRING MSG ERROR "Invalid input." DELIMITED BY SIZE
           WHEN NAME = "" OR NUMERIC(1:LENGTH OF NAME) > 0
           INTO MSG
           DISPLAY MSG
           GOBACK.
       MOVE NAME TO MSG(8:LENGTH OF NAME).
       DISPLAY MSG.
       STOP RUN.