IDENTIFICATION DIVISION.
       PROGRAM-ID. CODE-SNIPPET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMBERS PIC 9(5) VALUE 12345.
       01 TOTAL PIC 9(5).
       PROCEDURE DIVISION.
       PERFORM VARYING NUM-CTR FROM 1 BY 1
            UNTIL NUM-CTR > 5
           MULTIPLY NUM-CTR BY TOTAL GIVING TOTAL
       END-PERFORM.
       DISPLAY 'The total is: ' TOTAL.
       STOP RUN.