ID DIVISION.                                * division for identification
PROGRAM-ID.  SAMPLEPROGRAM.                 * program name
AUTHOR.  YOUR NAME HERE.                    * author's name
INSTALLATION. YOUR COMPANY NAME.            * installation
DATA DIVISION.                              * division for data
WORKING-STORAGE SECTION.                    * section for working variables
01 TEMP-VAR PIC 9(3)  VALUE ZERO.            * temporary variable with initial value of zero
LINKAGE SECTION.                            * section for external data
COPY "MYDATA.CBL".                          * copybook for external data variables
PROCEDURE DIVISION.                         * division for program logic
MAIN SECTION.                               * main section for program logic
PERFORM READ-FROM-FILE.                     * perform external file reading subroutine
PERFORM CALCULATE-AVG.                      * perform average calculation subroutine
PERFORM WRITE-TO-FILE.                      * perform external file writing subroutine
EXIT PROGRAM.                               * exit program
READ-FROM-FILE SECTION.                     * section for external file reading subroutine
OPEN INPUT MYFILE.                          * open external file for reading
READ MYFILE INTO MY-VARIABLES.              * read data from file into variables
CLOSE MYFILE.                               * close external file
CALCULATE-AVG SECTION.                      * section for average calculation subroutine
COMPUTE AVG-VAR = (VAR-1 + VAR-2 + VAR-3) / 3.  * calculate average of variables
WRITE-TO-FILE SECTION.                      * section for external file writing subroutine
OPEN OUTPUT MYFILE2.                        * open external file for writing
WRITE MY-VARIABLES AND AVG-VAR TO MYFILE2.  * write data and average to file
CLOSE MYFILE2.                              * close external file