IDENTIFICATION DIVISION.                                   * COBOL identification division
PROGRAM-ID. main.                                           * program identifier

DATA DIVISION.                                              * COBOL data division
WORKING-STORAGE SECTION.                                    * working storage section
01 NUM-INDICATORS PIC 9(5).                                 * numeric indicator variable
01 COUNT PIC 9(3) VALUE ZERO.                               * count variable with initial value 0

PROCEDURE DIVISION.                                         * COBOL procedure division
MAIN-PARA.                                                  * main paragraph
DISPLAY 'GENERATING 10 NUMBERS:'.                            * display message
PERFORM GENERATE-NUMBERS.                                   * perform generate numbers paragraph
DISPLAY 'THE SUM OF THE 10 NUMBERS IS: ' NUM-INDICATORS.     * display sum of numbers
STOP RUN.                                                   * stop program execution

GENERATE-NUMBERS.                                           * generate numbers paragraph
PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 10           * perform loop until count is greater than 10
  COMPUTE NUM-INDICATORS = NUM-INDICATORS + COUNT.           * add count to sum variable
END-PERFORM.                                                * end loop