IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE-1 ASSIGN TO 'input1.txt'.
SELECT OUT-FILE-1 ASSIGN TO 'output1.txt'.
DATA DIVISION.
FILE SECTION.
FD IN-FILE-1.
01 INPUT-RECORD.
05 COLUMN-1 PIC X(10).
05 COLUMN-2 PIC X(10).
05 COLUMN-3 PIC X(10).
FD OUT-FILE-1.
01 OUTPUT-RECORD.
05 TEMP-COLUMN-1 PIC X(10).
05 TEMP-COLUMN-2 PIC X(10) VALUE 'DEFAULT'.
05 TEMP-COLUMN-3 PIC X(10).
PROCEDURE DIVISION.
COPY MAGTSEL.
MOVE TEMP-COLUMN-1 TO COLUMN-1.
IF (COLUMN-2 = ' ') THEN
    MOVE TEMP-COLUMN-2 TO COLUMN-2.
ELSE
    MOVE COLUMN-2 TO TEMP-COLUMN-2.
END-IF.
MOVE TEMP-COLUMN-3 TO COLUMN-3.
DISPLAY 'PROCESSING INPUT RECORD: ' COLUMN-1.
COMPUTE COL3-RESULT = FUNCTION-TO-PROCESS-COLUMN-3(COLUMN-3).
MOVE COL3-RESULT TO TEMP-COLUMN-3.
WRITE OUTPUT-RECORD.