PROGRAM-ID. CODE-SNIPPET.              * program name
       DATE-WRITTEN. 01/01/2021.              * date written
       AUTHOR. YOUR-NAME.                     * author name
      *DATA DIVISION.                         * data division starts
       WORKING-STORAGE SECTION.               * working storage section for variables
       01  NUMBER-OF-ITERATIONS PIC 9(05).     * variable to store number of iterations
       01  COUNTER               PIC 9(02).     * counter variable
       PROCEDURE DIVISION.                    * procedure division starts
       MAIN-LOGIC.                            * main logic starts
           DISPLAY "Please enter the number of iterations:".
           ACCEPT NUMBER-OF-ITERATIONS.
           PERFORM VARYING COUNTER FROM 1 BY 1      * perform loop for number of iterations entered
                   UNTIL COUNTER > NUMBER-OF-ITERATIONS
               DISPLAY "Iteration count: " COUNTER   * display current iteration count
           END-PERFORM.
      *END-LOGIC.                            * end of main logic
       STOP RUN.                              * stop program execution
       END PROGRAM CODE-SNIPPET.              * end of program