Identification Division.
Program - ExampleProg1.
Author - David Smith.

Data Division.
Working-Storage Section.
01 InputValues.
  02 InputVal1 PIC 9(3).
  02 InputVal2 PIC 9(3).
  02 InputVal3 PIC 9(3).
01 OutputValues.
  02 OutputVal1 PIC 9(5).
  02 OutputVal2 PIC 9(5).
  02 OutputVal3 PIC 9(5).
  
Procedure Division.
Main-Procedure.
  Accept InputValues.
  Multiply InputVal1 by InputVal2 giving OutputVal1.
  Divide InputVal3 into OutputVal1 giving OutputVal1.
  Divide OutputVal2 by OutputVal1 giving OutputVal3.
  Display "The result is: " OutputVal3.
  Stop Run.
End Main-Procedure.