IDENTIFICATION DIVISION.
       PROGRAM-ID.complex.
       AUTHOR. John Doe.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER.
       IBM-370.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 temp1 PIC S9(3)V99.
       01 temp2 PIC S9(3)V99.
       01 result PIC S9(4)V99.
       PROCEDURE DIVISION.
       PERFORM multiply USING 10, 10
       DISPLAY "The result is: " result.
       STOP RUN.
       
       multiply.
       MULTIPLY temp1 BY temp2 GIVING result.
       EXIT.