IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATION-PROGRAM.
       DATA DIVISION.
       WORKING_STORAGE SECTION.
       01 NUM1 PIC 9(4) VALUE ZERO.
       01 NUM2 PIC 9(4) VALUE ZERO.
       01 RESULT PIC 9(4) VALUE ZERO.
       PROCEDURE DIVISION.
       ADD 100 TO NUM1.
       SUBTRACT 50 FROM NUM2.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.
       DISPLAY "The result of the calculation is: " RESULT.
       STOP RUN.