IDENTIFICATION DIVISION.
PROGRAM-ID. MyProgram.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 Num1 PIC 9(3).
01 Num2 PIC 9(3).
01 Sum PIC 9(3).
01 Diff PIC 9(3).
01 Multi PIC 9(6).
01 Div PIC 9(3)V99.
PROCEDURE DIVISION.
ADD Num1 TO Num2 GIVING Sum.
SUBTRACT Num2 FROM Num1 GIVING Diff.
MULTIPLY Num1 BY Num2 GIVING Multi.
DIVIDE Num1 INTO Num2 GIVING Div.
DISPLAY "The sum is: " Sum.
DISPLAY "The difference is: " Diff.
DISPLAY "The multiplication is: " Multi.
DISPLAY "The division is: " Div.
STOP RUN.