IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
AUTHOR. JOHN DOE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-DISPLAY PIC 9(6).
01 PRINT-MESSAGE PIC X(25) VALUE 'HELLO, WORLD!'.

PROCEDURE DIVISION.
DISPLAY 'THE NUMBER IS: ' NUM-DISPLAY.
DISPLAY PRINT-MESSAGE.
STOP RUN.