IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DEPT-TABLE.
           05 DEPT-CODE-BUFFER PIC X(3).
           05 DEPT-NAME-BUFFER PIC X(20).
       01 DEPT-BUFFER REDEFINES DEPT-TABLE.
           05 DEPT-CODE PIC X(3).
           05 DEPT-NAME PIC X(20).
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-NAME PIC X(20).
           05 EMPLOYEE-DEPT PIC 9(3).
       01 READER FILE SECTION.
       FD DEPT-FILE.
           01 DEPT-RECORD.
               05 DEPT-CODE-INPUT PIC X(3).
               05 DEPT-NAME-INPUT PIC X(20).
       01 EMPLOYEE-COUNT PIC 9(3) VALUE 0.
       01 OUTPUT-RECORD PIC X(80).
       01 EMPLOYEE-TABLE.
           05 EMPLOYEE-NAME-BUFFER PIC X(20).
           05 EMPLOYEE-DEPT-BUFFER PIC X(3).
           05 EMPLOYEE-DEPT-NAME-BUFFER PIC X(20).
       PROCEDURE DIVISION.
       100-MAIN PROCEDURE.
           PERFORM 200-OPEN-FILE.
           PERFORM 400-READ-FILE UNTIL DEPT-EOF = 'YES'.
           PERFORM 500-PRINT-REPORT.
           STOP RUN.
       200-OPEN-FILE.
           OPEN INPUT DEPT-FILE.
       400-READ-FILE.
           READ DEPT-FILE INTO DEPT-RECORD
               AT END MOVE 'YES' TO DEPT-EOF.
           IF DEPT-EOF = 'YES'
               CLOSE DEPT-FILE
           ELSE
               PERFORM 430-MATCH-DEPT.
       430-MATCH-DEPT.
           SEARCH DEPT-BUFFER
               AT END
                   PERFORM 450-ADD-EMPLOYEE
               WHEN DEPT-CODE-INPUT = DEPT-CODE
                   PERFORM 440-COPY-EMPLOYEE-INFO.
       440-COPY-EMPLOYEE-INFO.
           MOVE EMPLOYEE-NAME TO EMPLOYEE-NAME-BUFFER.
           MOVE EMPLOYEE-DEPT TO EMPLOYEE-DEPT-BUFFER.
           MOVE DEPT-NAME TO EMPLOYEE-DEPT-NAME-BUFFER.
           ADD 1 TO EMPLOYEE-COUNT.
       450-ADD-EMPLOYEE.
           MOVE EMPLOYEE-RECORD TO EMPLOYEE-TABLE(EMPLOYEE-COUNT).
       500-PRINT-REPORT.
           PERFORM 510-PRINT-HEADER.
           PERFORM 520-PRINT-DETAILS.
       510-PRINT-HEADER.
           MOVE 'EMPLOYEE NAME' TO OUTPUT-RECORD(1:20).
           MOVE 'DEPARTMENT CODE' TO OUTPUT-RECORD(21:20).
           MOVE 'DEPARTMENT NAME' TO OUTPUT-RECORD(41:20).
           DISPLAY OUTPUT-RECORD.
       520-PRINT-DETAILS.
           PERFORM VARYING I FROM 1 BY 1
               UNTIL I > EMPLOYEE-COUNT
               DISPLAY
                   EMPLOYEE-TABLE(I)(1:20)
                   EMPLOYEE-TABLE(I)(21:3)
                   EMPLOYEE-TABLE(I)(24:20).