IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. JOHN SMITH
       DATE-WRITTEN. 1/1/2021.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT HELLO-FILE ASSIGN TO 'HELLOWRLD.TXT'.
       DATA DIVISION.
       FILE SECTION.
       FD HELLO-FILE.
       01 MESSAGE PIC X(11) VALUE 'HELLO, WORLD'.
       WORKING-STORAGE SECTION.
       01 COUNT PIC 9(3) VALUE 0.
       01 LINE PIC X(80).
       PROCEDURE DIVISION.
           OPEN OUTPUT HELLO-FILE.
           PERFORM UNTIL COUNT = 10
               ADD 1 TO COUNT
               MOVE MESSAGE TO LINE
               WRITE LINE
           END-PERFORM.
           CLOSE HELLO-FILE.
           STOP RUN.