IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WELCOME-MESSAGE PIC X(20) VALUE "Hello, world!".
01 EXCLAMATION-MARK PIC X(1) VALUE "!".

PROCEDURE DIVISION.
DISPLAY WELCOME-MESSAGE.
DISPLAY EXCLAMATION-MARK.
STOP RUN.