PROGRAM-ID. READFILE.                         //Program name
      AUTHOR. YOUR-NAME.                            //Author name
      ENVIRONMENT DIVISION.

      INPUT-OUTPUT SECTION.                         //Declare input and
      FILE-CONTROL.                                  //output files
      SELECT INPUT-FILE ASSIGN TO "input.txt".       //Select input file
      SELECT OUTPUT-FILE ASSIGN TO "output.txt".     //Select output file
      SELECT ERROR-FILE ASSIGN TO "error.txt".       //Select error file

      DATA DIVISION.
      FILE SECTION.
      FD INPUT-FILE.                                 //Declare input file
      01 INPUT-RECORD.                               //Define input record
          05 ID-NUMBER        PIC 9(6).              //ID number field
          05 NAME             PIC X(30).             //Name field
          05 QUANTITY         PIC 9(3).              //Quantity field
          05 PRICE            PIC 9(6)V99.           //Price field

      FD OUTPUT-FILE.                                //Declare output file
      01 OUTPUT-RECORD                                //Define output record
          05 ID-NUMBER        PIC 9(6).              //ID number field
          05 NAME             PIC X(30).             //Name field
          05 TOTAL-PRICE      PIC 9(8)V99.           //Total price field

      FD ERROR-FILE.                                 //Declare error file
      01 ERROR-RECORD.                               //Define error record
          05 ERROR-MSG        PIC X(50).             //Error message field

      WORKING-STORAGE SECTION.
      01 END-OF-FILE       PIC X VALUE 'N'.           //Flag for end of file
      01 TOTAL-PRICE       PIC 9(8)V99 VALUE 0.       //Variable to hold total price

      PROCEDURE DIVISION.
      100-MAIN.
           OPEN INPUT INPUT-FILE                     //Open input file
           OPEN OUTPUT OUTPUT-FILE                   //Open output file
           OPEN OUTPUT ERROR-FILE                    //Open error file

           PERFORM UNTIL END-OF-FILE = 'Y'.           //Loop until EOF flag is 'Y'
                READ INPUT-FILE
                     AT END                             //Check for end of file
                          MOVE 'Y' TO END-OF-FILE         //If end of file, set flag to 'Y'
                     NOT AT END                         //If not end of file
                          ADD QUANTITY TO TOTAL-PRICE    //Add quantity to total price
                          COMPUTE TOTAL-PRICE = QUANTITY * PRICE //Calculate total price
                          MOVE ID-NUMBER TO OUTPUT-RECORD.ID-NUMBER //Copy ID number to output record
                          MOVE NAME TO OUTPUT-RECORD.NAME //Copy name to output record
                          MOVE TOTAL-PRICE TO OUTPUT-RECORD.TOTAL-PRICE //Copy total price to output record
                          WRITE OUTPUT-RECORD //Write output record to file
                END-READ.

           CLOSE INPUT-FILE                           //Close input file
           CLOSE OUTPUT-FILE                          //Close output file
           CLOSE ERROR-FILE                           //Close error file

           STOP RUN.                                   //End program