000100 IDENTIFICATION DIVISION.                 // start of identification division
000200 PROGRAM-ID. MY-PROGRAM.                  // declare program name
000300 DATA DIVISION.                           // start of data division
000400 WORKING-STORAGE SECTION.                 // working storage section
000500 01 NUM1 PIC 9(3).                         // declare NUM1 as alphanumeric with length 3
000600 01 NUM2 PIC 9(3).                         // declare NUM2 as alphanumeric with length 3
000700 01 RESULT PIC 9(4).                       // declare RESULT as alphanumeric with length 4
000800 PROCEDURE DIVISION.                      // start of procedure division
000900     DISPLAY "Please enter a number:".     // display message to user
001000     ACCEPT NUM1.                          // accept input from user and save in NUM1
001100     DISPLAY "Please enter another number:".
001200     ACCEPT NUM2.
001300     COMPUTE RESULT = NUM1 + NUM2.         // perform addition and save result in RESULT
001400     DISPLAY "The result is " RESULT.      // display result to user
001500     STOP RUN.                             // end program execution