Identification division.
 Program-id. FIB-SERIES.
 Data division.
 Working-storage section.
  01 VAR-NUM PIC 9(4).
  01 SERIES-TABLE.
    05 TABLE-ENTRY OCCURS 21 TIMES
       INDEXED BY TAB-INDEX PIC 9(5).
    10 FIB-NUM PIC 9(10).
 Procedure division.
 Begin.
   DISPLAY "Enter the number of terms wanted."
   ACCEPT VAR-NUM.
   IF VAR-NUM NOT LESS THAN 21
      ADD 1 TO VAR-NUM
   END-IF.
   INITIALIZE SERIES-TABLE.
   SET FIB-NUM TO 0.
   SET TAB-INDEX TO 1.
   PERFORM VARYING TAB-INDEX FROM 2 BY 1 UNTIL
        TAB-INDEX GREATER THAN VAR-NUM
      ADD SERIES-TABLE (TAB-INDEX - 1) TO SERIES-TABLE (TAB-INDEX)
   END-PERFORM.
   DISPLAY "The Fibonacci series is:". 
   PERFORM VARYING TAB-INDEX FROM 1 BY 1 UNTIL
      TAB-INDEX GREATER THAN VAR-NUM
      DISPLAY SERIES-TABLE (TAB-INDEX).
   END-PERFORM.
   STOP RUN.