IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3)V99.
       01 NUM2 PIC 9999.
       01 RESULT PIC S9999.99.
       PROCEDURE DIVISION.
       DISPLAY "Enter first number:".
       ACCEPT NUM1.
       DISPLAY "Enter second number:".
       ACCEPT NUM2.
       COMPUTE RESULT = NUM1 + NUM2.
       DISPLAY "The result of addition is: " RESULT.
       STOP RUN.