IDENTIFICATION DIVISION.
PROGRAM-ID. TestProgram.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 Input-String            PIC X(50) VALUE "This is a test string".
77 Output-String           PIC X(50) VALUE SPACE.
PROCEDURE DIVISION.
MOVE SPACE TO Output-String.
PERFORM VARYING i FROM 1 BY 1 UNTIL i > LENGTH OF Input-String
    DISPLAY "Current character: "  Input-String(i:i)
    EVALUATE TRUE
        WHEN Input-String(i:i) = "T"
            MOVE "t" TO Output-String(i)
        WHEN Input-String(i:i) = "h"
            MOVE "h" TO Output-String(i)
        WHEN Input-String(i:i) = "i"
            MOVE " !" TO Output-String(i:i+1)
        WHEN Input-String(i:i) = "s"
            MOVE "z" TO Output-String(i)
    END-EVALUATE
END-PERFORM.
DISPLAY "Modified string: " Output-String.
STOP RUN.