000100 IDENTIFICATION DIVISION.
* This is the program identification division.
000200 PROGRAM-ID. COBOL-PROGRAM.
* This is the program ID which will be used to execute the program.
000300 AUTHOR. YOUR-NAME
* Enter your name as the author of the program.
000400 DATE-WRITTEN. 10/10/2021
* Enter the date the program was written.
000500 ENVIRONMENT DIVISION.
* The environment division specifies the environment in which the program will run.
000600 CONFIGURATION SECTION.
* This section is used to specify any hardware or software configurations necessary for the program.
000700 SOURCE-COMPUTER. IBM-MAINFRAME.
* This statement specifies the type of computer on which the program will execute.
000800 OBJECT-COMPUTER. IBM-MAINFRAME.
* This statement specifies the type of computer on which the program will generate object code.
000900 DATA DIVISION.
* The data division contains declarations of data items used in the program.
001000 FILE SECTION.
* This section is used to specify the logical structure and characteristics of files used in the program.
001100 WORKING-STORAGE SECTION.
* This section holds variables used for temporary storage during the execution of the program.
001200 01 NUM1 PIC 9(5).
* This declares a numeric variable with a length of 5 digits.
001300 01 NUM2 PIC 9(5).
* This declares a second numeric variable with a length of 5 digits.
001400 01 RESULT PIC 9(6).
* This declares a third numeric variable with a length of 6 digits to hold the result.
001500 PROCEDURE DIVISION.
* The procedure division contains the instructions for the execution of the program.
001600 ADD NUM1 TO NUM2 GIVING RESULT.
* This statement adds the values of the two variables and stores the result in the third variable.
001700 DISPLAY "The result is: " RESULT.
* This statement displays the result to the user.
001800 STOP RUN.
* This statement ends the execution of the program.