IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATOR.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 A-PAR TYPE COMP-3.
         05 A PIC S9(4)V99 VALUE 100.25.
      01 B-PAR TYPE COMP-3.
         05 B PIC S9(4)V99 VALUE 75.50.
      01 C-PAR TYPE COMP-3.
         05 C PIC S9(4)V99.
      PROCEDURE DIVISION.
      ADD A-PAR, B-PAR GIVING C-PAR.
      DISPLAY "Sum of A and B is: " C-PAR.
      END PROGRAM CALCULATOR.