IDENTIFICATION DIVISION.                            *Specifies the name and information of the program.
       PROGRAM-ID. CALCULATOR.                      *Specifies the name of the program as 'CALCULATOR'.

       DATA DIVISION.                               *Specifies the data used in the program.
       WORKING-STORAGE SECTION.                     *Specifies a section for working storage.
       01 FIRST-NUMBER PIC 9(2) VALUE 10.           *Defines a variable for the first number with max size of 2 digits and initial value of 10.
       01 SECOND-NUMBER PIC 9(2) VALUE 5.            *Defines a variable for the second number with max size of 2 digits and initial value of 5.
       01 RESULT PIC 9(3).                          *Defines a variable for the result with max size of 3 digits.

       PROCEDURE DIVISION.                          *Specifies the procedures of the program.
       MAIN-PROCEDURE.                              *Specifies the main procedure.

           DISPLAY 'Welcome to the Calculator!'     *Displays a welcome message to the user.

           ADD FIRST-NUMBER TO SECOND-NUMBER        *Adds the first and second number and stores the result in the RESULT variable.
           DISPLAY 'The result is ' RESULT          *Displays the result to the user.

           STOP RUN.                                *Ends the program.

       END PROGRAM CALCULATOR.                      *Ends the program.