IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMBER1         PIC 9(5)        VALUE +20000.
       01  NUMBER2         PIC 9(5)        VALUE -10000.
       01  RESULT          PIC 9(5).
       01  OPERATOR        PIC X(1)        VALUE '*'.

       PROCEDURE DIVISION.
       MAIN-LOGIC.

           COMPUTE RESULT = NUMBER1 OPERATOR NUMBER2.
           DISPLAY 'The result is: ' RESULT.

           STOP RUN.