ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-360.
       OBJECT-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
        SELECT EMPLOYEE-FILE ASSIGN TO 'EMPLOYEES.DAT'
        ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
        FD  EMPLOYEE-FILE.
        01  EMPLOYEE-RECORD.
            05  EMPLOYEE-ID      PIC X(10).
            05  EMPLOYEE-NAME    PIC X(30).
            05  EMPLOYEE-AGE     PIC 99.
            05  EMPLOYEE-SALARY  PIC 9(5)V99.
            05  EMPLOYEE-DEPT    PIC X(10).

       WORKING-STORAGE SECTION.
        01 PRINTLINE-X.
         05 POSTION-1 PIC X(10) VALUE SPACES.
         05 POSTION-2 PIC X(30) VALUE SPACES.
         05 POSTION-3 PIC XX VALUE ZEROS.
         05 POSTION-4 PIC $99.99 VALUE ZEROS.
         05 POSTION-5 PIC X(10) VALUE SPACES.

       PROCEDURE DIVISION.
       100-MAIN.
        OPEN INPUT EMPLOYEE-FILE.
        READ EMPLOYEE-FILE
        PERFORM UNTIL EMPLOYEE-RECORD =EOF
         MOVE EMPLOYEE-ID TO POSTION-1
         MOVE EMPLOYEE-NAME TO POSTION-2
         MOVE EMPLOYEE-AGE TO POSTION-3
         MOVE EMPLOYEE-SALARY TO POSTION-4
         MOVE EMPLOYEE-DEPT TO POSTION-5
        END-READ
        DISPLAY PRINTLINE-X
        READ EMPLOYEE-FILE
       END-PERFORM
       CLOSE EMPLOYEE-FILE.
       STOP RUN.