*DECIMAL to BINARY conversion in COBOL
01 number PIC 9(5)  VALUE 12345.    *sample number
01 binary-value PIC 9(16) BINARY.  *stores converted binary value
01 counter       PIC 99         VALUE 1.  *used for iteration of loop
01 divisor       PIC S9(16) BINARY VALUE 50000.  *divisor for conversion

*loop to perform repeated division
PERFORM VARYING counter FROM 1 BY 1 UNTIL counter > 16

    DIVIDE number BY divisor GIVING number REMAINDER binary-value.
    MOVE binary-value TO binary-table(counter).  *stores remainder in binary table
    MULTIPLY divisor BY 2.      *increase divisor for next iteration

END-PERFORM.

DISPLAY "The binary value is " binary-value."

*sample output: