IDENTIFICATION DIVISION. 									 // start of identification division
PROGRAM-ID. employee_program. 									// program name
AUTHOR. Jane Smith.			 								// author name

DATA DIVISION.													// start of data division
WORKING-STORAGE SECTION.										// declarations for local variables
01 employee RECORD. 											// employee record 
   05 employee-id 		PIC X(6).								// employee id as string
   05 first-name 		PIC X(20).								// employee first name as string
   05 last-name 		PIC X(20).								// employee last name as string
   05 department		PIC 9(2).								// employee department as number
   05 salary			PIC 9(6)V99.							// employee salary as numeric with decimals
   
PROCEDURE DIVISION.												// start of procedure division
MAIN-PROGRAM.													// main program to perform operations
   DISPLAY "Enter employee id:".								// prompt for employee id
   ACCEPT employee-id.											// input employee id
   DISPLAY "Enter first name:".									// prompt for first name
   ACCEPT first-name.											// input first name
   DISPLAY "Enter last name:".									// prompt for last name
   ACCEPT last-name.											// input last name
   DISPLAY "Enter department number:".							// prompt for department
   ACCEPT department.											// input department
   DISPLAY "Enter salary:".										// prompt for salary
   ACCEPT salary.												// input salary
   PERFORM CALCULATE-TAXES.										// perform tax calculation with subprogram
   
CALCULATE-TAXES.													// subprogram to calculate taxes
   MULTIPLY salary BY 0.2 GIVING tax.							// calculate 20% tax
   DISPLAY "Employee name:".									// display employee name
   DISPLAY first-name SPACE last-name							// concatenate first and last name
   DISPLAY "Department:".										// display department
   DISPLAY department.											// display department number
   DISPLAY "Taxes:".											// display taxes
   DISPLAY tax.													// display calculated taxes
   
STOP RUN.														// terminate program