Identification Division.|                        //This line identifies the division of the program
Program-ID. ExampleProgram.|                      //This is the program identification name
Author. John Doe.|                                //This is the name of the author

Environment Division.|                            //This division declares the environment specifics
Input-Output Section.|                            //This section declares the input output files used by the program
File-Control.|                                    //This is used to specify the properties of the input-output files
    Select InputFile Assign to 'input.txt'.|       //This line selects the input file and assigns it a name
    Select OutputFile Assign to 'output.txt'.|     //This line selects the output file and assigns it a name

Data Division.|                                   //This division declares the data used by the program
Working-Storage Section.|                         //This section declares the working variables used by the program
01 InputVariable Pic X(50).|                       //This line declares a variable to hold input data of length 50
01 OutputVariable Pic X(30).|                      //This line declares a variable to hold output data of length 30

Procedure Division.|                              //This division contains the logic of the program
Display "Welcome to Example Program".|            //This line displays a message on the screen
Open InputFile.|                                  //This line opens the input file
Read InputFile into InputVariable.|               //This line reads the input file and stores the data in the variable
Perform process-data until InputVariable = 'EOF'.| //This line executes a loop until the end of file is reached
    Move InputVariable(1:30) to OutputVariable.|  //This line moves the first 30 characters of input data to output data
    Write OutputVariable.|                        //This line writes the output data to the output file
End-Perform.|                                     //This line marks the end of the loop
Close InputFile.|                                 //This line closes the input file
Close OutputFile.|                                //This line closes the output file
Display "Data processing completed".|             //This line displays a message on the screen

Stop Run.|                                        //This line marks the end of the program