CONFIGURATION SECTION.
      SOURCE-COMPUTER. MY-COMPUTER.
      OBJECT-COMPUTER. MY-COMPUTER.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT EMPLOYEE-FILE ASSIGN TO 'EMPLOYEE.DAT'
      ORGANIZATION IS SEQUENTIAL.
      DATA DIVISION.
      FILE SECTION.
      FD EMPLOYEE-FILE.
      01 EMPLOYEE-RECORD.
         05 EMPLOYEE-ID PIC 9(5).
         05 EMPLOYEE-NAME PIC X(20).
         05 EMPLOYEE-DEPARTMENT PIC X(10).
         05 EMPLOYEE-SALARY PIC 9(6)V99.
      WORKING-STORAGE SECTION.
      01 TOTAL-SALARY PIC 9(6)V99 VALUE ZERO.
      PROCEDURE DIVISION.
          OPEN INPUT EMPLOYEE-FILE
          PERFORM READ-EMPLOYEE UNTIL EMPLOYEE-ID = 0
          DISPLAY 'The total salary is: ' TOTAL-SALARY
          CLOSE EMPLOYEE-FILE.
      READ-EMPLOYEE.
          READ EMPLOYEE-FILE
             AT END
               MOVE 1 TO EMPLOYEE-ID
               CONTINUE
             NOT AT END
               ADD EMPLOYEE-SALARY TO TOTAL-SALARY
               END-READ.