IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-SALARY-REPORT.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SALARY-FILE ASSIGN TO DISK 
            ORGANIZATION IS SEQUENTIAL.
       SELECT REPORT-FILE ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       
       FD SALARY-FILE
          RECORDING MODE IS F.
       01 SALARY-RECORD.    
          05 NAME         PIC X(20).
          05 MONTH        PIC XX.
          05 SALARY       PIC 9(6)V99.

       FD REPORT-FILE
          RECORDING MODE IS F.
       01 REPORT-RECORD.   
          05 NAME         PIC X(20).
          05 DEPARTMENT   PIC X(15).
          05 TOTAL-SALARY PIC 9(8)V99.

       WORKING-STORAGE SECTION.
       01 MONTH-TABLE.
          05 MONTH-TOTAL OCCURS 12 TIMES.
             10 TOTAL-SALARY-AMT PIC 9(8)V99.
       
       PROCEDURE DIVISION.

       MAIN-PROCEDURE.
           OPEN INPUT SALARY-FILE.
           PERFORM GENERATE-REPORT
           CLOSE SALARY-FILE.
           PERFORM WRITE-REPORT
           CLOSE REPORT-FILE.
           STOP RUN.

       GENERATE-REPORT.
           PERFORM VARYING MONTH-COUNTER FROM 1 BY 1 UNTIL MONTH-COUNTER > 12
               INITIALIZE MONTH-TOTAL(MONTH-COUNTER)
           END-PERFORM.
           PERFORM UNTIL SALARY-RECORD NOT = FILE STATUS = 10
               MOVE SALARY TO MONTH-TOTAL(MONTH)
               READ SALARY-FILE NEXT RECORD INTO SALARY-RECORD
           END-PERFORM.

       WRITE-REPORT.
           INITIALIZE TOTAL-SALARY.
           PERFORM VARYING MONTH-COUNTER FROM 1 BY 1 UNTIL MONTH-COUNTER > 12
               ADD MONTH-TOTAL(MONTH-COUNTER) TO TOTAL-SALARY
               MOVE NAME TO NAME-REPORT
               MOVE MONTH-COUNTER TO MONTH-REPORT
               MOVE TOTAL-SALARY TO TOTAL-SALARY
               WRITE REPORT-RECORD
           END-PERFORM.
           END PROGRAM GENERATE-SALARY-REPORT.