IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
 
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(10) VALUE "WORLD".
 
PROCEDURE DIVISION.
SAY "HELLO " NAME "!".
STOP RUN.