000100 IDENTIFICATION DIVISION. * This is the identification division
000200 PROGRAM-ID. LONG-COMPLEX-SNIPPET. * This is the program's identification
000300 ENVIRONMENT DIVISION. * This is the environment division
000400 CONFIGURATION SECTION. * This is the configuration section
000500 SOURCE-COMPUTER. IBM-MAINFRAME. * This specifies the source computer
000600 OBJECT-COMPUTER. IBM-MAINFRAME. * This specifies the object computer
000700 DATA DIVISION. * This is the data division
000800 FILE SECTION. * This is the file section
000900 FD INPUT-FILE. * This is the input file description
001000 01 INPUT-RECORD. * This is the input record description
001100 02 IN-NAME PIC X(20). * This is the input name field
001200 02 IN-AGE PIC 99. * This is the input age field
001300 WORKING-STORAGE SECTION. * This is the working storage section
001400 01 COUNTER PIC 99 VALUE 1. * This is a counter variable with initial value of 1
001500 PROCEDURE DIVISION. * This is the procedure division
001600 000-MAIN. * This is the main procedure
001700 OPEN INPUT INPUT-FILE. * Opens the input file for reading
001800 READ INPUT-FILE INTO INPUT-RECORD. * Reads a record from the input file into the input record
001900 PERFORM UNTIL IN-AGE = 'ZZ'. * Loops until the input age is 'ZZ'
002000 IF IN-AGE = '21'. * Checks if the input age is '21'
002100 DISPLAY 'Name: ' IN-NAME. * Displays the input name
002200 END-IF. * End If statement
002300 ADD 1 TO COUNTER. * Increments the counter by 1
002400 READ INPUT-FILE INTO INPUT-RECORD. * Reads the next record
002500 END-PERFORM. * End perform loop
002600 CLOSE INPUT-FILE. * Closes the input file
002700 STOP RUN. * Ends the program