IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATE-AVERAGE.
      AUTHOR. JOHN SMITH.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT IN-FILE ASSIGN TO "INPUTFILE.TXT" ORGANIZATION IS LINE SEQUENTIAL.
          SELECT OUT-FILE ASSIGN TO "OUTPUTFILE.TXT" ORGANIZATION IS LINE SEQUENTIAL.

      DATA DIVISION.
      FILE SECTION.
      FD IN-FILE.
      01 IN-RECORD.
          05 IN-VALUE PIC 9(3).

      FD OUT-FILE.
      01 OUT-RECORD.
          05 OUT-LINE PIC X(80).

      WORKING-STORAGE SECTION.
      01 TOTAL-VALUE PIC 9(5)V99 VALUE 0.
      01 RECORD-COUNT PIC 9(3) VALUE 0.
      01 AVERAGE PIC 9(5)V99.
      01 EOF-SWITCH PIC X(3) VALUE "NO ".

      PROCEDURE DIVISION.
      100-MAIN.
          OPEN INPUT IN-FILE
              OUTPUT OUT-FILE.
          PERFORM UNTIL EOF-SWITCH = "YES"
              READ IN-FILE
                  AT END
                      MOVE "YES" TO EOF-SWITCH
                  NOT AT END
                      ADD IN-VALUE TO TOTAL-VALUE
                      ADD 1 TO RECORD-COUNT
              END-READ
          END-PERFORM.

          COMPUTE AVERAGE ROUNDED = TOTAL-VALUE / RECORD-COUNT.

          STRING "The average value is " AVERAGE DELIMITED BY SIZE INTO OUT-LINE.
          WRITE OUT-LINE.

          CLOSE IN-FILE
                OUT-FILE.
          STOP RUN.