IDENTIFICATION DIVISION.
PROGRAM-ID. ADDITION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-1  PIC 9(3).
01 NUM-2  PIC 9(3).
01 RESULT PIC 9(4).
PROCEDURE DIVISION.
MAIN-SECTION.
   DISPLAY "Please enter the first number: ".
   ACCEPT NUM-1.
   DISPLAY "Please enter the second number: ".
   ACCEPT NUM-2.
   IF NUM-1 IS NUMERIC AND NUM-2 IS NUMERIC
        ADD NUM-1 TO NUM-2 GIVING RESULT
   ELSE
        DISPLAY "Invalid input. Please enter numeric values only.".
   END-IF.
   DISPLAY "The sum of " NUM-1 " and " NUM-2 " is " RESULT.
   STOP RUN.