IDENTIFICATION DIVISION.
       PROGRAM-ID. SALARY-CALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMP-INFO.
          05 EMPLOYEE-NAME     PIC X(30).
          05 EMPLOYEE-AGE      PIC 99.
          05 EMPLOYEE-SALARY   PIC 9(7)V99.
          05 BONUS-RATE        PIC 9V99.
          
       01 CALCULATION.
          05 TOTAL-SALARY      PIC 9(7)V99.
          
       PROCEDURE DIVISION.
       DISPLAY 'Enter employee name: '.
       ACCEPT EMPLOYEE-NAME.
       DISPLAY 'Enter employee age: '.
       ACCEPT EMPLOYEE-AGE.
       DISPLAY 'Enter employee salary: '.
       ACCEPT EMPLOYEE-SALARY.
       DISPLAY 'Enter bonus rate (e.g. 1.5 for 1.5%): '.
       ACCEPT BONUS-RATE.
       
       MULTIPLY EMPLOYEE-SALARY BY BONUS-RATE GIVING CALCULATION-TOTAL-SALARY.
       
       DISPLAY 'Employee name: ' EMPLOYEE-NAME.
       DISPLAY 'Employee age: ' EMPLOYEE-AGE.
       DISPLAY 'Total salary: ' TOTAL-SALARY.
       
       STOP RUN.