IDENTIFICATION DIVISION.
   PROGRAM-ID. COBPROG.
   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 VAR1 PIC 9(4) VALUE 1234.
   01 VAR2 PIC X(20) VALUE "HELLO, WORLD!".
   PROCEDURE DIVISION.
   DISPLAY "VAR1: " VAR1.
   DISPLAY "VAR2: " VAR2.
   DISPLAY "SUM: " VAR1 + VAR2.
   STOP RUN.