IDENTIFICATION DIVISION.                           * identifies the program
PROGRAM-ID. MY-COMP-PROGRAM.                        * sets the program name
DATA DIVISION.                                     * declares data section
WORKING-STORAGE SECTION.                           * defines working storage section
77 AIRPORT-CODE PIC X(3).                           * declares variable for airport code

PROCEDURE DIVISION.                                * declares procedure division
MAIN-ROUTINE.                                      * sets main routine name
DISPLAY "Enter airport code:".                      * displays message
ACCEPT AIRPORT-CODE.                                * accepts user input for airport code
MOVE AIRPORT-CODE TO AIRPORT-CODE-TEMP.             * moves value to temporary variable
PERFORM CHECK-AIRPORTCODE UNTIL AIRPORT-CODE-VALID  * performs check until valid code is entered
IF AIRPORT-CODE-VALID = 'YES'                       * checks if code is valid
   DISPLAY "Code accepted!"                         * displays success message
ELSE                                                * if code is not valid
   DISPLAY "Code not recognized, please try again." * displays error message
END-IF.                                             * ends IF statement

CHECK-AIRPORTCODE.                                  * sets check airport code routine
EVALUATE TRUE                                       * evaluates the following conditions:
   WHEN AIRPORT-CODE-TEMP = 'LAX'                   * if code is LAX
      SET AIRPORT-CODE-VALID TO 'YES'               * sets flag to indicate code is valid
   WHEN AIRPORT-CODE-TEMP = 'JFK'                   * if code is JFK
      SET AIRPORT-CODE-VALID TO 'YES'               * sets flag to indicate code is valid
   WHEN AIRPORT-CODE-TEMP = 'ORD'                   * if code is ORD
      SET AIRPORT-CODE-VALID TO 'YES'               * sets flag to indicate code is valid
   WHEN OTHER                                       * if code is not LAX, JFK, or ORD
      SET AIRPORT-CODE-VALID TO 'NO'                * sets flag to indicate code is not valid
END-EVALUATE.                                       * ends EVALUATE statement

STOP RUN.                                           * stops the program