IDENTIFICATION DIVISION.             * Start of program identification division
PROGRAM-ID. SAMPLE.                  * Program name is SAMPLE
AUTHOR. NAME.                        * Author of the program
DATA DIVISION.                       * Start of data division
WORKING-STORAGE SECTION.             * Start of working storage section
01 NUM1        PIC 9(10).             * Declare variable NUM1 as 10-digit numeric
01 NUM2        PIC 9(10).             * Declare variable NUM2 as 10-digit numeric
01 RESULT      PIC 9(10).             * Declare variable RESULT as 10-digit numeric
01 TEMP        PIC 9(10).             * Declare variable TEMP as 10-digit numeric
01 COUNTER     PIC 99.                * Declare variable COUNTER as 2-digit numeric
PROCEDURE DIVISION.                   * Start of procedure division
MAIN-PROCEDURE.                       * Main procedure
    DISPLAY "Please enter the first number: ".  * Prompt user to input first number
    ACCEPT NUM1.                               * Retrieve input and assign to NUM1 variable
    DISPLAY "Please enter the second number: ". * Prompt user to input second number
    ACCEPT NUM2.                               * Retrieve input and assign to NUM2 variable
    MOVE NUM1 TO RESULT.                        * Move NUM1 variable to RESULT variable                         * Loop to multiply NUM1 and NUM2
    PERFORM MULTIPLY-LOOP VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER > NUM2.
    DISPLAY "The result of " NUM1 " multiplied by " NUM2 " is: " RESULT.
    STOP.                                       * End program execution
MULTIPLY-LOOP.                          * Subroutine to multiply two numbers
    MULTIPLY RESULT BY NUM1 GIVING TEMP. * Multiply RESULT and NUM1 and assign to TEMP
    MOVE TEMP TO RESULT.                 * Move TEMP to RESULT to update RESULT variable
END PROGRAM SAMPLE.                     * End of program SAMPLE