IDENTIFICATION DIVISION.                               *Start of Program Identification Division
PROGRAM-ID. NEW-PROGRAM.                                *Name of the program
ENVIRONMENT DIVISION.                                   *Start of Environment Division
CONFIGURATION SECTION.                                  *Start of Configuration Section
SOURCE-COMPUTER. IBM-PC.                                *Specifies the type of computer to be used
OBJECT-COMPUTER. IBM-PC.                                *Specifies the type of computer used to run the program
DATA DIVISION.                                          *Start of Data Division
FILE SECTION.                                           *Start of File Section
FD CUSTOMERS.                                           *File Description for Customers file
01 CUSTOMER-RECORD.                                     *Define record structure for Customers file
   05 CUST-NO        PIC 9(5).                          *Contains customer number
   05 CUST-NAME      PIC X(25).                         *Contains customer name
   05 CUST-ADDRESS   PIC X(50).                         *Contains customer address
   05 CUST-REGION    PIC X(2).                          *Contains customer region
WORKING-STORAGE SECTION.                                *Start of Working-Storage Section
01 WS-COUNTERS.                                         *Define counters for processing
   05 NUM-CUSTOMERS PIC 9(5) VALUE ZERO.                *Contains total number of customers
   05 I             PIC 9(5) VALUE 1.                   *Contains loop counter for processing
PROCEDURE DIVISION.                                     *Start of Procedure Division
MAIN-LOGIC SECTION.                                     *Start of Main Logic Section
   OPEN INPUT CUSTOMERS.                                *Opens Customers file for input
   READ CUSTOMERS                                       *Reads first record from Customers file
       AT END                                           *Executes if end of file is reached
       MOVE NUM-CUSTOMERS TO I.                         *Moves total number of customers to loop counter
       PERFORM END-OF-FILE-LOGIC                       *Executes end-of-file logic
       GO TO END-MAIN.                              *Jumps to end of program
   END-READ.
   PERFORM PROCESS-CUSTOMER UNTIL I > NUM-CUSTOMERS.  *Loops until all customers are processed
   CLOSE CUSTOMERS.                                 *Closes Customers file
END-MAIN-LOGIC SECTION.                             *End of Main Logic Section
   STOP RUN.                                        *Stops execution of program
END-OF-FILE-LOGIC SECTION.                          *Start of End-of-file Logic Section
   DISPLAY "End of file reached.".                  *Displays message to user
   GO TO END-MAIN.                                  *Jumps to end of program
PROCESS-CUSTOMER SECTION.                           *Start of Process Customer Section
   DISPLAY "Customer Number: " CUST-NO.              *Displays customer number
   DISPLAY "Customer Name: " CUST-NAME.              *Displays customer name
   DISPLAY "Customer Address: " CUST-ADDRESS.        *Displays customer address
   DISPLAY "Customer Region: " CUST-REGION.          *Displays customer region
   ADD 1 TO I.                                       *Increments loop counter
   READ CUSTOMERS                                    *Reads next record from Customers file
   END-READ.
END-PROCESS-CUSTOMER SECTION.                        *End of Process Customer Section