IDENTIFICATION DIVISION.
PROGRAM-ID. INPUT-FILE.

 DATA DIVISION.
FILE SECTION.
FD MY-FILE.
01 MY-RECORD.
   05 NAME PIC A(20).
   05 ID-NUM PIC 9(9).
   05 GRADE PIC 99.
   05 MAJOR PIC A(10).

WORKING-STORAGE SECTION.
01 TOTAL-COUNT PIC 9(5).
01 TOTAL-MAJOR-COUNT PIC 9(5).
01 TOTAL-GRADE-COUNT PIC 9(5).

PROCEDURE DIVISION.

OPEN INPUT MY-FILE.

PERFORM UNTIL EOF
READ MY-FILE INTO MY-RECORD
IF MAJOR = 'COMPUTERSCIENCE'
    ADD 1 TO TOTAL-MAJOR-COUNT
END-IF
ADD GRADE TO TOTAL-GRADE-COUNT
ADD 1 TO TOTAL-COUNT
END-PERFORM.

CLOSE MY-FILE.

DISPLAY 'Total number of records: ' TOTAL-COUNT
DISPLAY 'Total number of computer science majors: ' TOTAL-MAJOR-COUNT
DISPLAY 'Average grade: ' TOTAL-GRADE-COUNT / TOTAL-COUNT

STOP RUN.