IDENTIFICATION DIVISION.
PROGRAM-ID.  MYPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 EMPLOYEE-RECORD.
   05 EMPLOYEE-ID             PIC X(10).
   05 EMPLOYEE-NAME           PIC X(20).
   05 EMPLOYEE-AGE            PIC 9(3).
   05 EMPLOYEE-SALARY         PIC 9(9)V99.
   05 EMPLOYEE-DEPARTMENT.
      10 DEPT-ID              PIC X(10).
      10 DEPT-NAME            PIC X(20).
01 TOTAL-SALARY               PIC 9(9)V99.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
   PERFORM UNTIL EMPLOYEE-ID = '0000000000'
      DISPLAY 'Enter employee ID:'
      ACCEPT EMPLOYEE-ID
      DISPLAY 'Enter employee name:'
      ACCEPT EMPLOYEE-NAME
      DISPLAY 'Enter employee age:'
      ACCEPT EMPLOYEE-AGE
      DISPLAY 'Enter employee salary:'
      ACCEPT EMPLOYEE-SALARY
      DISPLAY 'Enter employee department ID:'
      ACCEPT DEPT-ID
      DISPLAY 'Enter employee department name:'
      ACCEPT DEPT-NAME
      COMPUTE TOTAL-SALARY = TOTAL-SALARY + EMPLOYEE-SALARY
   END-PERFORM.
   DISPLAY 'Total salary: ' TOTAL-SALARY.
STOP RUN.