IDENTIFICATION DIVISION.                             // This is the identification division
       PROGRAM-ID. HELLO-WORLD.                              // This is the program name
       AUTHOR. John Smith.                                   // Author of the program
       DATE-WRITTEN. 10/03/2021.                             // Date the program was written
 
       ENVIRONMENT DIVISION.                                 // This is the environment division
       INPUT-OUTPUT SECTION.                                 // Section for input and output
 
       DATA DIVISION.                                        // This is the data division
       WORKING-STORAGE SECTION.                              // Section for variables declared during execution
       01 MESSAGE PIC X(20) VALUE "Hello, World!".            // Variable to store the message
 
       PROCEDURE DIVISION.                                   // This is the procedure division
       DISPLAY MESSAGE.                                      // Display the message on the screen
       STOP RUN.                                             // End the program
       
       /* Output:
       Hello, World!
       */