IDENTIFICATION DIVISION.
 PROGRAM-ID. MAIN-PROGRAM.

 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT INPUT-FILE ASSIGN TO 'INPUTFILE.TXT'.
     SELECT OUTPUT-FILE ASSIGN TO 'OUTPUTFILE.TXT'.

 DATA DIVISION.
 FILE SECTION.
 FD INPUT-FILE
     RECORD CONTAINS 80 CHARACTERS
     LABEL RECORDS ARE STANDARD
     DATA RECORD IS INPUT-RECORD.
 01 INPUT-RECORD.
     05 ID PIC X(5).
     05 NAME PIC X(20).
     05 AGE PIC 99.
     05 SALARY PIC 9(5)V99.
     05 DEPARTMENT PIC X(10).

 FD OUTPUT-FILE
     RECORD CONTAINS 80 CHARACTERS
     LABEL RECORDS ARE OMITTED
     DATA RECORD IS OUTPUT-RECORD.
 01 OUTPUT-RECORD.
     05 ID PIC X(5).
     05 NAME PIC X(20).
     05 INCREMENT PIC 9(5)V99.
     05 NEW-SALARY PIC 9(5)V99.

 WORKING-STORAGE SECTION.
 01 INCREMENT-AMOUNT PIC 9(5)V99 VALUE 500.00.
 01 TOTAL-INCREMENTS PIC 9(5)V99 VALUE 0.
 01 TOTAL-SALARY PIC 9(5)V99 VALUE 0.

 PROCEDURE DIVISION.
 100-MAIN-LOOP.
     OPEN INPUT INPUT-FILE.
     OPEN OUTPUT OUTPUT-FILE.
     MOVE 1 TO TOTAL-INCREMENTS.
     PERFORM 300-READ-RECORDS UNTIL EOF.
     MOVE TOTAL-SALARY TO NEW-SALARY.
     PERFORM 400-WRITE-RECORD.

 200-END-PROGRAM.
     CLOSE INPUT-FILE.
     CLOSE OUTPUT-FILE.
     STOP RUN.

 300-READ-RECORDS.
     READ INPUT-FILE
         AT END MOVE 'YES' TO EOF.
     IF EOF = 'NO'
         ADD INCREMENT-AMOUNT TO SALARY
         ADD 1 TO TOTAL-INCREMENTS
         ADD SALARY TO TOTAL-SALARY
     END-IF.

 400-WRITE-RECORD.
     WRITE OUTPUT-FILE
         INVALID KEY DISPLAY 'ERROR WRITING RECORD'
         END-READ.