Identification Division.                      // Defines the name and version of the program
Program-ID. LONG-CODE.                         // Specifies the program name
Author. YOUR-NAME.                             // Specifies the name of the program author
Date-Written. 01-01-2021.                      // Specifies the date the program was written

Environment Division.                          // Specifies the environment the program will run in
Configuration Section.                         // Configures the input/output devices for the program
Source-Computer. YOUR-COMPUTER.                // Specifies the name of the computer where the program will be compiled
Object-Computer. YOUR-COMPUTER.                // Specifies the name of the computer where the program will be executed

Data Division.                                  // Defines the data used in the program
Working-Storage Section.                        // Specifies variables and data structures used for calculations and temporary storage
01 NUMBER-ONE PIC 9(3).                         // Defines a variable named NUMBER-ONE with 3 digits
01 NUMBER-TWO PIC 9(3).                         // Defines a variable named NUMBER-TWO with 3 digits

Procedure Division.                             // Specifies the logic and procedures of the program
Multiply-Two-Numbers.                           // Specifies the name of the procedure
    Multiply NUMBER-ONE BY NUMBER-TWO.          // Multiplies the value of NUMBER-ONE by the value of NUMBER-TWO
    DISPLAY "The product of the two numbers is:", NUMBER-ONE. // Prints the result to the screen
    GOBACK.                                    // Terminates the program

End Program LONG-CODE.                          // Specifies the end of the program