ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. ABCCC-EQUIV.
       OBJECT-COMPUTER. BBCCC-EQUIV.

       DATA DIVISION.
       FILE SECTION.
       FD WORK-FILE
           LABEL RECORDS OMITTED
           VALUE OF FILE-ID "INPUT-FILE"
           IS EXTERNAL.
       01 INVOICE-REC                               PIC X(200).

       WORKING-STORAGE SECTION.
       01 WORKING-VARIABLES.
           02 WS-INPUT-LENGTH                      PIC 9(5).
           02 WS-START-POSITION                    PIC 9(5).
           02 WS-GRAND-TOTAL                       PIC 9(3)V99.
           02 WS-PREVIOUS-KEY                      PIC X(10).

       LINKAGE SECTION.
       01 INPUT-PARAMETERS.
           02 IN-PARAM1                           PIC 9(5).
           02 IN-PARAM2                           PIC 9(5).
           02 IN-PARAM3                           PIC 9(5).
           02 IN-PARAM4                           PIC 9(5).
       01 OUTPUT-PARAMETERS.
           02 OUT-PARAM1                          PIC 9(5).

       PROCEDURE DIVISION USING INPUT-PARAMETERS,OUTPUT-PARAMETERS.

       PERFORM INITIALIZE-FILE.
       PERFORM READ-FILE UNTIL WS-INPUT-LENGTH = 0.
       PERFORM CALCULATE-GRAND-TOTAL USING IN-PARAM1,IN-PARAM2,IN-PARAM3,IN-PARAM4
                                          OUT-PARAM1.

       CLOSE WORK-FILE.

       INITIALIZE-FILE.
           OPEN INPUT WORK-FILE.
           MOVE 0 TO WS-START-POSITION.
           MOVE SPACES TO INVOICE-REC.

       READ-FILE.
           READ WORK-FILE INTO INVOICE-REC
           AT END
               MOVE 0 TO WS-INPUT-LENGTH
               PERFORM CLOSE-AND-RETURN
           END-READ.

       CALCULATE-GRAND-TOTAL USING IN-PARAM1,IN-PARAM2,IN-PARAM3,IN-PARAM4
                                           OUT-PARAM1.
           COMPUTE WS-GRAND-TOTAL ROUNDED = (IN-PARAM1 * 2) + (IN-PARAM2 * 2) + (IN-PARAM3 * 4) + (IN-PARAM4 * 4).
           MOVE WS-GRAND-TOTAL TO OUT-PARAM1.

       CLOSE-AND-RETURN.
           CLOSE WORK-FILE.
           STOP RUN.
END PROGRAM.