IDENTIFICATION DIVISION.                     * Identification Division
       PROGRAM-ID. INT-MULTI.                        * Program ID
       DATA DIVISION.                                * Data Division
       WORKING-STORAGE SECTION.                      * Working Storage Section
       01 V-NUMBER1 PIC 9(3).                         * Variable to hold first number
       01 V-NUMBER2 PIC 9(3).                         * Variable to hold second number
       01 V-NUMBER3 PIC 9(5).                         * Variable to hold result
       PROCEDURE DIVISION.                            * Procedure Division
       MAIN-SECTION.                                  * Main Section
           DISPLAY "Enter first number: ".            * Prompt user for first number
           ACCEPT V-NUMBER1.                          * Store first number input
           DISPLAY "Enter second number: ".           * Prompt user for second number
           ACCEPT V-NUMBER2.                          * Store second number input
           MULTIPLY V-NUMBER1 BY V-NUMBER2             * Multiply the two numbers
           GIVING V-NUMBER3.                          * Store result in V-NUMBER3
           DISPLAY "The result is: " V-NUMBER3.        * Output the result
           STOP RUN.                                  * End the program