IDENTIFICATION DIVISION.
	PROGRAM-ID. MY-CALCULATION.
DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 FIRST-NUMBER PIC 9(5)V99.
	01 SECOND-NUMBER PIC 9(5)V99.
	01 RESULT PIC 9(7)V99.
PROCEDURE DIVISION.
	PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
		COMPUTE RESULT = FIRST-NUMBER * SECOND-NUMBER
		IF RESULT > 100000 THEN
			DISPLAY 'Result is over 100,000'
		END-IF
	END-PERFORM.
	STOP RUN.