01 RECORD.                                   /* Defines a record called RECORD */
      05 ID-NUM        PIC 9(5).                /* Defines a field called ID-NUM with 5 digits */
      05 NAME          PIC X(30).               /* Defines a field called NAME with 30 characters */
      05 SALARY        PIC 9(8)V99.             /* Defines a field called SALARY with 8 digits and 2 decimal places */
      05 BIRTHDATE     PIC 9(8).                /* Defines a field called BIRTHDATE with 8 digits */
      05 DEPARTMENT    PIC XX.                  /* Defines a field called DEPARTMENT with 2 characters */
      05 ADDRESS.                               /* Defines a group field called ADDRESS */
         10 STREET     PIC X(30).               /* Defines a field called STREET with 30 characters */
         10 CITY       PIC X(20).               /* Defines a field called CITY with 20 characters */
         10 STATE      PIC XX.                  /* Defines a field called STATE with 2 characters */
         10 ZIP         PIC 9(5).               /* Defines a field called ZIP with 5 digits */
      05 STATUS.                                 /* Defines a group field called STATUS */
         10 EMPLOYED  PIC X(1) VALUE 'Y'.        /* Defines a field called EMPLOYED with value 'Y' (Yes) */
         10 MARRIED  PIC X(1) VALUE 'N'.         /* Defines a field called MARRIED with value 'N' (No) */
         10 CHILDREN  PIC 9(1) VALUE 0.          /* Defines a field called CHILDREN with value 0 */
      05 EXPENSES OCCURS 12 TIMES.               /* Defines an array called EXPENSES with 12 occurrences */
         10 MONTH EXPENSE             PIC 9(7)V99./* Defines a field called MONTH EXPENSE with 7 digits and 2 decimal places */
                                               /* The OCCURS clause means there will be 12 of these fields */
        
                                                 /* The rest of the code would depend on the specific program being written */
                                                 /* This code snippet just defines the data layout and fields for a record */