IDENTIFICATION DIVISION.              // Start of program
PROGRAM-ID. HELLO-WORLD.              // Program name

DATA DIVISION.                        // Definition of data
WORKING-STORAGE SECTION.
01 COUNT PIC 9(2) VALUE 10.           // Declaring a variable COUNT of type numeric with value 10

PROCEDURE DIVISION.                   // Start of procedure division
MAIN SECTION.
DISPLAY 'Printing numbers from 1 to 10:'.       // Display message on screen
PERFORM VARYING COUNT FROM 1 BY 1    // Loop from 1 to 10
UNTIL COUNT > 10
    DISPLAY COUNT NUMERIC.           // Display value of COUNT
END-PERFORM.                         // End of loop

STOP.                                 // End program
END PROGRAM HELLO-WORLD.              // End of program