IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-AREA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LENGTH PIC 9(5).
       01 WIDTH PIC 9(5).
       01 AREA PIC 9(8).

       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY "Please enter the length of the rectangle: ".
           ACCEPT LENGTH.
           PARSE LENGTH.
           DISPLAY "Please enter the width of the rectangle: ".
           ACCEPT WIDTH.
           PARSE WIDTH.
           MULTIPLY LENGTH BY WIDTH GIVING AREA.
           DISPLAY "The area of the rectangle is " AREA.
       STOP RUN.