IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER-FILE-REC.              
          05 CUST-NO        PIC X(6).      
          05 CUST-NAME      PIC X(30).     
          05 CUST-ADDRESS   PIC X(50).     
          05 CUST-PHONE     PIC X(12).     

       01 PRODUCT-FILE-REC.
          05 PROD-NO        PIC X(6).
          05 PROD-NAME      PIC X(30).
          05 PROD-PRICE     PIC 9(3)V99.

       01 ORDER-FILE-REC.
          05 ORDER-NO       PIC X(6).
          05 CUST-NO        PIC X(6).
          05 ORDER-DATE     PIC X(10).
          05 PROD-NO        PIC X(6).
          05 QUANTITY       PIC 9(3).

       01 TOTAL-AMT        PIC 9(5)V99.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
       PERFORM INPUT-ALL-FILES.
       PERFORM CALCULATE-TOTAL.

       INPUT-ALL-FILES.
       OPEN INPUT CUSTOMER-FILE, PRODUCT-FILE, ORDER-FILE.
       READ ORDER-FILE NEXT RECORD
           AT END MOVE 'YES' TO END-OF-FILE.
       PERFORM UNTIL END-OF-FILE = 'YES'.
       READ CUSTOMER-FILE
           AT END MOVE 'YES' TO END-OF-FILE.
       IF CUST-NO = ORDER-NO
           READ PRODUCT-FILE
               AT END MOVE 'YES' TO END-OF-FILE.
       END-IF.
       END-PERFORM.
       CLOSE CUSTOMER-FILE, PRODUCT-FILE, ORDER-FILE.

       CALCULATE-TOTAL.
       PERFORM VARYING QUANTITY FROM 1 BY 1
           UNTIL QUANTITY > 3
           IF QUANTITY = 1
               MULTIPLY PROD-PRICE BY 0.9 GIVING TOTAL-AMT
           ELSE IF QUANTITY = 2
               MULTIPLY PROD-PRICE BY 0.85 GIVING TOTAL-AMT
           ELSE IF QUANTITY = 3
               MULTIPLY PROD-PRICE BY 0.8 GIVING TOTAL-AMT.
       DISPLAY "TOTAL AMOUNT IS: " TOTAL-AMT.

       EXIT PROGRAM.
       
       END PROGRAM EXAMPLE.