IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-AGE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BIRTH-DATE.
           05 BIRTH-YEAR   PIC 99.
           05 BIRTH-MON    PIC 99.
           05 BIRTH-DAY    PIC 99.
       01 PRESENT-DATE.
           05 PRESENT-YEAR PIC 99.
           05 PRESENT-MON  PIC 99.
           05 PRESENT-DAY  PIC 99.
       01 AGE-IN-YEARS    PIC 99.

       PROCEDURE DIVISION.
       DISPLAY "Please enter your birth year:"
       ACCEPT BIRTH-YEAR
       DISPLAY "Please enter your birth month:"
       ACCEPT BIRTH-MON
       DISPLAY "Please enter your birth day:"
       ACCEPT BIRTH-DAY

       DISPLAY "Please enter present year:"
       ACCEPT PRESENT-YEAR
       DISPLAY "Please enter present month:"
       ACCEPT PRESENT-MON
       DISPLAY "Please enter present day:"
       ACCEPT PRESENT-DAY

       IF BIRTH-MON > PRESENT-MON
         SUBTRACT 1 FROM AGE-IN-YEARS
       ELSE IF (BIRTH-MON = PRESENT-MON) AND (BIRTH-DAY > PRESENT-DAY)
         SUBTRACT 1 FROM AGE-IN-YEARS

       SUBTRACT BIRTH-YEAR FROM PRESENT-YEAR GIVING AGE-IN-YEARS

       DISPLAY "Your age is " AGE-IN-YEARS " years old."
       
       STOP RUN.