IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * DEFERRED-SUBSECTION
       COPY "PROPFILE.DEFERRED".

       PROCEDURE DIVISION.

       BEGIN.
           SET DATE-FORMAT TO YYYYMMDD.
           CALL "GET-PROPERTIES" USING DEFERRED-FILE
                                      DEFERRED-OUTPUT
                                      DEFERRED-COUNT.
           IF DEFERRED-COUNT = 0
               DISPLAY "No deferred properties found."
           ELSE
               PERFORM VARYING I FROM 1 BY 1 UNTIL I > DEFERRED-COUNT
                   SET DEFERRED-PROPERTY TO DEFERRED-OUTPUT(I)
                   PERFORM CALCULATE-AMOUNT USING DEFERRED-PROPERTY
                   IF AMOUNT GREATER THAN 0
                       DISPLAY "Deferred property number "& I &
                                " has an amount of "& AMOUNT
                   END-IF
               END-PERFORM
           END-IF.

       CALCULATE-AMOUNT SECTION USING DEFERRED-P.
           SET CURRENCY-CONVERSION TO 'USD'.
           IF DEFERRED-P-IS-USD
               SET AMOUNT TO DEFERRED-P-USD
           ELSE
               SET AMOUNT TO DEFERRED-P-LOCAL * CURRENCY-CONVERSION
           END-IF.
           COMPUTE AMOUNT = AMOUNT + DEFERRED-P-ADDITIONAL-CHARGES.

       END PROGRAM EXAMPLE.