PROGRAM-ID. MULTIPLY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X.
       01 B PIC X.
       01 ANSWER PIC 99.
       PROCEDURE DIVISION.
       ACCEPT A.
       ACCEPT B.
       MULTIPLYING.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > LENGTH OF A
               PERFORM VARYING J FROM 1 BY 1 UNTIL J > LENGTH OF B 
                       MULTIPLY A(I:1) BY B(J:1) GIVING C
                       IF C > 0 THEN
                               ADD C TO ANSWER(I+J-1:2)
                       END-IF
               END-PERFORM
       END-PERFORM
       DISPLAY "THE ANSWER IS " ANSWER.
       STOP RUN.