IDENTIFICATION DIVISION.                                                             
           PROGRAM-ID. SAMPLE-CODE.                                                             
           ENVIRONMENT DIVISION.  
           DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 NUM-A          PIC 9(3).       -# This line declares a numeric variable of length 3, you can change the length to your preference
           01 NUM-B          PIC 9(3).       -# This line declares another numeric variable of length 3
           01 SUM            PIC 9(5) VALUE 0.  -# This line declares a third numeric variable of length 5, initialized with a value of 0
           PROCEDURE DIVISION.                                                                   
           MAIN PROCEDURE.                                                                       
           DISPLAY 'Enter value for NUM-A: '.                                                    
           ACCEPT NUM-A                                                                              -# This line prompts user to enter a value for NUM-A and stores the value in the variable
           DISPLAY 'Enter value for NUM-B: '.                                                    
           ACCEPT NUM-B                                                                              -# This line prompts user to enter a value for NUM-B and stores the value in the variable
           COMPUTE SUM = NUM-A + NUM-B                                                             -# This line adds the values of NUM-A and NUM-B and assigns the result to the variable SUM
           DISPLAY 'The sum of NUM-A and NUM-B is '. SUM.   -# This line displays the result
           STOP RUN.                                                                               -# This line ends the program execution