IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
      * This is a sample program in COBOL
      * ------------------------------------
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE  ASSIGN TO "EMPLOYEES.DAT".
           SELECT OUTPUT-FILE ASSIGN TO "SALARY.RPT".
              
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORD CONTAINS 72 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS INPUT-REC.
       01 INPUT-REC.
           05 EMP-ID     PIC X(6).
           05 EMP-NAME   PIC X(30).
           05 EMP-SALARY PIC 9(8).
           05 FILLER     PIC X(28).
              
       FD OUTPUT-FILE
           RECORD CONTAINS 72 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS OUTPUT-REC.
       01 OUTPUT-REC.
           05 EMP-ID     PIC X(6).
           05 EMP-NAME   PIC X(30).
           05 EMP-SALARY PIC 9(8).
           05 FILLER     PIC X(28).
                
       WORKING-STORAGE SECTION.
       01 HEADER.
           05 FILLER          PIC X(11) VALUE "EMPLOYEES".
           05 FILLER          PIC X(8).
           05 REPORT-DATE     PIC X(8) VALUE SPACES.
           05 FILLER          PIC X(45).
           
       PROCEDURE DIVISION.
       100-MAIN-LOGIC.
           PERFORM 300-OPEN-FILES.
           PERFORM 400-PROCESS-RECORDS.
           PERFORM 500-CLOSE-FILES.
           STOP RUN.
           
       300-OPEN-FILES.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE.
           
       400-PROCESS-RECORDS.
           READ INPUT-FILE
               AT END EXIT.
           MOVE INPUT-REC TO OUTPUT-REC.
           WRITE OUTPUT-REC.
           DISPLAY 'Record processed: ' INPUT-REC.
           GO TO 400-PROCESS-RECORDS.
           
       500-CLOSE-FILES.
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE.
                     
       END PROGRAM SAMPLE.