IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 A PIC S9(6) VALUE -12345.        * Declaring a signed numeric variable with initial value
       77 B PIC 9(2) COMP VALUE 55.        * Declaring a compact numeric variable with initial value
       PROCEDURE DIVISION.
       ADD A B GIVING A.                    * Addition operation using the two declared variables
       DISPLAY "Result is " A.              * Outputting the result to the screen
       STOP                                  * Stopping the program
       END PROGRAM EXAMPLE.                 * Ending the program