* This is a COBOL program that generates a fibonacci sequence and displays the results

IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5).
01 NUM2 PIC 9(5).
01 NUM3 PIC 9(5).
01 MAX-NUM PIC 9(5).
01 COUNTER PIC 9(5) VALUE 2.
01 I PIC 9(5).
01 FIB-TABLE.
02 FIB-PIC PIC 9(5) OCCURS MAX-NUM TIMES.
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT MAX-NUM.
    MOVE 0 TO FIB-PIC(1).
    MOVE 1 TO FIB-PIC(2).
    MOVE MAX-NUM TO NUM1.
    PERFORM FIB-CALC UNTIL COUNTER > MAX-NUM.
    DISPLAY "FIBONACCI SEQUENCE:".
    PERFORM DISPLAY-FIB UNTIL I > MAX-NUM.
    STOP RUN.

FIB-CALC.
    MULTIPLY FIB-PIC(COUNTER-1) BY FIB-PIC(COUNTER-1) GIVING NUM3.
    SUBTRACT FIB-PIC(COUNTER-2) FROM NUM3 GIVING NUM3.
    MOVE NUM3 TO FIB-PIC(COUNTER).
    ADD 1 TO COUNTER.

DISPLAY-FIB.
    DISPLAY FIB-PIC(I).
    ADD 1 TO I.

END PROGRAM FIBONACCI.