IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALARY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SAL-FILE-IN ASSIGN TO "SALIN.DAT".
           SELECT SAL-FILE-OUT ASSIGN TO "SALOUT.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD SAL-FILE-IN.
       01 SAL-IT-REC.
           02 EMPLOYEENUM PIC 9(5).
           02 EMPLOYEENAME PIC X(20).
           02 SALARY PIC 9(7)V99.
       FD SAL-FILE-OUT.
       01 SAL-OT-REC.
           02 EMPLOYEENUM PIC 9(5).
           02 EMPLOYEENAME PIC X(20).
           02 SALARY PIC 9(7)V99.
           02 OVERTIME-HRS PIC 9(3).
           02 OVERTIME-SAL PIC 9(7)V99.
       WORKING-STORAGE SECTION.
       01 TOTAL-SALARY COMPUTATIONAL-3 PIC 9(9)V99.
       01 TOTAL-OVERTIME COMPUTATIONAL-3 PIC 9(9)V99.
       01 EMPLOYEE-COUNT COMPUTATIONAL-3 PIC 9(3).
       PROCEDURE DIVISION.
       OPEN INPUT SAL-FILE-IN
       OUTPUT SAL-FILE-OUT.
       PERFORM-READ.
       PERFORM-CALCULATOR.
       PERFORM-WRITE.
       CLOSE SAL-FILE-IN
       SAL-FILE-OUT.
       STOP RUN.
       PERFORM-READ.
           READ SAL-FILE-IN
               AT END
                   MOVE "N" TO SAL-FILE-SW
               NOT AT END
                   ADD 1 TO EMPLOYEE-COUNT
                   ADD SALARY TO TOTAL-SALARY
                   IF SALARY > 1000
                       SUBTRACT 1000 FROM SALARY GIVING OVERTIME-SAL
                       ADD 1 TO TOTAL-OVERTIME
                   END-IF
               END-READ.
       PERFORM-CALCULATOR.
           COMPUTE AVERAGE-SALARY = TOTAL-SALARY / EMPLOYEE-COUNT.
           COMPUTE AVERAGE-OVERTIME = TOTAL-OVERTIME / EMPLOYEE-COUNT.
       PERFORM-WRITE.
           WRITE SAL-OT-REC.
                 USING EMPLOYEENUM, EMPLOYEENAME, SALARY, OVERTIME-HRS,
                 OVERTIME-SAL.
           WRITE SAL-OT-REC.
                 USING "TOTAL", "-", TOTAL-SALARY, TOTAL-OVERTIME, "-".
           WRITE SAL-OT-REC.
                 USING "AVERAGE", "-", AVERAGE-SALARY, AVERAGE-OVERTIME, "-".
       STOP RUN.