IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(3).
PROCEDURE DIVISION.
PERFORM CHECK-PRIME THRU CNT.
DISPLAY 'Prime'.
.
EXIT.
CNT. ADD 1 TO NUM.
CHECK-PRIME.
IF (NUM < 2) OR (NUM MOD 2 = 0)
DISPLAY 'Not Prime'.
IF (NUM < 2) OR (NUM = 3) MOVE 'N' TO NUM. // Check if number is less than 2 or equal to 3, then set flag to 'N'
MOVE 'Y' TO CNT. // Set flag to 'Y'
EVALUATE TRUE

WHEN NUM < 5 // Check if number is less than 5
MOVE 'N' TO NUM // Set flag to 'N'
CONTINUE

WHEN NUM > 5 AND NUM MOD 2 = 0, DISPLAY 'Not Prime' // Check if number is greater than 5 and divisible by 2

WHEN OTHER DISPLAY 'Not Prime'.