IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
         SELECT INFILE ASSIGN TO 'INPUT.TXT'.
         SELECT OUTFILE ASSIGN TO 'OUTPUT.TXT'.
       
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-RECORD.
          05 IN-NAME PIC X(20).
          05 IN-AGE PIC 9(3).
          05 IN-GENDER PIC X.
       
       FD OUTFILE.
       01 OUT-RECORD.
          05 OUT-NAME PIC X(20).
          05 OUT-AGE PIC 9(3).
          05 OUT-GENDER PIC X.
       
       WORKING-STORAGE SECTION.
       01 IN-EOF PIC X VALUE 'N'.
       01 OUT-COUNT PIC 9(3) VALUE 0.
       
       PROCEDURE DIVISION.
       100-MAIN.
       
       OPEN INPUT INFILE.
       OPEN OUTPUT OUTFILE.
       
       PERFORM 200-READ-INPUT UNTIL IN-EOF = 'Y'.
       
       CLOSE INFILE.
       CLOSE OUTFILE.
       
       STOP RUN.
       
       200-READ-INPUT.
       
       READ INFILE
         AT END MOVE 'Y' TO IN-EOF.
       
       IF IN-NAME = 'John Smith'
         PERFORM 300-PROCESS-RECORD
       ELSE
         PERFORM 200-READ-INPUT.
       
       300-PROCESS-RECORD.
       
       ADD 1 TO OUT-COUNT.
       
       MOVE IN-NAME TO OUT-NAME.
       MOVE IN-AGE TO OUT-AGE.
       MOVE IN-GENDER TO OUT-GENDER.
       
       EXEC SQL
        INSERT INTO EMPLOYEES (NAME, AGE, GENDER)
        VALUES (OUT-NAME, OUT-AGE, OUT-GENDER)
        END-EXEC.
       
       PERFORM 200-READ-INPUT.
       
       101-EXIT.
       EXIT PROGRAM.
       
       END PROGRAM MYPROGRAM.