IDENTIFICATION DIVISION.
       PROGRAM-ID. TestProg.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  Value-1         PIC 9(3).
       01  Value-2         PIC 9(3).
       01  Result          PIC S9(5)V9(2) USAGE COMP.
       PROCEDURE DIVISION.
       Main-Paragraph.
           MOVE 350 TO Value-1.
           MOVE 700 TO Value-2.
           COMPUTE Result = Value-1 / Value-2.
           DISPLAY "The result of division is " Result.
           STOP RUN.