IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VALUE-ONE PIC 9(2) VALUE 12.
01 VALUE-TWO PIC 9(1) VALUE 5.
01 RESULT PIC 9(2).
PROCEDURE DIVISION.
MULTIPLY VALUE-ONE BY VALUE-TWO GIVING RESULT.
DISPLAY "THE RESULT OF MULTIPLICATION IS: " RESULT.
STOP RUN.