IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALARY.
AUTHOR. JOHN DOE.
DATE-WRITTEN. 12/10/2020.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 EMPLOYEE-INFO.
   02 EMPLOYEE-NAME PIC X(25).
   02 EMPLOYEE-ID PIC 9(9).
   02 EMPLOYEE-AGE PIC 99.
   02 EMPLOYEE-SALARY PIC 9(7)V99.
   02 IS-MANAGER PIC X.

01 BONUS-RATE PIC 9(3).

01 BONUS PIC 9(6)V99.

01 TOTAL-SALARY PIC 9(9)V99.

PROCEDURE DIVISION.
ACCEPT EMPLOYEE-INFO.
ACCEPT BONUS-RATE.
COMPUTE BONUS = (EMPLOYEE-SALARY * BONUS-RATE)/100.
IF (IS-MANAGER = 'Y')
   COMPUTE BONUS = BONUS + (0.25 * EMPLOYEE-SALARY)
END-IF.
COMPUTE TOTAL-SALARY = EMPLOYEE-SALARY + BONUS.
DISPLAY 'The total salary for employee ' EMPLOYEE-NAME ' with ID ' EMPLOYEE-ID ' and salary of ' EMPLOYEE-SALARY ' is ' TOTAL-SALARY.
STOP RUN.