DISPSECTION.                                                                       
    SET REMAINING-LINE-COUNT TO LINE-LIMIT                                         
    MOVE 1 TO PAGE-COUNTER                                                         
    PERFORM PRINT-HEADER-INFO UNTIL PAGE-COUNTER GREATER THAN TOTAL-PAG
    PERFORM UNTIL NUM-LINES-RETURNED = 0                                            
        ADD 1 TO LINE-COUNTER                                                       
        IF LINE-COUNTER > LINE-LIMIT                                                
            PERFORM PRINT-HEADER-INFO                                               
            SET LINE-COUNTER TO ZEROS                                                
        END-IF                                                                       
        SET CURRENT-CHAR-POS TO FIRST-CHAR-POS.                                     
            DO WHILE CURRENT-CHAR-POS IS LESS THAN LINE-LENGTH                       
                SET NEXT-CHAR TO INPUT-RECORD (CURRENT-CHAR-POS).                   
                IF NEXT-CHAR NOT = SPACE                                           
                    ADD 1 TO OUTPUT-LENGTH                                           
                    MOVE NEXT-CHAR TO OUTPUT-RECORD (OUTPUT-LENGTH).                
                END-IF                                                               
                IF NEXT-CHAR IS EQUAL TO SPACE                                      
                    SET NEXT-CHAR TO OUTPUT-RECORD (OUTPUT-LENGTH).                 
                    SET OUTPUT-LENGTH UP BY 1                                        
                    PERFORM PARSE-WORD                                              
                    SET NEXT-CHAR TO INPUT-RECORD (CURRENT-CHAR-POS).               
                    ADD 1 TO CURRENT-CHAR-POS.                                      
                    MOVE NEXT-CHAR TO OUTPUT-RECORD (OUTPUT-LENGTH).                
                END-IF                                                               
                ADD 1 TO CURRENT-CHAR-POS                                           
            END-DO                                                                   
            PERFORM PARSE-WORD                                                      
            PERFORM PRINT-OUTPUT-RECORD.                                            
    END-PERFORM.                                                                     
    IF LINE-COUNTER NOT = 0 AND LINE-COUNTER NOT = 1                                 
        ADD 1 TO PAGE-COUNTER                                                        
        ADD LINE-COUNTER TO TOTAL-LINES-RETURNED                                    
        PERFORM PRINT-HEADER-INFO                                                   
    END-IF                                                                           
    IF LINE-COUNTER EQUAL TO 1                                                       
        ADD 1 TO TOTAL-LINES-RETURNED                                               
    END-IF.