IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-NUMBER PIC 9(5) VALUE 12345.
01 FIVE-NUMBERS PIC 9(5) OCCURS 5 TIMES.
01 SUM PIC 9(5) VALUE ZERO.
PROCEDURE DIVISION.
MULTIPLY MY-NUMBER BY 2 GIVING SUM.
IF SUM > 500 THEN
    DISPLAY 'The sum is greater than 500'
ELSE IF SUM < 500 THEN
    DISPLAY 'The sum is less than 500'
ELSE
    DISPLAY 'The sum is equal to 500'.
DIVIDE SUM BY 5 GIVING FIVE-NUMBERS.
DISPLAY 'The five numbers are:'.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
    DISPLAY FIVE-NUMBERS(I) ' '.