IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERIC-ITEM PIC 99.
01 DECIMAL-ITEM PIC 999.99.
01 ALPHA-ITEM PIC X(10) VALUE "COBOL".
01 PERSON-RECORD.
   05 FIRST-NAME PIC X(20).
   05 LAST-NAME PIC X(20).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
   DISPLAY "Welcome to the sample COBOL program!".
   ACCEPT FIRST-NAME FROM CONSOLE.
   ACCEPT LAST-NAME FROM CONSOLE.
   ADD NUMERIC-ITEM TO 10.
   MULTIPLY DECIMAL-ITEM BY 2.
   IF ALPHA-ITEM EQUAL TO "COBOL" THEN
      DISPLAY "Congratulations, you entered COBOL as your name!".
   ELSE
      DISPLAY "Sorry, your first name is not COBOL.".
   END-IF.

STOP RUN.