* Assume input from external file of customer names and account numbers
       WORKING-STORAGE SECTION.
       01 SUCCESS-IND-OUT     PIC X. #variable to track success of operation
       01 NAME-IN             PIC X(20). #variable to store customer name
       01 NUM-IN              PIC 9(9). #variable to store customer account number
       01 COUNT               PIC 99 VALUE 0. #variable to count number of records processed
       01 EOF-IND             PIC X VALUE 'N'. #variable to track end of file indicator
      *
       PROCEDURE DIVISION.
       000-MAIN.
           OPEN       INPUT IN-FILE.
           OPEN       OUTPUT OUT-FILE.
           PERFORM    100-READ-FILE THRU 100-END
           UNTIL      EOF-IND = 'Y'
           READ IN-FILE
           AT END
               MOVE 'Y' TO EOF-IND
           NOT AT END
               COMPUTE COUNT = COUNT + 1
               PERFORM 200-PROCESS-RECORD THRU 200-EXIT
       100-END.
           CLOSE      IN-FILE.
           CLOSE      OUT-FILE.
           DISPLAY SUCCESS-IND-OUT
           STOP RUN.
      *
       100-READ-FILE.
           READ IN-FILE INTO NAME-IN, NUM-IN
           AT END
               MOVE 'Y' TO EOF-IND.
       200-PROCESS-RECORD.
           ADD 1 TO COUNT
           MOVE 'SUCCESS' TO SUCCESS-IND-OUT
           WRITE OUT-RECORD FROM NAME-IN, NUM-IN.
       200-EXIT.
           EXIT.