IDENTIFICATION DIVISION.                                   * Identifies the program name.
PROGRAM-ID. HELLO-WORLD.                                    * Program name is 'HELLO-WORLD'.

*> This is a comment line - can be used for documentation purposes or to provide additional information.

DATA DIVISION.                                              * Declares the data used in the program.
WORKING-STORAGE SECTION.
01 MSG-OUT PIC X(20) VALUE 'Hello, World!'.                  * Declares a 20 character string variable named MSG-OUT.

PROCEDURE DIVISION.                                         * Program instructions start here.
MAIN-LOGIC SECTION.
    DISPLAY MSG-OUT.                                        * Displays the value of MSG-OUT on the screen.
    STOP RUN.                                               * Ends the execution of the program.
END PROGRAM HELLO-WORLD.                                    * Indicates the end of the program.