IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-COUNTER PIC 9(3) VALUE 0.
01 MY-FLAG PIC X(1) VALUE 'N'.
01 MY-STRING PIC X(20) VALUE 'Hello, World!'.

PROCEDURE DIVISION.
BEGIN.
    PERFORM UNTIL MY-COUNTER = 10
        IF MY-FLAG = 'Y'
            MULTIPLY MY-COUNTER BY 2 GIVING MY-COUNTER
        ELSE
            ADD 5 TO MY-COUNTER
        END-IF
        DISPLAY MY-STRING
    END-PERFORM.

    DISPLAY 'Finished loop!'.
    STOP RUN.
END PROGRAM MYPROGRAM.