IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-SUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01      NUM1               PIC 9(4).
       01      NUM2               PIC 9(4).
       01      SUM                PIC 9(5).
       PROCEDURE DIVISION.
       MAIN-LOGIC.
            DISPLAY "ENTER FIRST NUMBER: ".
            ACCEPT NUM1.
            DISPLAY "ENTER SECOND NUMBER: ".
            ACCEPT NUM2.
            COMPUTE SUM = NUM1 + NUM2.
            DISPLAY "SUM OF NUMBERS IS: ".
            DISPLAY SUM.
            STOP RUN.