PROCESS DIVISION USING BY VALUE INOUT x, y
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  x       PIC 9(3) VALUE 123.
       01  y       PIC 9(3) VALUE -321.
       LINKAGE SECTION.
       01  link1   PIC 9(4).
       01  link2   PIC 9(4).
       01  result  PIC 9(5).
       PROCEDURE DIVISION.
           IF link1 >= 0
               MOVE x TO result
           ELSE
               ADD y TO result
       END PROCEDURE DIVISION.