CATALOG.
ID DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 EMPLOYEE-TABLE.
05 EMPLOYEE-RECORD OCCURS 100 TIMES.
10 EMPLOYEE-NAME PIC X(20).
10 EMPLOYEE-ID PIC 9(6).
10 EMPLOYEE-SALARY PIC 9(9)V99.
PROCEDURE DIVISION.
PERFORM VARYING INDEX
FROM 1 BY 1
UNTIL INDEX > 100
  DISPLAY 'Name: ' EMPLOYEE-RECORD(INDEX).EMPLOYEE-NAME
END-PERFORM.
STOP RUN.