IDENTIFICATION DIVISION.
      PROGRAM-ID. EXAMPLE.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT SALES-FILE-INPUT
              ASSIGN TO "SALES.DAT"
              ORGANIZATION IS SEQUENTIAL.

      DATA DIVISION.
      FILE SECTION.
      FD SALES-FILE-INPUT
          RECORD CONTAINS 160 CHARACTERS
          LABEL RECORDS ARE STANDARD
          VALUE OF FILE-ID IS "SALES.DAT".
      01  SALES-RECORD.
          05  SALES-NUMBER       PIC X(10).
          05  CUSTOMER-NUMBER    PIC X(10).
          05  CUSTOMER-NAME      PIC X(30).
          05  PRODUCT-CODE       PIC X(10).
          05  PRODUCT-DESCRIPTION PIC X(40).
          05  QUANTITY           PIC 99.
          05  PRICE              PIC 9(5)V99.
          05  TOTAL-PRICE        PIC 9(6)V99.

      WORKING-STORAGE SECTION.
      01  WS-HEADER.
          05  WS-COMPANY         PIC X(20) VALUE "COBOL ENTERPRISES".
          05                      PIC X(70) VALUE SPACES.
          05  WS-REPORT-TITLE    PIC X(20) VALUE "SALES REPORT".
          05                      PIC X(15) VALUE SPACES.
          05  WS-REPORT-DATE     PIC XX/XX/XXXX.
          05                      PIC X(10) VALUE SPACES.
          05  WS-PROCESSING-DATE PIC XX/XX/XXXX.
          05                      PIC X(30) VALUE SPACES.

      01  WS-TOTAL-REVENUE         PIC 9(10).
      01  WS-STRING-LENGTH         PIC 99 VALUE 0.
      
      PROCEDURE DIVISION.
      100-BEGIN.
          OPEN INPUT SALES-FILE-INPUT.
          PERFORM 200-PROCESS-RECORDS
          CLOSE SALES-FILE-INPUT
          DISPLAY "TOTAL REVENUE: " WS-TOTAL-REVENUE.

      200-PROCESS-RECORDS.
          READ SALES-FILE-INPUT
              AT END
                  MOVE WS-TOTAL-REVENUE TO 0
                  GO TO 300-PRINT-REPORT.
          IF PRODUCT-CODE = "A100"
          SUBTRACT WS-QUANTITY FROM QUANTITY
          COMPUTE TOTAL-PRICE = PRICE * QUANTITY
          ADD TOTAL-PRICE TO WS-TOTAL-REVENUE
          GO TO 200-PROCESS-RECORDS.

      300-PRINT-REPORT.
          MOVE FUNCTION CURRENT-DATE(1) TO WS-REPORT-DATE.
          MOVE FUNCTION DATE(1) TO WS-PROCESSING-DATE.
          DISPLAY WS-HEADER
          INSPECT WS-REPORT-TITLE TALLYING WS-STRING-LENGTH.
          if WS-STRING-LENGTH < 15
              DISPLAY WS-TITLE
              GO TO 400-HEADING-SPACE.
          DISPLAY WS-REPORT-TITLE
          DISPLAY WS-PROCESSING-DATE
          DISPLAY WS-COMPANY
          DISPLAY " "
          DISPLAY "PRODUCT CODE:" PRODUCT-CODE
          DISPLAY "PRODUCT DESCRIPTION:" PRODUCT-DESCRIPTION
          DISPLAY "QUANTITY SOLD:" QUANTITY
          DISPLAY "TOTAL PRICE:" TOTAL-PRICE
          GO TO 200-PROCESS-RECORDS.

      400-HEADING-SPACE.
          DISPLAY "".
          GO TO 300-PRINT-REPORT.

      STOP RUN.