IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUMBER-OF-ROWS PIC 99.
01 NUMBER-OF-COLUMNS PIC 99.
01 TOTAL-SUM PIC 9(15)V99.
01 INPUT-TABLE OCCURS 0 TO 99 TIMES DEPENDING ON NUMBER-OF-ROWS
  INDEXED BY TABLE-ROW.
  05 COLUMN-PTR OCCURS 0 TO 99 TIMES DEPENDING ON NUMBER-OF-COLUMNS
    INDEXED BY TABLE-COL.
    10 COLUMN-INPUT PIC 9(15)V9(2).

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
  ACCEPT NUMBER-OF-ROWS.
  PERFORM UNTIL NUMBER-OF-ROWS = 0
    ACCEPT NUMBER-OF-COLUMNS.
    MOVE 0 TO TOTAL-SUM.

    PERFORM READ-TABLE
      INDEX-TABLE TABLE-ROW FROM 1 TO NUMBER-OF-ROWS
      UNTIL TABLE-ROW > NUMBER-OF-ROWS

    DISPLAY "The total sum of the input table is: " TOTAL-SUM
    ACCEPT NUMBER-OF-ROWS
  END-PERFORM.
  STOP RUN.

READ-TABLE.
  PERFORM VARYING TABLE-ROW FROM INDEX-FROM TO INDEX-TO
    PERFORM VARYING TABLE-COL FROM INDEX-FROM TO INDEX-TO
      ACCEPT COLUMN-INPUT (TABLE-ROW, TABLE-COL)
      ADD COLUMN-INPUT (TABLE-ROW, TABLE-COL) TO TOTAL-SUM
    END-PERFORM
  END-PERFORM.