working-storage section.
       01 input-numbers.
           05 num1 pic 9(10).
           05 num2 pic 9(10).

       01 result pic s9(10) comp-3.

       procedure division.
       add num1 to num2 giving result.
       display "The sum of " num1 " and " num2 " is " result "."

       multiply num1 by num2 giving result.
       display "The product of " num1 " and " num2 " is " result "."

       subtract num1 from num2 giving result.
       display "The difference between " num1 " and " num2 " is " result "."

       divide num1 by num2 giving result.
       display "The quotient of " num1 " and " num2 " is " result "."