IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
*This is a simple COBOL program that prints 'Hello World' to the screen*
DATA DIVISION.
WORKING-STORAGE SECTION.
01  MESSAGE PIC X(11) VALUE 'HELLO WORLD'.
PROCEDURE DIVISION.
DISPLAY MESSAGE.
STOP RUN.