IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTING-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "FILE1.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO "FILE2.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORDING MODE IS F.
       01 INPUT-RECORD.
           05 INPUT-KEY PIC X(10).
           05 INPUT-DATA PIC X(20).

       FD OUTPUT-FILE
           RECORDING MODE IS F.
       01 OUTPUT-RECORD.
           05 OUTPUT-KEY PIC X(10).
           05 OUTPUT-DATA PIC X(20).

       WORKING-STORAGE SECTION.
       01 INPUT-TABLE.
           05 INPUT-TABLE-ENTRY OCCURS 1000 TIMES.
               10 INPUT-TABLE-KEY PIC X(10).
               10 INPUT-TABLE-DATA PIC X(20).

       01 OUTPUT-TABLE.
           05 OUTPUT-TABLE-ENTRY OCCURS 1000 TIMES.
               10 OUTPUT-TABLE-KEY PIC X(10).
               10 OUTPUT-TABLE-DATA PIC X(20).

       PROCEDURE DIVISION.
       SORTING-PROGRAM.
           DISPLAY "STARTING SORTING PROGRAM...".
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.

           PERFORM READ-INPUT-FILE
               UNTIL INPUT-RECORD = ZEROES.

           PERFORM SORT-INPUT-TABLE.

           PERFORM WRITE-OUTPUT-FILE
               UNTIL OUTPUT-RECORD = ZEROES.

           DISPLAY "SORTING COMPLETE. CHECK FILE2.TXT FOR SORTED OUTPUT.".
           CLOSE INPUT-FILE.
           CLOSE OUTPUT-FILE.
           STOP RUN.

       READ-INPUT-FILE.
           READ INPUT-FILE INTO INPUT-RECORD.

           IF INPUT-RECORD = ZEROES
               GO TO EXIT-READ.

           MOVE INPUT-TABLE-KEY TO INPUT-RECORD(1:10).
           MOVE INPUT-TABLE-DATA TO INPUT-RECORD(11:20).
           PERFORM ADD-TO-INPUT-TABLE.

           GO TO READ-INPUT-FILE.

       ADD-TO-INPUT-TABLE.
           MOVE INPUT-TABLE-KEY TO INPUT-RECORD(1:10).
           MOVE INPUT-TABLE-DATA TO INPUT-RECORD(11:20).

       SORT-INPUT-TABLE.
           SORT INPUT-TABLE ASCENDING ON INPUT-TABLE-KEY.

       WRITE-OUTPUT-FILE.
           PERFORM REMOVE-FROM-INPUT-TABLE.
           MOVE OUTPUT-TABLE-KEY TO OUTPUT-RECORD(1:10).
           MOVE OUTPUT-TABLE-DATA TO OUTPUT-RECORD(11:20).
           WRITE OUTPUT-RECORD.
           MOVE " " TO OUTPUT-RECORD.

       REMOVE-FROM-INPUT-TABLE.
           MOVE INPUT-TABLE(1) TO OUTPUT-TABLE.
           SHIFT INPUT-TABLE LEFT.
           SET INPUT-TABLEIDX TO INPUT-TABLEIDX - 1.

       EXIT-READ.
           MOVE ZEROES TO INPUT-RECORD.
           MOVE ZEROES TO OUTPUT-RECORD.
           MOVE ZEROES TO INPUT-TABLE.
           MOVE ZEROES TO OUTPUT-TABLE.
           DISPLAY "END OF FILE REACHED. SORTING COMPLETE.".