IDENTIFICATION DIVISION.     //Start of identification division
       PROGRAM-ID. MAIN.            //Program name is MAIN
       DATA DIVISION.               //Start of data division
       WORKING-STORAGE SECTION.     //Declaration of working-storage section
       01 A PIC 999 VALUE 100.       //Declare variable A with initial value of 100
       01 B PIC 999 VALUE 200.       //Declare variable B with initial value of 200
       01 SUM PIC 999 VALUE ZEROES.  //Declare variable SUM with initial value of 0
       PROCEDURE DIVISION.           //Start of procedure division
       ADD A B GIVING SUM.           //Add variables A and B, store result in SUM
       DISPLAY 'The sum of A and B is: ' SUM  //Display the result
       STOP RUN.                     //End program execution