IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMA PIC 99.
01 NUMB PIC S9(3) COMP.
01 RESULT PIC S9(5) COMP.

PROCEDURE DIVISION.

MAIN SECTION.
DISPLAY "Enter first number: ".
ACCEPT NUMA.
DISPLAY "Enter second number: ".
ACCEPT NUMB.

COMPUTE RESULT = NUMA + NUMB.

DISPLAY "The sum of the two numbers is: ".
DISPLAY RESULT.

STOP RUN.