IDENTIFICATION DIVISION.
       PROGRAM-ID. CODING.
       AUTHOR. YOUR-NAME. 

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM-ONE        PIC 9(3) VALUE 100.
       01  NUM-TWO        PIC 9(3) VALUE 200.
       01  RESULT         PIC 9(5) VALUE 0.

       PROCEDURE DIVISION.
       ADD-VALUES.
           ADD NUM-ONE TO RESULT.
           ADD NUM-TWO TO RESULT.
           DISPLAY "The sum of " NUM-ONE " and " NUM-TWO " is " RESULT.
       MULTIPLY-VALUES.
           MULTIPLY NUM-ONE BY NUM-TWO GIVING RESULT.
           DISPLAY "The product of " NUM-ONE " and " NUM-TWO " is " RESULT.
       END PROGRAM CODING.