DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EMPLOYEE-TABLE.
           03 EMPLOYEE-RECORD OCCURS 10 
              INDEXED BY I.
               05 EMPLOYEE-ID             PIC 99.
               05 EMPLOYEE-NAME           PIC X(20).
               05 EMPLOYEE-DEPARTMENT     PIC X(10).
       01 DEPARTMENT-TABLE.
           03 DEPARTMENT-RECORD OCCURS 5
              INDEXED BY J.
               05 DEPARTMENT-NAME         PIC X(10).
               05 DEPARTMENT-LOCATION     PIC X(20).
       01 INDEX-TABLE-DEPARTMENT.
           03 INDEX-DEPARTMENT.
               05 INDEX1 PIC 99 OCCURS 5.
       01 INDEX-TABLE-EMPLOYEE.
           03 INDEX-EMPLOYEE.
               05 INDEX2 PIC 99 OCCURS 10.
       PROCEDURE DIVISION.
       100-MAIN-PROGRAM.
           PERFORM 200-INITIALIZE-EMPLOYEE-TABLE.
           PERFORM 300-INITIALIZE-DEPARTMENT-TABLE.
           PERFORM 400-POPULATE-INDEX-DEPARTMENT.
           PERFORM 500-POPULATE-INDEX-EMPLOYEE.
           PERFORM 600-PRINT-EMPLOYEE-INFO.
           STOP RUN.
       200-INITIALIZE-EMPLOYEE-TABLE.
           PERFORM VARYING I FROM 1 BY 1 
           UNTIL I > 10
           MOVE ZEROS TO EMPLOYEE-ID (I)
                   EMPLOYEE-NAME (I)
                   EMPLOYEE-DEPARTMENT (I).
       300-INITIALIZE-DEPARTMENT-TABLE.
           PERFORM VARYING J FROM 1 BY 1 
           UNTIL J > 5
           MOVE ZEROS TO DEPARTMENT-NAME (J)
                   DEPARTMENT-LOCATION (J).
       400-POPULATE-INDEX-DEPARTMENT.
           SET J TO 1
           PERFORM VARYING I FROM 1 BY 2
           UNTIL I > 10
           IF DEPARTMENT-TABLE (J) = SPACE
           ADD 1 TO J
           END-IF
           MOVE I TO INDEX1 (J)
           MOVE DEPARTMENT-NAME (J) TO INDEX1 (J).
       500-POPULATE-INDEX-EMPLOYEE.
           SET J TO 1
           PERFORM VARYING I FROM 1 BY 1
           UNTIL I > 10
           IF EMPLOYEE-TABLE (I) = SPACE
           ADD 1 TO J
           END-IF
           MOVE I TO INDEX2 (J)
           MOVE EMPLOYEE-ID (I) TO INDEX2 (J).
       600-PRINT-EMPLOYEE-INFO.
           PERFORM VARYING J FROM 1 BY 1
           UNTIL J > 5
           PERFORM VARYING I FROM 1 BY 1
           UNTIL I > 10
           IF INDEX-DEPARTMENT (J) = DEPARTMENT-TABLE (I)
           DISPLAY "Employee ID:" INDEX-EMPLOYEE (I)
                   "Employee Name:" EMPLOYEE-NAME (I)
                   "Employee Department:" DEPARTMENT-NAME (J)
                   "Department Location:" DEPARTMENT-LOCATION (J).