IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.

      * This program performs basic arithmetic operations
      * This section declares the working-storage variables

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4)V9(2).
       01 NUM2 PIC 9(4)V9(2).
       01 RESULT PIC S9(6)V9(3).
       01 OPERATOR PIC X.

      * This section contains the procedure division

       PROCEDURE DIVISION.
       PARAGRAPH 1.
           DISPLAY "Welcome to the Calculator program!".
           DISPLAY "Please enter the first number: ".
           ACCEPT NUM1.
           DISPLAY "Please enter the second number: ".
           ACCEPT NUM2.
           DISPLAY "Please select the operation (+, -, *, /): ".
           ACCEPT OPERATOR.

      * This section performs arithmetic operations based on selected operator

           IF OPERATOR = '+'
               ADD NUM1, NUM2 GIVING RESULT
           ELSE IF OPERATOR = '-'
               SUBTRACT NUM2 FROM NUM1 GIVING RESULT
           ELSE IF OPERATOR = '*'
               MULTIPLY NUM1 BY NUM2 GIVING RESULT
           ELSE IF OPERATOR = '/'
               DIVIDE NUM1 BY NUM2 GIVING RESULT

      * Display the result to the user

           DISPLAY "The result is: " RESULT.

       STOP RUN.