01  LIST-OF-NAMES.
       03  NUM-OF-NAMES PIC 99.
       03  NAMES OCCURS NUM-OF-NAMES TIMES.
           05  NAME PIC X(20).
           05  AGE PIC 9(3).
           05  ADDRESS PIC X(50).
           05  SALARY PIC 9(7)V99.

       01  OUTPUT-FILE.
       03  RECS-OUT PIC 99 USAGE DISPLAY VALUE ZERO.
       03  LINE-OUT PIC X(75).

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE

       EXEC SQL
           DECLARE cursor1 CURSOR FOR
           SELECT *
           FROM EMPLOYEES
           WHERE AGE > 30
           ORDER BY SALARY DESC

       EXEC SQL
           PREPARE sql_statement FROM :cursor1

       EXEC SQL
           OPEN cursor1

       PERFORM UNTIL SQLCODE NOT = 0
           EXEC SQL
               FETCH NEXT FROM cursor1 INTO :LIST-OF-NAMES
           IF SQLCODE = 0
               MOVE LIST-OF-NAMES (NUM-OF-NAMES) TO LINE-OUT
               WRITE LINE FROM LINE-OUT
               ADD 1 TO RECS-OUT
       END-PERFORM

       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE
       STOP RUN.