IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM1.
      * SIMPLE CALCULATOR
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(2).
       01 NUM2 PIC 9(2).
       01 ANS PIC 9(2).
       PROCEDURE DIVISION.
       DISPLAY "ENTER FIRST NUMBER: ".
       ACCEPT NUM1.
       DISPLAY "ENTER SECOND NUMBER: ".
       ACCEPT NUM2.
       ADD NUM1, NUM2 GIVING ANS.
       DISPLAY "ADDITION: " ANS.
       MULTIPLY NUM1, NUM2 GIVING ANS.
       DISPLAY "MULTIPLICATION: " ANS.
       DIVIDE NUM1 INTO NUM2 GIVING ANS.
       DISPLAY "DIVISION: " ANS.
       STOP RUN.