IDENTIFICATION DIVISION.        //start of program
       PROGRAM-ID. COBOLSNIPPET.       //defining program name
 
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT IN-FILE ASSIGN TO "data.txt".   //input file named data.txt
          SELECT OUT-FILE ASSIGN TO "output.txt". //output file named output.txt
 
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 INPUT-REC.
          05 IN-NAME          PIC X(20).         //field for name, max of 20 characters
          05 IN-AGE           PIC 99.           //field for age, max of 2 digits
          05 IN-ADDRESS       PIC X(50).         //field for address, max of 50 characters
 
       FD OUT-FILE.
       01 OUTPUT-REC.
          05 OUT-NAME         PIC X(20).         //field for name to be output
          05 OUT-AGE          PIC 99.           //field for age to be output
          05 OUT-ADDRESS      PIC X(50).         //field for address to be output
 
       WORKING-STORAGE SECTION.
       01 ERROR-FLAG         PIC 99.           //variable to indicate if error occurs
 
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
          OPEN INPUT IN-FILE,         //opening input and output files
               OUTPUT OUT-FILE.
          SET ERROR-FLAG TO 0.       //setting error flag to initial value
 
          PERFORM UNTIL ERROR-FLAG = 1     //loop until error flag equals 1
             READ IN-FILE INTO INPUT-REC   //read input record
               AT END SET ERROR-FLAG TO 1 //if end of file, set error flag to 1
             END-READ.
 
             IF ERROR-FLAG = 0                //if no error
                MOVE IN-NAME TO OUT-NAME      //move name field to corresponding output field
                MOVE IN-AGE TO OUT-AGE        //move age field to corresponding output field
                MOVE IN-ADDRESS TO OUT-ADDRESS  //move address field to corresponding output field
                WRITE OUTPUT-REC               //write output record
             END-IF.
 
          END-PERFORM.
 
          CLOSE IN-FILE, OUT-FILE.              //close input and output files
 
          STOP RUN.                            //end program
       END PROGRAM COBOLSNIPPET.