IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-PROGRAM.
       AUTHOR. YOUR NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE  ASSIGN TO 'INPUT.TXT'.
           SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 IN-RECORD.
           05 IN-PERSON-NAME    PIC X(20).
           05 IN-PERSON-AGE     PIC 99.
           05 IN-PERSON-HEIGHT  PIC 9(3).
           05 IN-PERSON-WEIGHT  PIC 9(3).
       FD OUTPUT-FILE.
       01 OUT-RECORD   PIC X(80).

       WORKING-STORAGE SECTION.
       01 TOTAL-WORKING-STORAGE    BOOLEAN VALUE TRUE.
       01 TOTAL-PERSONS             PIC 9(3)  VALUE 0.
       01 TOTAL-AGE                 PIC 9(3)  VALUE 0.
       01 TOTAL-HEIGHT              PIC 9(3)  VALUE 0.
       01 TOTAL-WEIGHT              PIC 9(3)  VALUE 0.

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE.

       PERFORM UNTIL TOTAL-WORKING-STORAGE = FALSE
            READ INPUT-FILE
                AT END
                    TOTAL-WORKING-STORAGE = FALSE
                NOT AT END
                    ADD 1 TO TOTAL-PERSONS
                    ADD IN-PERSON-AGE TO TOTAL-AGE
                    ADD IN-PERSON-HEIGHT TO TOTAL-HEIGHT
                    ADD IN-PERSON-WEIGHT TO TOTAL-WEIGHT
                    MOVE IN-PERSON-NAME TO OUT-RECORD
                    WRITE OUT-RECORD
            END-READ
       END-PERFORM.

       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE.

       DISPLAY 'Total Persons: ' TOTAL-PERSONS.
       DISPLAY 'Average Age: ' TOTAL-AGE/TOTAL-PERSONS.
       DISPLAY 'Average Height: ' TOTAL-HEIGHT/TOTAL-PERSONS.
       DISPLAY 'Average Weight: ' TOTAL-HEIGHT/TOTAL-PERSONS.

       STOP RUN.