IDENTIFICATION DIVISION.                                  /* Start of Identification Division, required for all COBOL programs */
          PROGRAM-ID. MULTIPLY-ARRAY.                               /* Program name */
          DATA DIVISION.                                            /* Start of Data Division, variable and file declarations */
          WORKING-STORAGE SECTION.                                  /* Start of Working-Storage Section, used to declare variables */
          01 ARRAY-SIZE       PIC 9(3) VALUE 10.                     /* Level-01 variable, holds size of array */
          01 MULTIPLIER       PIC 9(3) VALUE 5.                      /* Level-01 variable, holds multiplier value */
          01 RESULT           PIC 9(5)V9(2) OCCURS 10 TIMES.         /* Level-01 array, holds result of multiplication */
          PROCEDURE DIVISION.                                       /* Start of Procedure Division, where logic is written */
             PERFORM VARYING X FROM 1 BY 1 UNTIL X > ARRAY-SIZE     /* Perform loop for index X, from 1 to array size */
                IF X MOD 2 = 0                                      /* If X is an even number */
                   MULTIPLY ARRAY-SIZE BY MULTIPLIER GIVING RESULT(X) /* Multiply array size by multiplier and store result in result array at position X */
                ELSE                                                 /* If X is an odd number */
                   DIVIDE ARRAY-SIZE BY MULTIPLIER GIVING RESULT(X)  /* Divide array size by multiplier and store result in result array at position X */
             END-PERFORM.                                            /* End of perform loop */
          END PROGRAM MULTIPLY-ARRAY.                                /* End of Program Multiply-Array */