IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 999.
01 NUM2 PIC 999.
01 RESULT PIC 999.
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "Enter first number: "
    ACCEPT NUM1
    DISPLAY "Enter second number: "
    ACCEPT NUM2

    IF NUM2 IS ZERO
        DISPLAY "Division by zero error"
    ELSE
        DIVIDE NUM1 BY NUM2 GIVING RESULT
        DISPLAY "Result is: " RESULT
    END-IF

    COMPUTE NUM1 = NUM1 + 10
    DISPLAY "Num1 value after addition: " NUM1

    DISPLAY "Checking if NUM1 is greater than NUM2"

    IF NUM1 > NUM2
        DISPLAY "NUM1 is greater than NUM2"
    ELSE
        DISPLAY "NUM1 is not greater than NUM2"
    END-IF.

END PROGRAM TEST-PROGRAM.