IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

      **************************************************
      * THIS PROGRAM CHECKS THE INPUT FOR NUMBER OR *
      * LETTER. IF NUMBER THEN MULTIPLIES BY 2 AND       *
      * IF LETTER THEN ADDS ASCII VALUE OF 'A' TO IT *
      *  THEN PRINTS THE RESULT *
      **************************************************

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.

        SELECT TEST ASSIGN TO "INPUT.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

      DATA DIVISION.
      FILE SECTION.

      FD TEST.
      01 MESSAGE-AREA.
         05 MESSAGE PIC X(10).

      WORKING-STORAGE SECTION.

      01 CHAR PIC X(1).
      01 RESULT PIC 9(15).
      01 ASCII PIC 9(5).

      PROCEDURE DIVISION.
           OPEN INPUT TEST.
           
      RUMMY.           
           READ TEST
                AT END
                   GO TO YEND-OF-DATA
                NOT AT END
                   PERFORM CHECK.
           GO TO RUMMY.
           
      CHECK.      
           MOVE CHAR TO MESSAGE-AREA.
           INSPECT CHAR TALLYING COUNT FOR ALL "A" THROUGH "Z".
           IF COUNT = 1 THEN
                COMPUTE RESULT = FUNCTION ASCII-OF(CHAR) + FUNCTION ASCII-OF("A").
           ELSE
                MULTIPLY RESULT BY 2.
           DISPLAY RESULT.
           
      END-OF-DATA.
           CLOSE TEST.
           STOP RUN.