IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-HELLO PIC X(16) VALUE 'HELLO, WORLD!'.

       PROCEDURE DIVISION.
       DISPLAY WS-HELLO.
       STOP RUN.

       END PROGRAM HELLO-WORLD.