IDENTIFICATION DIVISION.
      PROGRAM-ID. EXAMPLE.

      ENVIRONMENT DIVISION.
      DATA DIVISION.

      WORKING-STORAGE SECTION.

      01 WS-EMPLOYEES.
         02 EMPLOYEE-NAMES.

            05 EMPLOYEE-NAME PIC X(20) OCCURS 5 TIMES.
               10 FIRST-NAME PIC X(10).
               10 LAST-NAME PIC X(10).

      PROCEDURE DIVISION.
      MAIN-PROGRAM.

      IF WS-EMPLOYEES(2).FIRST-NAME = "John"
      AND WS-EMPLOYEES(2).LAST-NAME = "Smith"
         DISPLAY "Employee #2 is John Smith".

      STOP RUN.