IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATOR.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 FEEDBACK PIC X(10) VALUE "OPERATION:".
      01 NUM1 PIC 9(5)V9(2) VALUE 0.
      01 NUM2 PIC 9(5)V9(2) VALUE 0.
      01 RESULT PIC 9(6)V9(2) VALUE 0.
      01 OPERATION PIC X(1) VALUE SPACE.
      01 EXIT PIC X(1) VALUE 'N'.
      01 ERROR-MSG PIC X(20).
      PROCEDURE DIVISION.
      MAIN-PARA.
          PERFORM UNTIL EXIT = 'Y'
              DISPLAY FEEDBACK UPON CONSOLE.
              DISPLAY "ENTER FIRST NUMBER: " UPON CONSOLE.
              ACCEPT NUM1 FROM CONSOLE.
              DISPLAY "ENTER SECOND NUMBER: " UPON CONSOLE.
              ACCEPT NUM2 FROM CONSOLE.
              DISPLAY "ENTER OPERATION (+, -, *, /): " UPON CONSOLE.
              ACCEPT OPERATION FROM CONSOLE.
              PERFORM CALCULATE-PARA.
              DISPLAY "RESULT: " RESULT UPON CONSOLE.
              DISPLAY "DO YOU WANT TO PERFORM ANOTHER OPERATION (Y/N)? " UPON CONSOLE.
              ACCEPT EXIT FROM CONSOLE.
          END-PERFORM.
          STOP RUN.
      CALCULATE-PARA.
          IF OPERATION = '+'
              COMPUTE RESULT = NUM1 + NUM2
          ELSE IF OPERATION = '-'
              COMPUTE RESULT = NUM1 - NUM2
          ELSE IF OPERATION = '*'
              COMPUTE RESULT = NUM1 * NUM2
          ELSE IF OPERATION = '/'
              DIVIDE NUM1 BY NUM2 GIVING RESULT
          ELSE
              MOVE "INVALID OPERATION" TO ERROR-MSG
              DISPLAY ERROR-MSG UPON CONSOLE.
      END PROGRAM CALCULATOR.