IDENTIFICATION DIVISION.
      PROGRAM-ID. HelloWorld.

      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 WS-NAME PIC X(20) VALUE 'WORLD'.
      01 WS-MSG PIC X(30) VALUE 'HELLO'.

      PROCEDURE DIVISION.
      DISPLAY WS-MSG, " ", WS-NAME.
      STOP RUN.