IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ARRAYS OCCURS 10 TIMES.
          05 NUM-PAR1 PIC 9(5)V9(2).
          05 NUM-PAR2 PIC 9(5)V9(2).
          05 RESULT PIC S9(5)V9(2).
       01 INDEX PIC 9(2).
       PROCEDURE DIVISION.
       PERFORM VARYING INDEX
                  FROM 1 BY 1
                  UNTIL INDEX > 10
                  SUBTRACT NUM-PAR2 (INDEX)
                          FROM NUM-PAR1 (INDEX)
                          GIVING RESULT (INDEX).
       EXIT.
       STOP RUN.