identification division.
program-id. example.

environment division.
input-output section.
file-control.
select file-1 assign to 'input-file.txt'.
select file-2 assign to 'output-file.txt'.
select file-3 assign to 'error-file.txt'.

data division.
file section.
fd file-1.
01 input-file-record.
   05 employee-id pic x(5).
   05 employee-name pic x(20).
   05 employee-salary pic 9(6).

fd file-2.
01 output-file-record.
   05 employee-id pic x(5).
   05 employee-name pic x(20).
   05 employee-salary pic 9(6).
   05 bonus-amount pic 9(6).

fd file-3.
01 error-file-record.
   05 error-message pic x(50).

working-storage section.
01 temp-employee-salary pic 9(6).
01 temp-bonus-amount pic 9(6).

procedure division.
open input file-1.
open output file-2.
open output file-3.

perform until file-1 end-of-file
	read file-1
	at end display 'End of file reached.'
		not at end
			perform calculate-bonus
			write file-2 from output-file-record
			if bonus-amount > 2000
				write file-3 from error-file-record
	end-read
end-perform.

close file-1.
close file-2.
close file-3.

calculate-bonus.
if employee-salary < 10000
	multiply employee-salary by 0.15 giving temp-bonus-amount.
else if employee-salary >= 10000 and employee-salary < 20000
	multiply employee-salary by 0.12 giving temp-bonus-amount.
else if employee-salary >= 20000 and employee-salary < 30000
	multiply employee-salary by 0.08 giving temp-bonus-amount.
else
	move 0 to temp-bonus-amount.
end-if.
move employee-id to output-file-record.
move employee-name to output-file-record.
move employee-salary to output-file-record.
move temp-bonus-amount to output-file-record.