IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-PAY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       DATA DIVISION.
       FILE SECTION.
       FD  EMPLOYEE-FILE
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 20 RECORDS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EMPLOYEE-REC.

       WORKING-STORAGE SECTION.
       01  EMPLOYEE-REC.
           05  EMPLOYEE-ID     PIC X(10).
           05  EMPLOYEE-NAME   PIC X(30).
           05  EMPLOYEE-SSN    PIC X(9).
           05  HOURS-WORKED    PIC 9(9)V99.
           05  HOURLY-RATE     PIC 9(9)V99.
           05  GROSS-PAY       PIC 9(9)V99.
           05  FED-TAX         PIC 9(9)V99.
           05  STATE-TAX       PIC 9(9)V99.

       PROCEDURE DIVISION.
       PERFORM UNTIL EMPLOYEE-ID = 'END'
           DISPLAY 'ENTER EMPLOYEE ID (OR END TO EXIT): '
           ACCEPT EMPLOYEE-ID
           IF EMPLOYEE-ID NOT = 'END'
               DISPLAY 'ENTER EMPLOYEE NAME: '
               ACCEPT EMPLOYEE-NAME
               DISPLAY 'ENTER SOCIAL SECURITY NUMBER: '
               ACCEPT EMPLOYEE-SSN
               DISPLAY 'ENTER HOURS WORKED: '
               ACCEPT HOURS-WORKED
               DISPLAY 'ENTER HOURLY RATE: '
               ACCEPT HOURLY-RATE
               COMPUTE GROSS-PAY = HOURS-WORKED * HOURLY-RATE
               IF GROSS-PAY > 1000
                   COMPUTE FED-TAX = GROSS-PAY * .25
               ELSE
                   COMPUTE FED-TAX = GROSS-PAY * .15
               END-IF
               COMPUTE STATE-TAX = GROSS-PAY * .05
               WRITE EMPLOYEE-REC
           END-IF
       END-PERFORM.

       CLOSE EMPLOYEE-FILE.
       STOP RUN.