Identification Division.                       
       Program-ID. Generate-Random-Numbers.                      
       Environment Division.                       
       Configuration Section.                       
       Source-Computer. IBM-PC.                       
       Object-Computer. IBM-PC.                       
       Special-Names.                       
           Decimal-Point is Comma.                       
       Data Division.                       
       Working-Storage Section.                       
       01 Random-Number.                       
           05 Seed-Value Picture X(4) Value 'RAND'.                       
           05 Random-Value Picture 9(8).                       
       Linkage Section.                       
       01 Parameters.                       
           05 Num-Numbers Picture 9(2).                       
           05 Min-Value Picture S9(4) COMP Value -1000.                       
           05 Max-Value Picture S9(4) COMP Value 1000.                       
           05 Output-Array Usage Index Output-Idx.                       
               06 Output-Element Picture S9(4) COMP Occurs 1000 Times.                       
       Procedure Division USING Parameters.                       
       Main-Logic Section.                       
           Perform Generate-Random-Number Varying Output-Idx From 1 By 1                       
               Until Output-Idx > Num-Numbers.                       
       Generate-Random-Number Section.                       
           Compute Random-Value = (Max-Value - Min-Value + 1) * Random-Value                       
               / (1000 - Min-Value + 1) + Min-Value.                       
           Set Random-Number to Random-Value.                       
       End-Program.