IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
      *----- DATA DIVISION -----
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-NUMBER PIC 9(5) VALUE 50000.
       01 DISCOUNT-RATE PIC 9(3)V9(2) VALUE 0.
       01 DISCOUNT-DOLLARS PIC 9(6)V9(2) VALUE 0.
      *----- PROCEDURE DIVISION -----
       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
           COMPUTE DISCOUNT-RATE = 0.05.
           MULTIPLY INPUT-NUMBER BY DISCOUNT-RATE GIVING DISCOUNT-DOLLARS.
       DISPLAY "Discount rate: " DISCOUNT-RATE.
       DISPLAY "Discount amount: " DISCOUNT-DOLLARS.
       STOP RUN.