identification division.

 program-id. PAYROLL.

 environment division.
 configuration section.
    source-computer. IBM PC.
    object-computer. IBM PC.

 data division.

 working-storage section.
 01 employee.
    05 emp-name pic x(20).
        88 name-changed value "Y".
    05 emp-id pic 9(6).
    05 emp-age pic 9(2).
    05 emp-salary pic 9(5).
    05 emp-gender pic x.  
        88 male value "M".
        88 female value "F".

 procedure division.
    accept employee.
    inspect emp-salary replacing all "@$" by "*".

    if emp-age > 60
        display "Employee is eligible for senior citizen benefits."
    end-if
    else
        add emp-salary, 500 to emp-salary
    end-if

    if female
        display "Employee is eligible for maternity leave."
    else if male
        display "Employee is eligible for paternity leave."
    else
        display "Employee gender not specified."
    end-if

    if emp-name is not alphanumeric
        multiply emp-salary by 1.05 giving emp-salary
    end-if

    display "Employee name: ", emp-name
    display "Employee ID: ", emp-id
    display "Employee age: ", emp-age
    display "Employee salary: ", emp-salary
    display "Employee gender: ", emp-gender

    stop run.