ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT FILE-NAME ASSIGN TO "MYFILE".
DATA DIVISION.
FILE SECTION.
FD FILE-NAME.
01 RECORD.
03 ID-NUM PIC 9(5).
03 NAME PIC X(20).
03 GRADE PIC 9(3).
WORKING-STORAGE SECTION.
77 TOTAL-GRADE PIC 9(4)V9(2).
77 AVERAGE-GRADE PIC Z(3).9(2).
77 HIGH-GRADE PIC 9(3).
77 LOW-GRADE PIC 9(3).
PROCEDURE DIVISION.
PERFORM OPEN-FILE
PERFORM READ-FILE
PERFORM UNTIL EOF
    ADD GRADE TO TOTAL-GRADE
    IF GRADE > HIGH-GRADE
        MOVE GRADE TO HIGH-GRADE
    END-IF
    IF GRADE < LOW-GRADE
        MOVE GRADE TO LOW-GRADE
    END-IF
    PERFORM READ-FILE
END-PERFORM
DIVIDE TOTAL-GRADE BY 100
    GIVING AVERAGE-GRADE
DISPLAY "The average grade is: " AVERAGE-GRADE
DISPLAY "The highest grade is: " HIGH-GRADE
DISPLAY "The lowest grade is: " LOW-GRADE
CLOSE FILE-NAME.

OPEN-FILE.
OPEN INPUT FILE-NAME
END-OPEN.

READ-FILE.
READ FILE-NAME
AT END SET EOF TO TRUE
END-READ.