WORKING-STORAGE SECTION.
       01  MONTHS-BETWEEN PIC S9(4) COMP-3.
       01  DISCOUNT-RATE PIC S9(7)V99 VALUE 10.50.
       01  LOAN-AMOUNT PIC S9(9)V99 VALUE 25000.00.
       01  INTEREST-AMOUNT PIC S9(9)V99 VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           DISPLAY "Welcome to the Interest Calculator!".
           ACCEPT months-from-user.
           MOVE months-from-user TO MONTHS-BETWEEN.
           IF MONTHS-BETWEEN < 12 THEN
               MULTIPLY LOAN-AMOUNT BY (DISCOUNT-RATE-1 / MONTHS-BETWEEN) GIVING INTEREST-AMOUNT
           ELSE
               MULTIPLY LOAN-AMOUNT BY DISCOUNT-RATE GIVING INTEREST-AMOUNT
           END-IF.
           DISPLAY "The interest amount is: ", INTEREST-AMOUNT.
       END PROGRAM MAIN-PROGRAM.