IDENTIFICATION DIVISION.                           //The identification division is used to identify the program.
       PROGRAM-ID. CALCULATOR.                             //The unique program name.
       DATA DIVISION.                                      //The data division contains the data used in the program.
       WORKING-STORAGE SECTION.                            //The working storage section is used for variables and data used during execution.
       01 NUM1        PIC 9(3).                            //Declare variable NUM1 to store 3-digit number.
       01 NUM2        PIC 9(3).                            //Declare vairable NUM2 to store 3-digit number.
       01 RESULT      PIC 9(5) VALUE 0.                    //Declare variable RESULT to store result of calculation, with value 0 assigned.
       PROCEDURE DIVISION.                                 //The procedure division contains the main program logic.
       MAIN-PARA.                                          //Main procedure paragraph.
           DISPLAY "Please enter two numbers:"             //Display message asking user to enter two numbers to be calculated.
           ACCEPT NUM1.                                    //Accept first number from user and store in NUM1.
           ACCEPT NUM2.                                    //Accept second number from user and store in NUM2.
           COMPUTE RESULT = NUM1 + NUM2.                   //Compute addition of NUM1 and NUM2, and store in RESULT.
           DISPLAY "The sum of the two numbers is: " RESULT //Display the result of the addition.
           STOP RUN.                                       //End the program.