IDENTIFICATION DIVISION.                            //Denotes beginning of program
PROGRAM-ID. COBOL_PROG.                             //Program name
ENVIRONMENT DIVISION.                               //Denotes configuration of system
INPUT-OUTPUT SECTION.                               //Denotes input/output devices
FILE-CONTROL.                                       //Control of files to be used
SELECT IN-FILE ASSIGN TO 'input.dat'                 //Selects input file
        ORGANIZATION IS SEQUENTIAL.                  //Sequential access mode
SELECT OUT-FILE ASSIGN TO 'output.dat'               //Selects output file
        ORGANIZATION IS SEQUENTIAL                  //Sequential access mode
DATA DIVISION.                                       //Denotes variables and data structures
FILE SECTION.                                        //Declare files to be used
FD IN-FILE.                                          //File descriptor for input file
01 IN-RECORD.                                        //Defines structure of input file records
    02 EMPLOYEE-ID PIC 99.                           //Employee ID to be read
    02 EMPLOYEE-NAME PIC X(20).                      //Employee name to be read
WORKING-STORAGE SECTION.                             //Temporary variables used for calculations
01 TEMP-VAR PIC 99.                                   //Temporary variable for storing values
PROCEDURE DIVISION.                                   //Denotes action to be taken
READ-IN-FILE.                                         //Reads in a record from input file
    PERFORM UNTIL FILE STATUS = 10                    //Loops until end of file
        READ IN-FILE INTO IN-RECORD                   //Reads record into data structure
        IF EMPLOYEE-ID = 01                          //Checks if employee ID is equal to 01
            ADD 1 TO TEMP-VAR                         //Increments temporary variable
        END-IF.
    END-PERFORM.
WRITE-OUT-FILE.                                       //Writes to output file
    MOVE TEMP-VAR TO OUT-RECORD.                       //Moves value of temporary variable to output record
    WRITE OUT-FILE FROM OUT-RECORD.                    //Writes output record to file
CLOSE-FILES.                                          //Close input and output files
    CLOSE IN-FILE, OUT-FILE.
STOP RUN.                                             //End of program