DISPLAY "Enter the number of terms to generate" LINE 1 COLUMN 1
ACCEPT N-TERMS LINE 5 COLUMN 1

IF N-TERMS < 2
    DISPLAY "Number of terms cannot be less than 2" LINE 10 COLUMN 1
ELSE
    ADD 0 TO FIB-ONE
    ADD 1 TO FIB-TWO
    DISPLAY FIB-ONE LINE 14 COLUMN 1
    DISPLAY FIB-TWO LINE 15 COLUMN 1
    ADD 2 TO COUNTER
    PERFORM VARYING COUNTER FROM 3 BY 1 UNTIL COUNTER > N-TERMS
        COMPUTE NEXT-FIB = FIB-ONE + FIB-TWO
        DISPLAY NEXT-FIB LINE COUNTER COLUMN 1
        SET FIB-ONE TO FIB-TWO
        SET FIB-TWO TO NEXT-FIB
    END-PERFORM
END-IF.