IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDITION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4).
       01 NUM2 PIC 9(4).
       01 RESULT PIC 9(5).
       PROCEDURE DIVISION.

       *This is a comment line*

       DISPLAY "Enter first number: ".
       ACCEPT NUM1.

       DISPLAY "Enter second number: ".
       ACCEPT NUM2.

       COMPUTE RESULT = NUM1 + NUM2.

       DISPLAY "The result is: " RESULT.

       STOP RUN.