IDENTIFICATION DIVISION.                                         // This is the identification division of the program
       PROGRAM-ID. HELLO-WORLD.                                          // This is the program name
       DATA DIVISION.                                                   // This is the data division where all data declarations are made
       WORKING-STORAGE SECTION.                                         // This is the section where working storage data is declared
       01 MESSAGE-TEXT PIC X(20) VALUE "HELLO, WORLD".                   // This is a variable called 'MESSAGE-TEXT' with a size of 20 characters, initialized with "HELLO, WORLD"
       PROCEDURE DIVISION.                                               // This is the procedure division where the actual logic of the program is written
       DISPLAY MESSAGE-TEXT.                                             // This statement displays the value of 'MESSAGE-TEXT' on the screen
       STOP RUN.                                                        // This statement stops the program from running
       END PROGRAM HELLO-WORLD.                                          // This marks the end of the program