IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-AREA.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LENGTH PIC 9(3).
01 BREADTH PIC 9(3).
01 AREA PIC 9(6)V99.

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "ENTER THE LENGTH OF THE RECTANGLE: ".
    ACCEPT LENGTH.
    DISPLAY "ENTER THE BREADTH OF THE RECTANGLE: ".
    ACCEPT BREADTH.
    COMPUTE AREA = LENGTH * BREADTH.
    DISPLAY "THE AREA IS: " AREA "."
    STOP RUN.
END PROGRAM CALC-AREA.