IDENTIFICATION DIVISION.                                 
           PROGRAM-ID. CALCULATE-SUM.                *Program to calculate sum of two values
           ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT IN-FILE ASSIGN TO "INPUT.DAT".         *Input file declaration
               SELECT OUT-FILE ASSIGN TO "OUTPUT.DAT".       *Output file declaration
           DATA DIVISION.
           FILE SECTION.
           FD IN-FILE.
           01  IN-REC.
               05  NUM1-PIC S9(4)V9(2).
               05  NUM2-PIC S9(4)V9(2).
           FD OUT-FILE.
           01  OUT-REC.
               05  TEMP  PIC S9(6)V9(2).
           WORKING-STORAGE SECTION.
           77  SUM PIC S9(7)V9(2).                     *Variable to hold sum
           PROCEDURE DIVISION.
           MAIN.
               OPEN INPUT IN-FILE.
               OPEN OUTPUT OUT-FILE.
               READ IN-FILE INTO IN-REC.             *Read values from input file
           CALCULATE-SUM.
               COMPUTE SUM = NUM1 + NUM2.            *Calculate the sum of the two values
               MOVE SUM TO TEMP.                     *Move sum to temporary variable
               WRITE OUT-REC.                        *Write the result to output file
               CLOSE IN-FILE.
               CLOSE OUT-FILE.
               STOP RUN.
           END PROGRAM CALCULATE-SUM.