* **********************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLCODE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-DATA.
           05 NUM-EMPLOYEE PIC 9(2).
       01 EMPLOYEE-TABLE.
           05 EMPLOYEE-REC OCCURS 0 TO 99 TIMES
               DEPENDING ON NUM-EMPLOYEE.
               10 EMPLOYEE-NAME PIC X(20).
               10 EMPLOYEE-ID PIC 9(5).
               10 EMPLOYEE-DEPT PIC 9(2).

       PROCEDURE DIVISION.
       MAIN-PROCESS.

           PERFORM READ-EMPLOYEES
           PERFORM CALCULATE-SALARY
           PERFORM PRINT-REPORT
           STOP RUN.

       * READS DATA FOR ALL EMPLOYEES
       READ-EMPLOYEES.
           PERFORM VARYING EMPLOYEE-CTR FROM 1 BY 1
               UNTIL EMPLOYEE-CTR > NUM-EMPLOYEE
               READ EMPLOYEE-REC INTO EMPLOYEE-TABLE(EMPLOYEE-CTR)
           END-PERFORM.

       * CALCULATES SALARY FOR EACH EMPLOYEE
       CALCULATE-SALARY.
           PERFORM VARYING EMPLOYEE-CTR FROM 1 BY 1
               UNTIL EMPLOYEE-CTR > NUM-EMPLOYEE
               IF EMPLOYEE-DEPT(EMPLOYEE-CTR) = 10
                   MOVE 1000 TO SALARY(EMPLOYEE-CTR)
               ELSE IF EMPLOYEE-DEPT(EMPLOYEE-CTR) = 20
                   MOVE 1500 TO SALARY(EMPLOYEE-CTR)
               ELSE IF EMPLOYEE-DEPT(EMPLOYEE-CTR) = 30
                   MOVE 2000 TO SALARY(EMPLOYEE-CTR)
               ELSE
                   MOVE 500 TO SALARY(EMPLOYEE-CTR)
           END-PERFORM.

       * PRINTS SALARY REPORT
       PRINT-REPORT.
           DISPLAY "EMPLOYEE NAME         SALARY".
           PERFORM VARYING EMPLOYEE-CTR FROM 1 BY 1
               UNTIL EMPLOYEE-CTR > NUM-EMPLOYEE
               DISPLAY EMPLOYEE-NAME(EMPLOYEE-CTR) "             " SALARY(EMPLOYEE-CTR)
           END-PERFORM.

       END PROGRAM COBOLCODE.