Data division.
    working-storage section.
       01 student-record
           02 first-name pic x(20).
           02 last-name pic x(20).
           02 grades occures 5 times.
               03 quiz pic 99.
               03 exam pic 99.
           02 gpa pic x(3).
       01 pass-fail.
           02 passed pic x value 'Y'.
           02 failed pic x value 'N'.

Procedure division.
    display 'Enter student first name: '.
    accept first-name.
    display 'Enter student last name: '.
    accept last-name.
    perform varying i from 1 by 1 until i > 5
        display 'Enter quiz grade ' i ' for student '.
        accept quiz(i).
        display 'Enter exam grade ' i ' for student '.
        accept exam(i).
    end-perform.
    calculate gpa = (quiz(1) * 0.2) + (exam(1) * 0.8).
    if gpa >= 70
        move passed to pass-fail.
    else
        move failed to pass-fail.
    end-if.
    display 'Student: ' first-name last-name.
    display 'Quiz Grades:'.
    perform varying i from 1 by 1 until i > 5
        display 'Quiz ' i ': ' quiz(i).
    end-perform.
    display 'Exam Grades:'.
    perform varying i from 1 by 1 until i > 5
        display 'Exam ' i ': ' exam(i).
    end-perform.
    display 'GPA: ' gpa.
    display 'Pass/Fail: ' pass-fail.
Stop run.