IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNT PIC 99 VALUE 0.
       PROCEDURE DIVISION.
       PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT = 10
       DISPLAY "HELLO WORLD" COUNT "TIMES".
       STOP RUN.