IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-PAYROLL.
*******************************************************************
* THIS PROGRAM CALCULATES THE PAYROLL FOR EMPLOYEES AT A COMPANY
* INPUT INCLUDES EMPLOYEE DETAILS SUCH AS NAME, HOURS WORKED, ETC.
* OUTPUT INCLUDES CALCULATED PAY AND RELATED EMPLOYEE DETAILS
*******************************************************************
DATA DIVISION.
* DEFINE DATA VARIABLES FOR EMPLOYEE DETAILS
01 EMPLOYEE-RECORD.
   05 EMPLOYEE-NAME       PIC X(20).
   05 HOURS-WORKED        PIC 99.
   05 WAGE-RATE           PIC 9(6)V99.
   05 CALCULATED-PAY      PIC 9(7)V99.
* DEFINE CONSTANTS FOR TAX CALCULATIONS
01 TAX-CONSTANTS.
   05 FEDERAL-PERCENTAGE   PIC 9(2).
      88 MAX-FED-PERCENTAGE VALUE 25.
   05 STATE-PERCENTAGE     PIC 9(2).
      88 MAX-STATE-PERCENTAGE VALUE 10.
   05 CITY-PERCENTAGE      PIC 9(2).
* DEFINE WORKING STORAGE SECTION FOR TEMPORARY CALCULATIONS
01 TAX-AMOUNT             PIC 9(7)V99.
01 FINAL-PAY              PIC 9(7)V99.

PROCEDURE DIVISION.
* START OF MAIN PROGRAM
BEGIN.
   DISPLAY "PAYROLL CALCULATION PROGRAM".
   ACCEPT EMPLOYEE-NAME.
   ACCEPT HOURS-WORKED.
   DISPLAY "ENTER WAGE RATE IN DOLLARS".
   ACCEPT WAGE-RATE.
   MULTIPLY HOURS-WORKED BY WAGE-RATE GIVING CALCULATED-PAY.
   DISPLAY "EMPLOYEE NAME:", EMPLOYEE-NAME.
   DISPLAY "HOURS WORKED:", HOURS-WORKED.
   DISPLAY "WAGE RATE:", WAGE-RATE.
   DISPLAY "CALCULATED PAY:", CALCULATED-PAY.
* CALCULATE FEDERAL TAX AMOUNT
   COMPUTE TAX-AMOUNT = CALCULATED-PAY * (FEDERAL-PERCENTAGE / 100).
* SET MAXIMUM FEDERAL TAX TO 25%
   IF TAX-AMOUNT > (CALCULATED-PAY * .25)
       MOVE CALCULATED-PAY * .25 TO TAX-AMOUNT.
* CALCULATE STATE TAX AMOUNT
   COMPUTE TAX-AMOUNT = CALCULATED-PAY * (STATE-PERCENTAGE / 100).
* SET MAXIMUM STATE TAX TO 10%
   IF TAX-AMOUNT > (CALCULATED-PAY * .10)
       MOVE CALCULATED-PAY * .10 TO TAX-AMOUNT.
* CALCULATE CITY TAX AMOUNT
   COMPUTE TAX-AMOUNT = CALCULATED-PAY * (CITY-PERCENTAGE / 100).
   IF TAX-AMOUNT > 0
       DISPLAY "CITY TAX AMOUNT:", TAX-AMOUNT.
* CALCULATE FINAL PAY
   COMPUTE FINAL-PAY = CALCULATED-PAY - TAX-AMOUNT.
   DISPLAY "FINAL PAY:", FINAL-PAY.

STOP RUN.
END PROGRAM CALCULATE-PAYROLL.