IDENTIFICATION DIVISION. // start of code section

PROGRAM-ID. HELLO-PGM. //program name

DATA DIVISION. //declaration of data

WORKING-STORAGE SECTION. //symbols declaration
01 WS-NAME PIC X(10) VALUE 'JOHN'. //variable declaration with initial value

PROCEDURE DIVISION. //start of code 

DISPLAY 'HELLO ' WS-NAME. //display statement

STOP RUN. //end of code section
END PROGRAM HELLO-PGM. //end of program