IDENTIFICATION DIVISION.
PROGRAM-ID. TESTPROG.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(10) VALUE "COBOL".
01 WS-LOOPS PIC 99 VALUE ZERO.
01 WS-INDEX PIC 99 VALUE ZERO.
01 WS-LETTER PIC X.

PROCEDURE DIVISION.
PERFORM DISPLAY-INTRO
PERFORM MAIN-LOOP
GOTO END-PROGRAM.

DISPLAY-INTRO.
DISPLAY "Welcome to the COBOL program example!"

MAIN-LOOP.
SET WS-LOOPS TO 10
PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > WS-LOOPS
    DISPLAY "Loop #" WS-INDEX "Running..."
    PERFORM HANDLE-LETTER
END-PERFORM.

HANDLE-LETTER.
SET WS-LETTER TO FUNCTION RANDOM-LETTER()
DISPLAY "Current letter: " WS-LETTER.

END-PROGRAM.
STOP RUN.

FUNCTION RANDOM-LETTER.
COMPUTE FUNCTION RANDOM(NUM1) = WS-INDEX
EVALUATE TRUE
WHEN WS-INDEX = 1
    SET FUNCTION ROUNDED(NUM2, 4) TO 65
WHEN WS-INDEX = 2
    SET FUNCTION ROUNDED(NUM2, 4) TO 66
WHEN WS-INDEX = 3
    SET FUNCTION ROUNDED(NUM2, 4) TO 67
WHEN WS-INDEX = 4
    SET FUNCTION ROUNDED(NUM2, 4) TO 68
WHEN WS-INDEX = 5
    SET FUNCTION ROUNDED(NUM2, 4) TO 69
WHEN WS-INDEX = 6
    SET FUNCTION ROUNDED(NUM2, 4) TO 70
WHEN WS-INDEX = 7
    SET FUNCTION ROUNDED(NUM2, 4) TO 71
WHEN WS-INDEX = 8
    SET FUNCTION ROUNDED(NUM2, 4) TO 72
WHEN WS-INDEX = 9
    SET FUNCTION ROUNDED(NUM2, 4) TO 73
WHEN WS-INDEX = 10
    SET FUNCTION ROUNDED(NUM2, 4) TO 74
END-EVALUATE.