IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-ORDER-TOTAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ORDER-TOTAL PIC 99V99.
01 ORDER-AMOUNT PIC 99V99.
...
01 ITEM-CODES.
05 ITEM-CODE PIC X(4) OCCURS 10 TIMES.
...
01 ITEM-PRICES.
05 ITEM-PRICE PIC 99V99 OCCURS 10 TIMES.

PROCEDURE DIVISION.
...
MAIN-PARA.
    PERFORM UNTIL ORDER-COMPLETE = 'Y'.
        DISPLAY "ENTER ITEM CODE: ".
        ACCEPT ITEM-CODE(INDEX).
        DISPLAY "ENTER ITEM PRICE: ".
        ACCEPT ITEM-PRICE(INDEX).
        COMPUTE ORDER-AMOUNT = ITEM-PRICE(INDEX) * QUANTITY(INDEX).
        ADD ORDER-AMOUNT TO ORDER-TOTAL.
...