IDENTIFICATION DIVISION.                    //Start of identification division
PROGRAM-ID.     CALCULATOR.                  //Program name
DATA DIVISION.                              //Start of data division
WORKING-STORAGE SECTION.                     //Data Declaration Section
01 A-NUMBER                            PIC 9(2) VALUE 12.          
01 B-NUMBER                            PIC 9(2) VALUE 2.         
01 RESULT                               PIC 9(2).         
01 OPERATOR                             PIC X VALUE '+'.           
 PROCEDURE DIVISION.                      //Start of procedure division                    
START-PROC.                                     //Procedure name
 DISPLAY "WELCOME TO THE CALCULATOR PROGRAM!".     //Displaying a welcome message 
 DISPLAY "THE NUMBERS ARE 12 AND 2".                //Displaying the numbers used in calculation
 DISPLAY "THE OPERATOR IS +".                      //Displaying the operator used in calculation
 ADD A-NUMBER TO B-NUMBER GIVING RESULT.           //Adding the two numbers and storing the result in RESULT
 DISPLAY "THE RESULT IS: ", RESULT.                //Displaying the result
STOP-PROC.                                       //End of procedure
END PROGRAM CALCULATOR.                           //End of program