IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRAY-INPUT.
          05 ARRAY-SIZE PIC 9(3) VALUE 5.
          05 ARRAY OCCURS 0 TO 100 TIMES
             DEPENDING ON ARRAY-SIZE
             INDEXED BY N.
             10 ELEMENT PIC X(10).

       01 RESULT PIC X(10).

       PROCEDURE DIVISION.

           PERFORM VARYING N FROM 1 BY 1
           UNTIL N > ARRAY-SIZE
               DISPLAY "ENTER ELEMENT " N " OF ARRAY:"
               ACCEPT ELEMENT(N)

               IF N = 1
                   MOVE ELEMENT(1) TO RESULT
               ELSE
                   IF ELEMENT(N) > RESULT
                       MOVE ELEMENT(N) TO RESULT
                   END-IF
               END-IF
           END-PERFORM

           DISPLAY "THE LARGEST ELEMENT IN THE ARRAY IS: " RESULT.

       STOP RUN.