000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300 AUTHOR. YOUR-NAME.
000400
000500 ENVIRONMENT DIVISION.
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
000800 01 WS-NAME PIC X(30) VALUE 'JOHN'.
000900 01 WS-AGE PIC 99 VALUE 25.
001000
001100 PROCEDURE DIVISION.
001200 DISPLAY 'HELLO ' WS-NAME.
001300 ADD 1 TO WS-AGE.
001400 DISPLAY 'NEXT YEAR YOU WILL BE ' WS-AGE ' YEARS OLD.'.
001500 STOP RUN.