IDENTIFICATION DIVISION.
PROGRAM-ID. MATH_CALC.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
	SELECT INFILE ASSIGN TO "input.txt".
	SELECT OUTFILE ASSIGN TO "output.txt".

DATA DIVISION.
FILE SECTION.
FD INFILE.
01 NUMBER PIC 9999.

FD OUTFILE.
01 RESULT PIC ZZ9.99.

WORKING-STORAGE SECTION.
01 INPUT-PARAMETERS.
05 IN-A PIC 9999.
05 IN-B PIC 9999.

01 CALCULATION-RESULTS.
05 SUM PIC ZZ9.99.
05 DIFFERENCE PIC ZZ9.99.
05 PRODUCT PIC ZZ9.99.
05 DIVISION PIC ZZ9.99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
	OPEN INPUT INFILE.
	OPEN OUTPUT OUTFILE.

	PERFORM READ-INPUT UNTIL OUT-OF-DATA = TRUE.

	CLOSE INFILE.
	CLOSE OUTFILE.

	STOP RUN.

READ-INPUT.
	READ INFILE AT END SET OUT-DATA TO TRUE.
	IF OUT-DATA = FALSE
        THEN
            PERFORM CALCULATIONS
            WRITE OUTFILE
	END-READ.

CALCULATIONS.
	COMPUTE SUM = IN-A + IN-B
	COMPUTE DIFFERENCE = IN-A - IN-B
	COMPUTE PRODUCT = IN-A * IN-B
	IF IN-B = 0
        THEN
            MOVE "DIVIDE BY ZERO" TO DIVISION
        ELSE
            COMPUTE DIVISION = IN-A / IN-B
	WRITE OUTREC USING RESULT, SUM, DIFFERENCE, PRODUCT, DIVISION.