IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SCORE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO "STUDENT.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RESULT-FILE ASSIGN TO "RESULT.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE.
       01 STUDENT-RECORD.
           05 STUDENT-NAME        PIC X(20).
           05 STUDENT-DOB         PIC 9(8).
           05 STUDENT-GRADYEAR    PIC 9(4).
           05 STUDENT-ID          PIC 9(10).
       FD RESULT-FILE.
       01 RESULT-RECORD.
           05 STUDENT-NAME        PIC X(20).
           05 TOTAL-SCORE         PIC 9(3).
           05 PERCENTAGE          PIC 9(3).
           05 RESULT              PIC X.
       WORKING-STORAGE SECTION.
       01 STUDENT-SCORES.
          05 C1-MARK-1         PIC 99.
          05 C1-MARK-2         PIC 99.
          05 C1-MARK-3         PIC 99.
          05 C1-MARK-4         PIC 99.
          05 C2-MARK-1         PIC 99.
          05 C2-MARK-2         PIC 99.
          05 C2-MARK-3         PIC 99.
          05 C2-MARK-4         PIC 99.
       01 TOTAL-SCORE       PIC 999.
       01 PERCENTAGE        PIC 999.
       PROCEDURE DIVISION.
       BEGIN.
           OPEN INPUT STUDENT-FILE
               OUTPUT RESULT-FILE.
           PERFORM READ-STUDENT-FILE
               UNTIL EOF = "YES".
           CLOSE STUDENT-FILE
                 RESULT-FILE.
           STOP RUN.
       READ-STUDENT-FILE.
           MOVE STUDENT-NAME TO STUDENT-RECORD.
           MOVE C1-MARK-1 TO STUDENT-RECORD.
           MOVE C1-MARK-2 TO STUDENT-RECORD.
           MOVE C1-MARK-3 TO STUDENT-RECORD.
           MOVE C1-MARK-4 TO STUDENT-RECORD.
           MOVE C2-MARK-1 TO STUDENT-RECORD.
           MOVE C2-MARK-2 TO STUDENT-RECORD.
           MOVE C2-MARK-3 TO STUDENT-RECORD.
           MOVE C2-MARK-4 TO STUDENT-RECORD.
           MOVE TOTAL-SCORE TO STUDENT-RECORD.
           MOVE PERCENTAGE TO STUDENT-RECORD.
           MOVE RESULT TO STUDENT-RECORD.
           WRITE RESULT-RECORD.
           DISPLAY "STUDENT NAME = " STUDENT-NAME.
           DISPLAY "TOTAL SCORE = " TOTAL-SCORE.
           DISPLAY "PERCENTAGE = " PERCENTAGE.
           DISPLAY "RESULT = " RESULT.
       END-READ.
       END PROGRAM CALCULATE-SCORE.