IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLICATION-PROGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(4) VALUE 1234.
       01 B PIC 9(4) VALUE 5678.
       01 C PIC 9(9) VALUE ZERO.
       01 LENGTH PIC 9(2) VALUE 4.
       01 COUNT PIC 9(2) VALUE 0.

       PROCEDURE DIVISION.
           MULTIPLY A BY B GIVING C.

       PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT = LENGTH
           MULTIPLY B BY C GIVING B
           ADD A TO B
           ADD B TO C
       END-PERFORM.

       DISPLAY "The result of " A " multiplied by " B " is " C ".".

       STOP RUN.