IDENTIFICATION DIVISION.
PROGRAM-ID. Rectangle-Area.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LENGTH PIC 9(3).
01 WIDTH PIC 9(3).
01 AREA PIC 9(5).
PROCEDURE DIVISION.
    DISPLAY "Enter the length of the rectangle: ".
    ACCEPT LENGTH.
    DISPLAY "Enter the width of the rectangle: ".
    ACCEPT WIDTH.
    MULTIPLY LENGTH BY WIDTH GIVING AREA.
    DISPLAY "The area of the rectangle is: ", AREA.
STOP RUN.