IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
      ************************************
      *  THIS PROGRAM CALCULATES THE AREA  *
      *  OF A CIRCLE                       *
       ************************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MYINPUT ASSIGN TO "input.txt".
           SELECT MYOUTPUT ASSIGN TO "output.txt".

       DATA DIVISION.
       FILE SECTION.
       FD MYINPUT.
       01 RECORD-IN PIC X(10).
       FD MYOUTPUT.
       01 RECORD-OUT PIC X(20).

       WORKING-STORAGE SECTION.
       01 RADIUS PIC 9(3)V9(2).
       01 PI PIC 9(3)V9(2) VALUE 3.14.
       01 AREA PIC 9(5)V9(2).
       01 DISPLAY-STRING PIC X(20) VALUE "THE AREA IS:".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

       OPEN INPUT MYINPUT
           OUTPUT MYOUTPUT
       PERFORM READ-AND-CALCULATE
       PERFORM WRITE-RESULTS
       CLOSE MYINPUT 
           MYOUTPUT 
       STOP RUN.

       READ-AND-CALCULATE.
           DISPLAY "ENTER THE RADIUS:"
           ACCEPT RECORD-IN
           MOVE RECORD-IN TO RADIUS
           COMPUTE AREA = PI * (RADIUS ** 2).

       WRITE-RESULTS.
           MOVE DISPLAY-STRING TO RECORD-OUT
           MOVE AREA TO RECORD-OUT(12:6)
           WRITE RECORD-OUT.