IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       AUTHOR. JOHN DOE.
      * COMMENTS: THIS PROGRAM PERFORMS CALCULATIONS
      * AND DISPLAYS RESULTS TO THE USER.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO "DATA/INPUTFILE.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-FILE ASSIGN TO "REPORT/OUTPUTFILE.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 FILE-RECORD.
           05 DATA-ONE PIC X(10).
           05 DATA-TWO PIC X(10).
           05 DATA-THREE PIC X(10).
           05 DATA-FOUR PIC X(10).
       FD OUT-FILE.
       01 REPORT-LINE PIC X(40).
       WORKING-STORAGE SECTION.
       01 WORKING-VARIABLES.
           05 NUM-ONE PIC 9(3).
           05 NUM-TWO PIC 9(3).
           05 TEMP-VAR PIC 9(5).
           05 RESULT PIC 9(5).
       PROCEDURE DIVISION.
       MAIN-PROCESS.
           OPEN INPUT IN-FILE
           OUTPUT OUT-FILE.
           PERFORM UNTIL EOF = 'Y'
               READ IN-FILE INTO FILE-RECORD
               AT END
                   MOVE 'Y' TO EOF
               NOT AT END
                   MOVE DATA-ONE TO NUM-ONE
                   MOVE DATA-TWO TO NUM-TWO
                   SUBTRACT NUM-TWO FROM NUM-ONE GIVING TEMP-VAR
                   MULTIPLY NUM-ONE BY NUM-TWO GIVING RESULT
                   MOVE 'THE FIRST NUMBER IS: ' TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE NUM-ONE TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE 'THE SECOND NUMBER IS: ' TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE NUM-TWO TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE 'THE DIFFERENCE IS: ' TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE TEMP-VAR TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE 'THE PRODUCT IS: ' TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   MOVE RESULT TO REPORT-LINE
                   DISPLAY REPORT-LINE
                   WRITE REPORT-LINE
               END-READ
           END-PERFORM.
           CLOSE IN-FILE
           OUT-FILE.
           STOP RUN.