IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-PC.
OBJECT-COMPUTER. IBM-PC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TEXT PIC X(20).
01 NUM1 PIC 99.
01 NUM2 PIC 99.
PROCEDURE DIVISION.
MAIN-LOGIC.
MULTIPLY NUM1 BY NUM2 GIVING NUM1 NUM2 TEMP.
DISPLAY "The multipli