IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALES-PRICE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WHOLESALE-PRICE PIC 9(7)V99.
       01 MARKUP-RATE PIC 9(3)V99.
       01 SALES-PRICE PIC 9(7)V99.
       PROCEDURE DIVISION.
       DISPLAY "ENTER WHOLESALE PRICE:".
       ACCEPT WHOLESALE-PRICE.
       DISPLAY "ENTER MARKUP RATE:".
       ACCEPT MARKUP-RATE.
       MULTIPLY WHOLESALE-PRICE BY MARKUP-RATE GIVING SALES-PRICE.
       DISPLAY "SALES PRICE IS:" + SALES-PRICE.
       STOP RUN.