* PROGRAM TO CALCULATE THE TOTAL GROSS PAY OF AN EMPLOYEE
IDENTIFICATION DIVISION.
PROGRAM-ID. TOTALGROSSPAY.
AUTHOR. JANE DOE.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PAY-FILE ASSIGN TO 'EMPLOYEE.TXT'
    ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PAY-FILE.
01 EMPLOYEE-RECORD.
    05 EMPLOYEE-NAME           PIC X(20).
    05 EMPLOYEE-ID             PIC 9(5).
    05 HOURLY-RATE             PIC 9(6)V99.
    05 HOURS-WORKED            PIC 9(3).
    05 GROSS-PAY               PIC 9(6)V99.
WORKING-STORAGE SECTION.
01 COUNTER                   PIC 9(3)       VALUE 0.
01 TOTAL-GROSS-PAY           PIC 9(8)V99    VALUE ZERO.
PROCEDURE DIVISION.
OPEN-FILE.
    OPEN INPUT PAY-FILE.
READ-FILE.
    READ PAY-FILE INTO EMPLOYEE-RECORD
    AT END GO TO END-PAY-FILE.
CALCULATE-GROSS-PAY.
    MULTIPLY HOURLY-RATE BY HOURS-WORKED GIVING GROSS-PAY.
    ADD GROSS-PAY TO TOTAL-GROSS-PAY.
    ADD 1 TO COUNTER.
    GO TO READ-FILE.
END-PAY-FILE.
PRINT-TOTAL-GROSS-PAY.
    DISPLAY "TOTAL GROSS PAY FOR " EMPLOYEE-NAME " WITH EMPLOYEE ID " EMPLOYEE-ID " IS " TOTAL-GROSS-PAY.
CLOSE-FILE.
    CLOSE PAY-FILE.
STOP-RUN.
       *