01  WS-STUDENT-RECORD.                      * This is a record containing student information
          05 WS-STUDENT-ID       PIC X(08).       * Student ID field, contains 8 characters
          05 WS-STUDENT-NAME.                     * Student name field
              10 WS-LAST-NAME    PIC X(20).      * Last name field, contains 20 characters
              10 WS-FIRST-NAME   PIC X(15).      * First name field, contains 15 characters
          05 WS-COURSES-TAKEN   PIC 9(03).       * Number of courses taken field, contains 3 digits
          05 WS-MARKS-TABLE.
              10 WS-COURSE-TITLE  PIC X(20).     * Course title field, contains 20 characters
              10 WS-MARKS         OCCURS 5       * Marks obtained in each course, occurs 5 times
                                  TIMES.
                  15 WS-TERM      PIC X(10).    * Term field, contains 10 characters
                  15 WS-MARK      PIC 9(03).    * Mark obtained in that term, contains 3 digits