IDENTIFICATION DIVISION.                                          
       PROGRAM-ID. Print-Numbers.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT num-file ASSIGN TO "numbers.dat"
           FILE STATUS IS num-status.

       DATA DIVISION.
       FILE SECTION.
       FD num-file.
       01 num-rec.
          05 num PIC 9(3).
       01 num-status PIC 9(2).

       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN OUTPUT num-file.
           PERFORM varying i from 1 by 1 until i > 100
              COMPUTE num = FUNCTION MOD(i, 5)
              IF num = 0
                 DISPLAY "COBOL"
              ELSE
                 DISPLAY i
              END-IF
              WRITE num-rec
           END-PERFORM.

           IF num-status < 0
              DISPLAY "Error writing to file."
           END-IF

           CLOSE num-file.
           STOP RUN.