IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(02)V9(02) VALUE +12.34.
       01 NUM2 PIC S9(02)V9(02) VALUE +56.78.
       01 RESULT PIC S9(02)V9(02).
       PROCEDURE DIVISION.
       PERFORM VARYING RESULT FROM 0 BY 1 UNTIL RESULT = 100
       MULTIPLY NUM1 BY NUM2 GIVING RESULT
       DIVIDE NUM1 BY NUM2 GIVING RESULT
       ADD NUM1 TO NUM2 GIVING RESULT
       SUBTRACT NUM2 FROM NUM1 GIVING RESULT
       DISPLAY "The current value of RESULT is " RESULT
       END-PERFORM.
       STOP RUN.