IDENTIFICATION DIVISION.
       PROGRAM-ID.HelloWorld.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STD-INPUT ASSIGN TO KEYBOARD.
           SELECT STD-OUTPUT ASSIGN TO PRINTER.

       DATA DIVISION.
       FILE SECTION.
       FD STD-INPUT.
       01 MSG-IN PIC X(20).
       FD STD-OUTPUT.
       01 MSG-OUT PIC X(20).

       PROCEDURE DIVISION.
       MAIN-PROC.
           OPEN INPUT STD-INPUT.
           OPEN OUTPUT STD-OUTPUT.

           PERFORM READ-INPUT UNTIL MSG-IN = 'EXIT'.
           CLOSE STD-INPUT.
           CLOSE STD-OUTPUT.
           DISPLAY 'Program completed!'.

       READ-INPUT.
           DISPLAY 'Enter a message: '.
           ACCEPT MSG-IN FROM STD-INPUT.
           INSPECT MSG-IN TALLYING NUMBER-OF-CHARS FOR ALL '*'.

           IF NUMBER-OF-CHARS > 0
               COMPUTE NUMBER-OF-CHARS = NUMBER-OF-CHARS + 2.

           MOVE "Message: " TO MSG-OUT.
           MOVE MSG-IN(1:NUMBER-OF-CHARS) TO MSG-OUT(10:NUMBER-OF-CHARS).
           WRITE MSG-OUT AFTER ADVANCING 2 LINES.

           IF NUMBER-OF-CHARS > 5
               WRITE "This message is longer than 5 characters.".

       END-PROGRAM.
       STOP RUN.