IDENTIFICATION DIVISION.
      PROGRAM-ID. SAMPLE-PROGRAM.
      AUTHOR. YOUR NAME.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT INPUT-FILE ASSIGN TO "INPUT.DAT".
      SELECT OUTPUT-FILE ASSIGN TO "OUTPUT.DAT".

      DATA DIVISION.
      FILE SECTION.
      FD INPUT-FILE.
      01 INPUT-RECORD.
         03 NAME                      PIC X(20).
         03 AGE                       PIC 9(2).
         03 GENDER                    PIC X.
         03 SALARY                    PIC 9(4)V99.
      FD OUTPUT-FILE.
      01 OUTPUT-RECORD.
         03 NAME                      PIC X(25).
         03 AGE                       PIC X(3).
         03 GENDER                    PIC X.
         03 REMARKS                   PIC X(30).

      WORKING-STORAGE SECTION.
      01 TOTAL-SALARY                 PIC 9(6)V99 VALUE 0.
      01 TOTAL-COUNT                  PIC 9(4) VALUE 0.
      01 AVERAGE-SALARY               PIC 9(6)V99.
      01 HIGHEST-SALARY               PIC 9(6)V99 VALUE 0.
      01 HIGHEST-SALARY-NAME          PIC X(20).
      01 LOWEST-SALARY                PIC 9(6)V99 VALUE 9999.99.
      01 LOWEST-SALARY-NAME           PIC X(20).
      01 MALE-COUNT                   PIC 9(4) VALUE 0.
      01 FEMALE-COUNT                 PIC 9(4) VALUE 0.

      PROCEDURE DIVISION.
      100-BEGIN.
          OPEN INPUT INPUT-FILE
          PERFORM UNTIL EOF
              READ INPUT-FILE INTO INPUT-RECORD AT END SET EOF TO TRUE
              IF NOT EOF
                  ADD SALARY TO TOTAL-SALARY
                  ADD 1 TO TOTAL-COUNT
                  IF GENDER = "M" THEN
                      ADD 1 TO MALE-COUNT
                  ELSE
                      ADD 1 TO FEMALE-COUNT
                  END-IF
                  IF SALARY > HIGHEST-SALARY THEN
                      MOVE NAME TO HIGHEST-SALARY-NAME
                      MOVE SALARY TO HIGHEST-SALARY
                  END-IF
                  IF SALARY < LOWEST-SALARY THEN
                      MOVE NAME TO LOWEST-SALARY-NAME
                      MOVE SALARY TO LOWEST-SALARY
                  END-IF
              END-IF
          END-PERFORM
          CLOSE INPUT-FILE

          COMPUTE AVERAGE-SALARY = TOTAL-SALARY / TOTAL-COUNT

          MOVE "LIST OF EMPLOYEES" TO REMARKS
          WRITE OUTPUT-RECORD
          MOVE "TOTAL NUMBER OF EMPLOYEES: " TO REMARKS
          MOVE TOTAL-COUNT TO AGE
          WRITE OUTPUT-RECORD
          MOVE "AVERAGE SALARY: " TO REMARKS
          MOVE AVERAGE-SALARY TO AGE
          WRITE OUTPUT-RECORD
          MOVE "HIGHEST SALARY: " TO REMARKS
          MOVE HIGHEST-SALARY-NAME TO NAME
          MOVE HIGHEST-SALARY TO AGE
          WRITE OUTPUT-RECORD
          MOVE "LOWEST SALARY: " TO REMARKS
          MOVE LOWEST-SALARY-NAME TO NAME
          MOVE LOWEST-SALARY TO AGE
          WRITE OUTPUT-RECORD
          MOVE "MALE EMPLOYEES: " TO REMARKS
          MOVE MALE-COUNT TO AGE
          WRITE OUTPUT-RECORD
          MOVE "FEMALE EMPLOYEES: " TO REMARKS
          MOVE FEMALE-COUNT TO AGE
          WRITE OUTPUT-RECORD

          OPEN OUTPUT OUTPUT-FILE
          PERFORM UNTIL EOF
              READ INPUT-FILE INTO INPUT-RECORD AT END SET EOF TO TRUE
              IF NOT EOF
                  MOVE NAME TO OUTPUT-RECORD(1:25)
                  MOVE AGE TO OUTPUT-RECORD(26:3)
                  MOVE GENDER TO OUTPUT-RECORD(29:1)
                  MOVE REMARKS TO OUTPUT-RECORD(30:30)
                  WRITE OUTPUT-RECORD
              END-IF
          END-PERFORM

          CLOSE OUTPUT-FILE

      100-END.
          STOP RUN.