IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 VAR-A PIC 9 VALUE 10.
01 VAR-B PIC 9 VALUE 20.
01 RESULT PIC 9 VALUE 0.

PROCEDURE DIVISION.
MULTIPLY VAR-A BY VAR-B GIVING RESULT.

DISPLAY "A: " VAR-A.
DISPLAY "B: " VAR-B.
DISPLAY "Result: " RESULT.

EVALUATE TRUE
WHEN RESULT = 200
DISPLAY "Result is equal to 200."
WHEN RESULT < 200
DISPLAY "Result is less than 200."
WHEN RESULT > 200
DISPLAY "Result is greater than 200."
END-EVALUATE.

STOP RUN.