IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-INTEGER PIC 9(4).

PROCEDURE DIVISION.
DISPLAY "Enter an integer between 1 and 100: ".
ACCEPT INPUT-INTEGER.

IF INPUT-INTEGER < 1 OR INPUT-INTEGER > 100
    DISPLAY "Invalid input, please try again.".
ELSE
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > INPUT-INTEGER
        IF I MOD 3 = 0 AND I MOD 5 = 0
            DISPLAY I "is a multiple of both 3 and 5.".
        ELSE IF I MOD 3 = 0
            DISPLAY I "is a multiple of 3.".
        ELSE IF I MOD 5 = 0
            DISPLAY I "is a multiple of 5.".
        ELSE
            DISPLAY I "is not a multiple of 3 or 5.".
        END-IF
    END-PERFORM.
END-IF.

STOP RUN.