IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.

       WORKING-STORAGE SECTION.
       01  WS-VAR1 PIC 9(3) VALUE 10.
       01  WS-VAR2 PIC X(10) VALUE 'HELLO WORLD'.
       01  WS-TOTAL PIC 9(4).
       01  WS-COUNT PIC 9(3) VALUE 1.

       PROCEDURE DIVISION.

       PERFORM UNTIL WS-COUNT > WS-VAR1
           DISPLAY WS-VAR2
           ADD 1 TO WS-TOTAL
           ADD 1 TO WS-COUNT
       END-PERFORM.

       DISPLAY WS-TOTAL.

       STOP RUN.