Identification Division.
Program-ID. Code_Snippet.
Data Division.
Working-Storage Section.
01 INPUT-NUMBER PIC 9(5).
01 FACTORIAL-NUMBER PIC 9(5).
01 RESULT PIC 9(10).
Procedure Division.
Main-Paragraph.
Display "Please enter a number: ".
Accept INPUT-NUMBER.
Perform Calculate-Factorial.
Display "The factorial of " INPUT-NUMBER " is " RESULT "."
Stop Run.

Calculate-Factorial.
If INPUT-NUMBER = 0
Multiply 1 by RESULT
Else
Perform Until INPUT-NUMBER = 0
Multiply INPUT-NUMBER by FACTORIAL-NUMBER
Subtract 1 from INPUT-NUMBER
End-Perform.