IDENTIFICATION DIVISION.
PROGRAM-ID. MY-COBOL-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  VAR-A   PIC S9(5)V99 VALUE 50.55.
01  VAR-B   PIC S9(5)V99 VALUE 60.40.
01  VAR-C   PIC S9(5)V99 VALUE 70.20.
01  RESULT  PIC S9(6)V99.

PROCEDURE DIVISION.
    PERFORM COMPUTATION  
    DISPLAY 'RESULT IS ' RESULT
    STOP RUN.
                 
COMPUTATION.
    MULTIPLY VAR-A BY VAR-B GIVING RESULT
    DIVIDE RESULT BY VAR-C GIVING RESULT.