IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 99 VALUE 10.
01 NUM2 PIC 99 VALUE 20.
01 SUM PIC 99.

PROCEDURE DIVISION.
CALCULATE-SUM.
ADD NUM1 TO NUM2 GIVING SUM.
EXIT PROGRAM.