IDENTIFICATION DIVISION.
      * This program calculates the sum of two numbers
       PROGRAM-ID. SUMMING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5).
       01 NUM2 PIC 9(5).
       01 RESULT PIC 9(6).
       PROCEDURE DIVISION.
           DISPLAY "Enter the first number: ".
           ACCEPT NUM1.
           DISPLAY "Enter the second number: ".
           ACCEPT NUM2.
           COMPUTE RESULT = NUM1 + NUM2.
           DISPLAY "The sum of " NUM1 " and " NUM2 " is " RESULT.
       STOP RUN.