* This program calculates the average age of a group of people.
IDENTIFICATION DIVISION. 			// Identifies program name and author
PROGRAM-ID. AVGAGE.

DATA DIVISION. 						// Declares all data used in the program
WORKING-STORAGE SECTION.
01 TOTAL-AGE PIC 9(3)V9. 			// Variable to store total age
01 AVERAGE-AGE PIC ZZ9.9. 			// Variable to store average age
01 PERSON-AGE PIC 9(2).				// Variable to hold each person's age
01 GROUP-SIZE PIC 999.				// Variable to hold number of people in the group
01 COUNTER PIC 999. 				// Counter to keep track of number of people

PROCEDURE DIVISION. 				// Main program logic
MAIN.
DISPLAY "Enter the number of people in the group: ".
ACCEPT GROUP-SIZE. 					// Accepts input for group size
PERFORM CALCULATE-AVERAGE 			// Performs calculation for average age
DISPLAY "The average age is: " AVERAGE-AGE ".".
STOP RUN.

CALCULATE-AVERAGE.
PERFORM VARYING COUNTER 			// Loops through number of people in the group
FROM 1 BY 1 						// Increments counter by 1 each time
UNTIL COUNTER > GROUP-SIZE 			// Loops until counter is greater than group size
DISPLAY "Enter person " COUNTER " age: ".
ACCEPT PERSON-AGE 					// Accepts input for person's age
COMPUTE TOTAL-AGE = TOTAL-AGE + PERSON-AGE. // Calculates total age
END-PERFORM.
COMPUTE AVERAGE-AGE = TOTAL-AGE / GROUP-SIZE. // Calculates average age