IDENTIFICATION DIVISION.    
PROGRAM-ID. Program1.    
DATA DIVISION.    
WORKING-STORAGE SECTION.    
77 num1  PIC 9(5) VALUE 10000.         
77 num2  PIC 9(4) VALUE 500.         
77 result PIC 9(6) VALUE ZERO.   
          
PROCEDURE DIVISION. 
MAIN-PROCEDURE.     
    MULTIPLY num1 BY num2 GIVING result.   
    DISPLAY "The multiplication of " num1 " and " num2 " is " result "."   
    IF result > 30000  
        DISPLAY "The result is greater than 30000."  
    END-IF.  
STOP RUN.