IDENTIFICATION DIVISION.
 PROGRAM-ID. HELLO-WORLD.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-NAME PIC X(10) VALUE "COBOL".

 PROCEDURE DIVISION.
     DISPLAY "HELLO " WS-NAME.
     STOP RUN.