IDENTIFICATION DIVISION.
PROGRAM-ID. WELCOME-USER.

AUTHOR. YOUR NAME.
DATE-WRITTEN. CURRENT DATE.

ENVIRONMENT DIVISION.

RUN-DATE.
DATE-WRITTEN PIC 9(8).
DATA PIC 9(8).

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NAME PIC X(20).
01 GREETINGS PIC X(30) VALUE "WELCOME TO OUR PROGRAM, ".

PROCEDURE DIVISION.
DISPLAY GREETINGS.
ACCEPT NAME FROM DATE.DAY.OTHER-STORAGE.
DISPLAY "HELLO " NAME ". WELCOME TO OUR PROGRAM!".