IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLEPROG.
AUTHOR. JOHN DOE.
* This program calculates the average of 5 numbers
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS.
02 NUM1 PIC 9(3).
02 NUM2 PIC 9(3).
02 NUM3 PIC 9(3).
02 NUM4 PIC 9(3).
02 NUM5 PIC 9(3).
01 AVERAGE PIC 9(3)V99.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
* Get input from user
DISPLAY "Enter 5 numbers:".
ACCEPT NUM1.
ACCEPT NUM2.
ACCEPT NUM3.
ACCEPT NUM4.
ACCEPT NUM5.
* Calculate average
COMPUTE AVERAGE = (NUM1 + NUM2 + NUM3 + NUM4 + NUM5) / 5.
* Display result
DISPLAY "The average is:" AVERAGE.
* End program
STOP RUN.
END PROGRAM SAMPLEPROG.