IDENTIFICATION DIVISION.                      
       PROGRAM-ID. CALCULATE-VOLUME.                 
       AUTHOR. [Your Name].                          
       DATE-WRITTEN. MAY 1, 2021.                    
       DATE-COMPILED. MAY 1, 2021.                   
       ENVIRONMENT DIVISION.                        
       CONFIGURATION SECTION.                       
       SOURCE-COMPUTER. IBM-370                      
       OBJECT-COMPUTER. IBM-370.                     
       DATA DIVISION.                               
       WORKING-STORAGE SECTION.                     
       01 LENGTH PIC 99.                             
       01 WIDTH PIC 99.                              
       01 HEIGHT PIC 99.                             
       01 VOLUME PIC 9999.                           
       PROCEDURE DIVISION.                           
       DISPLAY "CALCULATING VOLUME".                 
       DISPLAY "ENTER LENGTH".                       
       ACCEPT LENGTH.                                
       DISPLAY "ENTER WIDTH".                        
       ACCEPT WIDTH.                                 
       DISPLAY "ENTER HEIGHT".                       
       ACCEPT HEIGHT.                                
       COMPUTE VOLUME = LENGTH * WIDTH * HEIGHT.     
       DISPLAY "THE VOLUME IS " VOLUME.              
       STOP RUN.                                     
       END PROGRAM CALCULATE-VOLUME.