IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-EMPLOYEE-TOTALS.

       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE
           RECORDING MODE IS F.

       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-NUMBER PIC X(6).
           05 EMPLOYEE-NAME PIC X(20).
           05 EMPLOYEE-SALARY PIC 99999V99.
           05 EMPLOYEE-TAX RATE PIC 9V99.
           05 EMPLOYEE-BONUS-ACTUAL PIC 999V99.
           05 EMPLOYEE-BONUS-PERCENTAGE PIC 99V99.

       WORKING-STORAGE SECTION.
       01 EMPLOYEE-TOTALS.
           05 TOTAL-SALARIES PIC 9(7)V99.
           05 TOTAL-TAXES PIC 9(5)V99.
           05 TOTAL-BONUS ACTUAL PIC 9(5)V99.
           05 TOTAL-BONUS-PERCENTAGE PIC 9(5)V99.
           05 TOTAL-BONUS-DUE PIC 9(5)V99.

       PROCEDURE DIVISION.
           OPEN INPUT EMPLOYEE-FILE.
           READ EMPLOYEE-FILE
               AT END
                   MOVE 'NO EMPLOYEES' TO TOTALS-TOTAL-BONUS-DUE
           NOT AT END
                   MULTIPLY EMPLOYEE-BONUS-PERCENTAGE
                   BY EMPLOYEE-SALARY
                   GIVING EMPLOYEE-BONUS-DUE
                   IF EMPLOYEE-BONUS-ACTUAL = ZERO
                       STOP RUN
                   ELSE
                       ADD EMPLOYEE-SALARY TO TOTAL-SALARIES
                       ADD EMPLOYEE-TAX-RATE TO TOTAL-TAXES
                       ADD EMPLOYEE-BONUS-ACTUAL TO TOTAL-BONUS-ACTUAL
                       ADD EMPLOYEE-BONUS-PERCENTAGE TO TOTAL-BONUS-PERCENTAGE
                       ADD TOTAL-BONUS-ACTUAL TO TOTAL-BONUS-DUE
           END-READ.

           WRITE 'TOTAL EMPLOYEE SALARIES: ' TOTAL-SALARIES.
           WRITE 'TOTAL EMPLOYEE TAXES: ' TOTAL-TAXES.
           WRITE 'TOTAL BONUS DUE TO EMPLOYEES: ' TOTAL-BONUS-DUE.

           CLOSE EMPLOYEE-FILE.

           STOP RUN.
       
       END PROGRAM CALCULATE-EMPLOYEE-TOTALS.