IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INPUT-FILE-IN ASSIGN TO "input_file.txt"
ORGANIZATION IS SEQUENTIAL.
SELECT OUTPUT-FILE-OUT ASSIGN TO "output_file.txt"
ORGANIZATION IS INDEXED.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE-IN.
01 INPUT-REC.
05 INPUT-ID PIC X(5).
05 INPUT-NAME PIC X(20).
05 INPUT-AGE PIC 99.
05 INPUT-SALARY PIC 9(6).

FD OUTPUT-FILE-OUT.
01 OUTPUT-REC.
05 OUTPUT-ID PIC X(5).
05 OUTPUT-NAME PIC X(20).
05 OUTPUT-AGE PIC 99.
05 OUTPUT-SALARY PIC 9(6).

WORKING-STORAGE SECTION.
01 COUNT PIC 99.

PROCEDURE DIVISION.
MAIN-PROGRAM.
OPEN INPUT INPUT-FILE-IN.
OPEN OUTPUT OUTPUT-FILE-OUT.

READ INPUT-FILE-IN
AT END GO TO END-OF-FILE.
MOVE INPUT-ID TO OUTPUT-ID.
MOVE INPUT-NAME TO OUTPUT-NAME.
IF INPUT-AGE > 25
    ADD INPUT-SALARY BY 10000 GIVING OUTPUT-SALARY
ELSE
    ADD INPUT-SALARY BY 5000 GIVING OUTPUT-SALARY
END-IF.
WRITE OUTPUT-REC.
ADD 1 TO COUNT.
GO TO MAIN-PROGRAM.

END-OF-FILE.
CLOSE INPUT-FILE-IN.
CLOSE OUTPUT-FILE-OUT.
STOP RUN.