IDENTIFICATION DIVISION.
       PROGRAM-ID. INTEREST-CALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RATE PIC 9(2)V9(6) VALUE 0.02.
       01 PRINCIPAL PIC 9(8)V99.
       01 PERIODS-PIC 9.
       01 RATE-COMP-INT PIC 9(2)V9(6).
       01 INTEREST PIC 9(8)V99.
       PROCEDURE DIVISION.
       ACCEPT PRINCIPAL.
       ACCEPT PERIODS-PIC.
       MULTIPLY PRINCIPAL BY RATE GIVING RATE-COMP-INT.
       COMPUTE INTEREST ROUNDED =
       (PRINCIPAL * RATE * PERIODS) / 100.
       DISPLAY "INTEREST AMOUNT = " INTEREST.
        STOP RUN.