IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ONE PIC S9(5)V99.
       01 NUM-TWO PIC S9(5)V99.
       01 OPERATOR PIC X.
       01 RESULT PIC S9(5)V99.
       PROCEDURE DIVISION.
       DISPLAY "Enter first number:".
       ACCEPT NUM-ONE.
       DISPLAY "Enter second number:".
       ACCEPT NUM-TWO.
       DISPLAY "Enter operator (+, -, *, or /):".
       ACCEPT OPERATOR.
       EVALUATE OPERATOR
          WHEN "+" PERFORM ADD-OPERATION
          WHEN "-" PERFORM SUBTRACT-OPERATION
          WHEN "*" PERFORM MULTIPLY-OPERATION
          WHEN "/" PERFORM DIVIDE-OPERATION
          WHEN OTHER PERFORM INVALID-OPERATION
       END-EVALUATE.
       DISPLAY "Result is: " RESULT.
       STOP RUN.

       ADD-OPERATION.
           COMPUTE RESULT = NUM-ONE + NUM-TWO.
       END-ADD-OPERATION.
       SUBTRACT-OPERATION.
           COMPUTE RESULT = NUM-ONE - NUM-TWO.
       END-SUBTRACT-OPERATION.
       MULTIPLY-OPERATION.
           COMPUTE RESULT = NUM-ONE * NUM-TWO.
       END-MULTIPLY-OPERATION.
       DIVIDE-OPERATION.
           IF NUM-TWO = 0
               DISPLAY "Error: Cannot divide by zero."
           ELSE
               COMPUTE RESULT = NUM-ONE / NUM-TWO.
           END-IF.
       END-DIVIDE-OPERATION.
       INVALID-OPERATION.
           DISPLAY "Error: Invalid operator entered."
       END-INVALID-OPERATION.