IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK-ACCOUNTS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ACCOUNT-HOLDERS.
           05 NAME PIC X(20).
           05 ADDRESS PIC X(30).
           05 ACCOUNT-NUMBER PIC 9(10).
           05 BALANCE PIC 9(8)V99.
       01 TOTAL-ACCOUNTS PIC 99.
       01 INCREMENT PIC 99.
       
       PROCEDURE DIVISION.
       0100 MAIN-PROCESS.
           DISPLAY "----- BANK ACCOUNTS -----".
           PERFORM 0101-GET-ACCOUNTS UNTIL TOTAL-ACCOUNTS = 10.
           STOP RUN.
       0101 GET-ACCOUNTS.
           DISPLAY "Enter account holder's name:".
           ACCEPT NAME.
           DISPLAY "Enter account holder's address:".
           ACCEPT ADDRESS.
           SET ACCOUNT-NUMBER TO INCREMENT.
           ADD FUNDS TO BALANCE.
           DISPLAY "Account created for " NAME "with account number " ACCOUNT-NUMBER.
           ADD 1 TO TOTAL-ACCOUNTS.
           ADD 1 TO INCREMENT.
           DISPLAY "----------------------------".
        
           0120 GET-FUNDS.
           PERFORM UNTIL FUNDS-INPUT = "STOP".
           DISPLAY "Enter amount to add to balance, or type 'STOP' to exit:".
           ACCEPT FUNDS-INPUT.
           IF FUNDS-INPUT NOT = "STOP" THEN
               ADD FUNDS-INPUT TO BALANCE
           END-IF.
       0200 ERROR-PROCESS.
           DISPLAY "Error: Maximum number of accounts reached.".
           STOP RUN.