IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(3).
       02 NUM2 PIC S9(3).
       02 RESULT PIC S9(5).
       01 COUNT PIC S9(3).
       PROCEDURE DIVISION.
       DISPLAY "Enter two numbers: "
       ACCEPT NUM1
       ACCEPT NUM2
       PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > NUM2
           COMPUTE RESULT = RESULT + NUM1
       END-PERFORM
       DISPLAY "The result of multiplication is: "
       DISPLAY RESULT
       STOP RUN.