01 COMPANIES.
      03 COMPANY-TABLE OCCURS 50 SIZE 72 INDEXED BY COMPANY-INDEX.
         05 COMPANY-NAME PIC X(20).
         05 COMPANY-ID PIC 9(5).
         05 COMPANY-EMPLOYEES OCCURS 200 SIZE 20
            DEPENDING ON COMPANY-INDEX
             INDEXED BY COMPANY-EMPLOYEE-INDEX.
            07 EMPLOYEE-NAME PIC X(20).
            07 EMPLOYEE-AGE PIC 9(3).
            07 EMPLOYEE-SALARY PIC 9(6).
      03 TOTAL-COMPANIES PIC 9(2) VALUE 0.
      03 TOTAL-EMPLOYEES PIC 9(4) VALUE 0.

   01 HEADER.
      03 HEADER-LINE-1 PIC X(30) VALUE 'COMPANY EMPLOYEE DATA'.
      03 HEADER-LINE-2 PIC X(30) VALUE '---------------------'.
      03 HEADER-LINE-3 PIC X(50) VALUE 'COMPANY NAME'.
      03 FILLER PIC X(10).
      03 HEADER-LINE-4 PIC X(30) VALUE 'TOTAL EMPLOYEES'.
      03 HEADER-LINE-5 PIC X(30) VALUE '---------------------'.
      03 HEADER-LINE-6 REDEFINES HEADER-LINE-5.
         05 COMPANY-TOTAL PIC Z(9).
         05 FILLER PIC X(5) VALUE 'EMPLOYEE(S)'.

   PROCEDURE DIVISION.
   100-MAIN.
       PERFORM 200-INITIALIZE.
       PERFORM 300-INPUT-COMPANIES.
       PERFORM 400-INPUT-EMPLOYEES
          VARYING COMPANY-INDEX FROM 1 BY 1
          UNTIL COMPANY-INDEX > TOTAL-COMPANIES.
       PERFORM 500-PRINT-HEADER.
       PERFORM 600-PRINT-COMPANIES
          VARYING COMPANY-INDEX FROM 1 BY 1
          UNTIL COMPANY-INDEX > TOTAL-COMPANIES.
       PERFORM 700-TERMINATE.
       STOP RUN.

   200-INITIALIZE.
       MOVE 0 TO TOTAL-COMPANIES, TOTAL-EMPLOYEES.

   300-INPUT-COMPANIES.
       DISPLAY "ENTER NUMBER OF COMPANIES: ".
       ACCEPT TOTAL-COMPANIES.

   400-INPUT-EMPLOYEES.
       DISPLAY "ENTER COMPANY NAME: ".
       ACCEPT COMPANY-NAME(COMPANY-INDEX).
       DISPLAY "ENTER NUMBER OF EMPLOYEES: ".
       ACCEPT TOTAL-EMPLOYEES(COMPANY-INDEX).
       ADD TOTAL-EMPLOYEES(COMPANY-INDEX) TO TOTAL-EMPLOYEES.

   500-PRINT-HEADER.
       DISPLAY HEADER-LINE-1.
       DISPLAY HEADER-LINE-2.
       DISPLAY HEADER-LINE-3.
       DISPLAY HEADER-LINE-4.
       DISPLAY HEADER-LINE-5.

   600-PRINT-COMPANIES.
       DISPLAY COMPANY-NAME(COMPANY-INDEX).
       COMPUTE COMPANY-TOTAL = TOTAL-EMPLOYEES(COMPANY-INDEX).
       DISPLAY COMPANY-TOTAL.