IDENTIFICATION DIVISION.                                  //Identifies the division of the program
       PROGRAM-ID. MY-PROGRAM.                                    //Assigns a name to the program

       DATA DIVISION.                                             //Defines the variables and data structures
       WORKING-STORAGE SECTION.                                   //Declares variables used in calculations
       01 WS-NUMBER-A                PIC 99.                       //Defines a variable WS-NUMBER-A as a 2-digit numeric field 
       01 WS-NUMBER-B                PIC 9(6).                     //Defines a variable WS-NUMBER-B as a 6-digit numeric field 
       01 WS-NUMBER-C                PIC S9(5)V99 COMP-3.          //Defines a variable WS-NUMBER-C as a signed 5-digit integer with 2 decimal places using COMP-3 format.

       PROCEDURE DIVISION.                                         //Contains the program's instructions
       MAIN-PROCEDURE.                                             //Start of the main procedure
           ADD WS-NUMBER-A TO WS-NUMBER-B GIVING WS-NUMBER-C.      //Adds WS-NUMBER-A to WS-NUMBER-B and stores the result in WS-NUMBER-C

           DISPLAY 'The result is: ' WS-NUMBER-C.                  //Displays the result to the user
      END PROGRAM MY-PROGRAM.                                      //End of the program