IDENTIFICATION DIVISION.                           * Start of program
       PROGRAM-ID. EXAMPLE.                               * Program name
       DATA DIVISION.                                      * Start of data section
       WORKING-STORAGE SECTION.                            * Define working storage variables
       01 INPUT-VALUES.                                    * Input variable group
          05 FIRST-NUMBER  PIC 9(3).                       * Define first number input 
          05 SECOND-NUMBER PIC 9(3).                       * Define second number input 
          05 RESULT       PIC 9(4).                       * Define result variable
       01 OUTPUT-VALUES.                                   * Output variable group
          05 RESULT-NUMBER          PIC X(4).             * Define result variable for output
       PROCEDURE DIVISION.                                 * Start of procedure section
       MAIN-PROGRAM SECTION.                               * Main program section
       DISPLAY "Welcome to the example program".           * Display welcome message
       ACCEPT INPUT-VALUES FROM CONSOLE                    * Accept input from user
       PERFORM CALCULATE-RESULT                             * Perform calculation method
       DISPLAY "The result is " OUTPUT-VALUES               * Display result message
       STOP RUN.                                           * End of program

       CALCULATE-RESULT SECTION.                           * Calculation method section
       COMPUTE RESULT = FIRST-NUMBER + SECOND-NUMBER        * Add input numbers
       END-PERFORM.                                        * End of calculation method