IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-SUM.

       AUTHOR. JOHN DOE

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE-IN ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.
           SELECT FILE-OUT ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD FILE-IN.
       01 INPUT-RECORD.
           05 NUM1 PIC 9(5).
           05 NUM2 PIC 9(5).

       FD FILE-OUT.
       01 OUTPUT-RECORD.
           05 RESULT PIC 9(8).

       WORKING-STORAGE SECTION.
       01 EOF-SWITCH PIC X(3) VALUE 'NO '.

       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT FILE-IN
           OUTPUT FILE-OUT
           PERFORM UNTIL EOF-SWITCH = 'YES'
               READ FILE-IN
               AT END
                   MOVE 'YES' TO EOF-SWITCH
               END-READ
               COMPUTE RESULT = NUM1 + NUM2
               WRITE OUTPUT-RECORD
           END-PERFORM.

       END PROGRAM CALC-SUM.