Identification Division.
  Program-Id. HelloWorld.

  Environment Division.
  Data Division.
  Working-Storage Section.
  01 Input1-I1 PIC 9(3) VALUE 100.
  01 Input2-I2 PIC 9(3) VALUE 200.
  01 Output1-O1 PIC 9(5).

  Procedure Division.
    Begin.
      Multiply Input1-I1 by 2 giving Output1-O1.
      Add Input2-I2 to Output1-O1.
      Display 'The final result is: ' Output1-O1.
      Stop Run.
    End.