Identification Division.
Program-ID. CALCULATOR.

Environment Division.
Input-Output Section.
File-Control.
Select In-File Assign To Disk Status Is In-Status
Organization Is Line Sequential.

Select Out-File Assign To Disk Status Is Out-Status
Organization Is Line Sequential.

Data Division.
File Section.
Fd In-File,
01 In-Record.
   05 In-Num1   Pic X(10).
   05 In-Num2   Pic X(10).
   05 In-Op     Pic X.

Fd Out-File,
01 Out-Record Pic X(20).


Working-Storage Section.
01 Operator Table.
   03 Add Sign Pic X Value "+".
   03 Sub Sign Pic X Value "-".
   03 Mul Sign Pic X Value "*".
   03 Div Sign Pic X Value "/".

Procedure Division.
Calculate-Numbers.
   Open Input In-File.
   Open Output Out-File.

   Perform Read-Record
   Until In-Status = "10"

   Close In-File.
   Close Out-File.
   
   Stop Run.

Read-Record.
   Read In-File
   At End
      Move "10" To In-Status
   Not At End
      Compute Out-Record = In-Num1 Operator-Table(In-Op) In-Num2
      Write Out-Record.