IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNT PIC 9(2).
01 WS-SCORES.
    03 WS-GRADES OCCURS 10 TIMES INDEXED BY I.
       05 WS-SCORE PIC 9(3).

PROCEDURE DIVISION.
INITIALIZE WS-COUNT TO 0.
PERFORM UNTIL WS-COUNT = 10
    ADD 1 TO WS-COUNT
    DISPLAY "Enter score for student " WS-COUNT ": "
    ACCEPT WS-SCORES(WS-COUNT)
END-PERFORM.

PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    IF WS-SCORES(I) > 90
        DISPLAY "Student " WS-COUNT " received an A grade."
    ELSE IF WS-SCORES(I) > 80
        DISPLAY "Student " WS-COUNT " received a B grade."
    ELSE IF WS-SCORES(I) > 70
        DISPLAY "Student " WS-COUNT " received a C grade."
    ELSE IF WS-SCORES(I) > 60
        DISPLAY "Student " WS-COUNT " received a D grade."
    ELSE
        DISPLAY "Student " WS-COUNT " received an F grade."
END-PERFORM.

STOP RUN.