IDENTIFICATION DIVISION.
PROGRAM-ID. GENERATE-INVOICE.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SENDER-INVOICE-OUT. 
    SELECT INVOICE-FILE-OUT
    ASSIGN TO 'INVOICE-OUT.DAT'.
DATA DIVISION.
FILE SECTION.
FD INVOICE-FILE-OUT.
01 INVOICE-OUT-RECORD.
    05 INVOICE-NUMBER PIC 9(6).
    05 CUSTOMER-ID PIC X(10).
    05 INVOICE-DATE PIC 9(8).
    05 INVOICE-AMOUNT PIC 9(9)V99.
WORKING-STORAGE SECTION.
01 WS-CURRENT-DATETIME.
    05 WS-CURRENT-DATE PIC 9(8).
    05 WS-CURRENT-TIME PIC 9(6).
01 WS-TOTAL-AMOUNT PIC 9(9)V99 VALUE 0.
01 WS-CURRENT-INVOICE-DATE PIC 9(8).
01 HAPPY-CUSTOMERS-COUNT PIC 9(6) COMP.

PROCEDURE DIVISION.
MAIN-LOGIC.
    PERFORM OPEN-INVOICE-OUT-FILE.
    PERFORM GENERATE-INVOICE-RECORDS UNTIL HAPPY-CUSTOMERS-COUNT > 100.
    PERFORM CLOSE-INVOICE-OUT-FILE.
    GOBACK.

OPEN-INVOICE-OUT-FILE.
    OPEN OUTPUT INVOICE-FILE-OUT.

GENERATE-INVOICE-RECORDS.
    MOVE 1 TO INVOICE-NUMBER.
    MOVE 'CUSTOMER123' TO CUSTOMER-ID.
    PERFORM GENERATE-DATE.
    MOVE 100 TO INVOICE-AMOUNT.
    ADD INVOICE-AMOUNT TO WS-TOTAL-AMOUNT.
    ADD 1 TO HAPPY-CUSTOMERS-COUNT.
    WRITE INVOICE-OUT-RECORD.

GENERATE-DATE.
    MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATETIME.
    MOVE WS-CURRENT-TIME TO INVOICE-DATE.
    IF WS-CURRENT-DATE > WS-CURRENT-INVOICE-DATE THEN
        MOVE WS-CURRENT-DATE TO WS-CURRENT-INVOICE-DATE.

CLOSE-INVOICE-OUT-FILE.
    CLOSE INVOICE-FILE-OUT.