IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(4).
01 NUMERIC-ARRAY.
05 NUMERIC-ELEMENT PIC 9(5) OCCURS 100 TIMES.
01 ALPHA-ARRAY.
05 ALPHA-ELEMENT PIC A(10) OCCURS 100 TIMES.
PROCEDURE DIVISION.
ACCEPT ARRAY-SIZE.
MOVE 10 TO ARRAY-SIZE.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
    COMPUTE NUMERIC-ELEMENT(I) = I * 10.
    INSPECT ALPHA-ELEMENT(I) TALLYING J FOR ALL SPACE
    REPLACE LEADING BY '+' AFTER INITIAL J.
* COMMENT ADDING 10 TO EACH VALUE IN NUMERIC-ARRAY.
DISPLAY "UPDATED NUMERIC ARRAY:".
PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
    DISPLAY NUMERIC-ELEMENT(I).
END.