ID DIVISION.
PROGRAM-ID. TEST-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBER PIC 9(3) VALUE 500.
01 RESULT PIC 9(5).

PROCEDURE DIVISION.
MULTIPLY NUMBER BY 100 GIVING RESULT.

DISPLAY "The result is: " RESULT.

STOP RUN.