IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-SEQUENCE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO DISK
           SELECT OUTPUT-FILE ASSIGN TO PRINTER.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
           01 INPUT-RECORD.
           05 INPUT-NUMBER PIC 9(3).

       SD OUTPUT-FILE.
           01 OUTPUT-RECORD.
           05 OUTPUT-NUMBER PIC 9(3).

       WORKING-STORAGE SECTION.
       01 NUM-COUNTER PIC 99 VALUE ZERO.

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OUTPUT OUTPUT-FILE.

       PERFORM GENERATE-SEQUENCE UNTIL INPUT-FILE = "STOP".

       CLOSE INPUT-FILE
       OUTPUT FILE.

       GENERATE-SEQUENCE.
            PERFORM VARYING NUM-COUNTER FROM 1 BY 1 UNTIL NUM-COUNTER = INPUT-NUMBER
            MOVE NUM-COUNTER TO OUTPUT-NUMBER
            WRITE OUTPUT-RECORD.

       **** END OF PROGRAM