Identification Division.
Program-ID. CalculateSum.

Data Division.
Working-Storage Section.
01 Num1 PIC 9(3).
01 Num2 PIC 9(p).
01 Result PIC 9(3).

Procedure Division.
Display "Enter the first number: ".
Accept Num1.
Display "Enter the second number: ".
Accept Num2.

Add Num2 to Num1 giving Result.
Display "The sum is: ", Result.
Stop Run.