IDENTIFICATION DIVISION.
           PROGRAM-ID. CALCULATE-SUM.
           ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT INPUT-FILE
                   ASSIGN TO 'input.txt'.
               SELECT OUTPUT-FILE
                   ASSIGN TO 'output.txt'.
           DATA DIVISION.
           FILE SECTION.
           FD INPUT-FILE
               RECORDING MODE F.
           01 INPUT-RECORD.
               05 INPUT-NUM1 PIC 9(5).
               05 INPUT-NUM2 PIC 9(5).
           FD OUTPUT-FILE
               RECORDING MODE F.
           01 OUTPUT-RECORD.
               05 OUTPUT-NUM1 PIC 9(5).
               05 OUTPUT-NUM2 PIC 9(5).
               05 OUTPUT-SUM PIC 9(6).
           WORKING-STORAGE SECTION.
           01 WS-TOTAL PIC 9(6).
           01 WS-TOTAL-TEXT REDEFINES WS-TOTAL.
               05 FILLER PIC X(20) VALUE 'SUM OF TWO NUMBERS: '.
               05 WS-TOTAL-NUM PIC 9(6).
           PROCEDURE DIVISION.
           MAIN-PROCEDURE.
               OPEN INPUT INPUT-FILE
               OPEN OUTPUT OUTPUT-FILE
               PERFORM UNTIL END-OF-FILE = 'YES'
                   READ INPUT-FILE
                       AT END SET END-OF-FILE TO 'YES'
                   END-READ
                   IF INPUT-NUM1 = ZERO AND INPUT-NUM2 = ZERO
                       MOVE ZERO TO OUTPUT-SUM
                   ELSE
                       ADD INPUT-NUM1 INPUT-NUM2 GIVING WS-TOTAL-NUM
                       MOVE WS-TOTAL TO OUTPUT-SUM
                   END-IF
                   WRITE OUTPUT-RECORD
               END-PERFORM
               CLOSE INPUT-FILE
               CLOSE OUTPUT-FILE
               STOP RUN.