IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(9) VALUE 100000000.
       01 NUM2 PIC S9(9) VALUE 200000000.
       01 RESULT PIC S9(9) VALUE 0.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           COMPUTE RESULT = NUM1 + NUM2.
           DISPLAY "The sum is: " RESULT.
           STOP RUN.
       END PROGRAM.