WORKING-STORAGE SECTION.
          01  WS-CUSTOMER-DATA.
              02 WS-CUST-NAME       PIC X(20).
              02 WS-CUST-AGE        PIC 99.
              02 WS-CUST-ADDRESS    PIC X(30).
              02 WS-CUST-STATE      PIC X(2).

      PROCEDURE DIVISION.
          PERFORM INITIALIZE-CUSTOMER-DATA.

          PERFORM INPUT-CUSTOMER-DATA UNTIL WS-CUST-AGE = 99

          DISPLAY "Customer Name: " WS-CUST-NAME
          DISPLAY "Customer Age: " WS-CUST-AGE
          DISPLAY "Customer Address: " WS-CUST-ADDRESS
          DISPLAY "Customer State: " WS-CUST-STATE

          PERFORM PROCESS-CUSTOMER-DATA

          STOP RUN.

      INITIALIZE-CUSTOMER-DATA.
          MOVE SPACES TO WS-CUSTOMER-DATA.

      INPUT-CUSTOMER-DATA.
          DISPLAY "Enter Customer Name: "
          ACCEPT WS-CUST-NAME.
          DISPLAY "Enter Customer Age: "
          ACCEPT WS-CUST-AGE.
          DISPLAY "Enter Customer Address: "
          ACCEPT WS-CUST-A