01  WS-ORDER-DATA-RECORD. 
           05 WS-ORDER-NUMBER            PIC 9(6).  
           05 WS-ORDER-DATE              PIC X(8).  
           05 WS-ORDER-AMOUNT            PIC 9(7)V99.  
           05 WS-ORDER-ITEMS. 
               10 WS-ITEM OCCURS 10 TIMES.
                   15 WS-ITEM-CODE        PIC 9(5).  
                   15 WS-ITEM-QUANTITY    PIC 9(3).  
                   15 WS-ITEM-PRICE       PIC 9(5)V99.
                   15 WS-ITEM-TOTAL       PIC 9(7)V99.  
           05 WS-SHIPPING-DATE           PIC X(8). 
           05 WS-SHIPPING-COST           PIC 9(5)V99. 
           05 WS-ORDER-TOTAL-AMOUNT      PIC 9(9)V99. 
       PROCEDURE DIVISION. 
           MAIN-LOGIC SECTION. 
               PERFORM INITIALIZATION.  
               PERFORM PROCESS-ORDER-DATA. 
               PERFORM CALCULATE-ORDER-AMOUNT.  
               PERFORM DISPLAY-ORDER.  
               STOP RUN. 
       INITIALIZATION SECTION. 
           INITIALIZE WS-ORDER-DATA-RECORD 
           PERFORM DISPLAY-INITIALIZATION-MESSAGE. 
       PROCESS-ORDER-DATA SECTION. 
           PERFORM READ-ORDER-DATA UNTIL WS-ORDER-NUMBER = '999999'. 
       CALCULATE-ORDER-AMOUNT SECTION. 
           MULTIPLY WS-ITEM-QUANTITY BY WS-ITEM-PRICE GIVING WS-ITEM-TOTAL. 
           COMPUTE WS-ORDER-AMOUNT = WS-ORDER-AMOUNT + WS-ITEM-TOTAL. 
           COMPUTE WS-ORDER-TOTAL-AMOUNT = WS-ORDER-AMOUNT + WS-SHIPPING-COST. 
       DISPLAY-ORDER SECTION. 
           DISPLAY 'ORDER NUMBER: ' WS-ORDER-NUMBER. 
           DISPLAY 'ORDER DATE: ' WS-ORDER-DATE. 
           DISPLAY 'ORDER AMOUNT: ' WS-ORDER-TOTAL-AMOUNT. 
       DISPLAY-INITIALIZATION-MESSAGE SECTION. 
           DISPLAY 'ORDER PROCESSING SYSTEM INITIALIZED'.