IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM1.
 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMER-FILE ASSIGN TO 'CUSTFILE.DAT'.
 
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMER-FILE
           RECORDING MODE IS F
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 10 RECORDS
           DATA RECORD IS CUSTOMER-RECORD.
       01 CUSTOMER-RECORD.
           05 CUSTOMER-NAME         PIC X(30).
           05 CUSTOMER-ADDRESS      PIC X(30).
           05 CUSTOMER-CITY         PIC X(20).
           05 CUSTOMER-STATE        PIC X(2).
           05 CUSTOMER-ZIP          PIC X(5).
 
       WORKING-STORAGE SECTION.
       01 NUM-RECORDS              PIC 99.
       01 TOTAL-ZIP-4              PIC 9(5) VALUE 0.
       01 TOTAL-ZIP-5              PIC 9(5) VALUE 0.
       01 TOTAL-RECORDS-IN-ZIP-4   PIC 99 VALUE 0.
       01 TOTAL-RECORDS-IN-ZIP-5   PIC 99 VALUE 0.
 
       PROCEDURE DIVISION.
       0000-MAIN.
           OPEN INPUT CUSTOMER-FILE.
           READ CUSTOMER-FILE INTO CUSTOMER-RECORD
               AT END DISPLAY 'NO RECORDS FOUND'
           PERFORM UNTIL CUSTOMER-RECORD = '*'
               IF CUSTOMER-ZIP(1:1) = '0'
                   ADD 1 TO TOTAL-ZIP-5
               ELSE
                   ADD 1 TO TOTAL-ZIP-4
               END-IF
               READ CUSTOMER-FILE INTO CUSTOMER-RECORD
           END-PERFORM.
 
           CLOSE CUSTOMER-FILE.
 
           MOVE TOTAL-ZIP-4 TO TOTAL-RECORDS-IN-ZIP-4.
           MOVE TOTAL-ZIP-5 TO TOTAL-RECORDS-IN-ZIP-5.
 
           STOP RUN.