01  READING-FILE.
           COPY INPUT-FILE-INFORMATION TO INPUT-FILE.

       PROCEDURE DIVISION.
           PERFORM UNTIL FILE-STATUS OR END-OF-FILE
               READ INPUT-FILE-INFORMATION
                   AT END MOVE SPACE TO WS-END-OF-FILE-INDICATOR
               END-READ
               IF WS-END-OF-FILE-INDICATOR EQUAL TO 'Y'
                   SET END-OF-FILE TO TRUE
                   GO TO PARA-FINISH
               END-IF
               PERFORM PARA-PROCESS
           END-PERFORM
       PARA-PROCESS.
           PERFORM WITH TEST BEFORE
               IF WS-RECORD-COUNT GREATER THAN 100
                   PERFORM PARA-LOG-TO-OUTPUT-FILE
                   MOVE ZERO TO WS-RECORD-COUNT
               END-IF
               ADD 1 TO WS-RECORD-COUNT
           END-PERFORM

       PARA-LOG-TO-OUTPUT-FILE.
           DISPLAY 'Record Count has reached 100'
           MOVE RESULT-NAME TO WS-OUTPUT-RECORD
           WRITE OUTPUT-FILE-INFORMATION
           IF FILE-STATUS NOT EQUAL TO '00'
               DISPLAY 'Error writing to output file'
               MOVE SPACE TO WS-OUTPUT-RECORD
               SET FILE-STATUS TO TRUE
           END-IF
       PARA-FINISH.
           CLOSE INPUT-FILE-INFORMATION
           CLOSE OUTPUT-FILE-INFORMATION
           DISPLAY 'Finished processing input file.'