IDENTIFICATION DIVISION.
PROGRAM-ID. DOUBLER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-INPUT PIC 9(15)V9(3).
01 NUM-OUTPUT PIC 9(15)V9(3).
PROCEDURE DIVISION.
MAIN-LOGIC.
    ACCEPT NUM-INPUT.
    MULTIPLY NUM-INPUT BY 2 GIVING NUM-OUTPUT.
    DISPLAY "The doubled value is: " NUM-OUTPUT.
    STOP RUN.