IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       * This program prints "Hello, world!" 
       * to the screen.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           * This section defines the input and output files.
           SELECT PRINTER ASSIGN TO "PRINTER".
           SELECT KEYBOARD ASSIGN TO "KEYBOARD".
       DATA DIVISION.
       FILE SECTION.
       FD PRINTER.
       01 PRINTER-LINE PIC X(20).
       FD KEYBOARD.
       01 KEYBOARD-INPUT PIC X(20).
       WORKING-STORAGE SECTION.
       01 WS-FLAG1 PIC X.
       88 WS-FLAG1-TRUE VALUE 'T'.
       01 WS-FLAG2 PIC X.
       88 WS-FLAG2-TRUE VALUE 'T'.
       01 WS-INDEX PIC 9(2).
       01 WS-TEXT PIC X(20) VALUE "Hello, world!".
       PROCEDURE DIVISION.
       * Checks for input from the keyboard.
       PERFORM CHECK-KEYBOARD UNTIL WS-FLAG1-TRUE.
       * Prints "Hello, world!" to the screen.
       PERFORM PRINT-HELLO-WORLD UNTIL WS-FLAG2-TRUE.
       * Checks if keyboard input is "END".
       CHECK-KEYBOARD.
           DISPLAY "Enter input: ".
           ACCEPT KEYBOARD-INPUT.
           IF KEYBOARD-INPUT = "END"
               SET WS-FLAG1-TRUE TO TRUE.
           END-IF.
       * Prints "Hello, world!" to the screen.
       PRINT-HELLO-WORLD.
           MOVE WS-TEXT TO PRINTER-LINE.
           WRITE PRINTER-LINE.
           SET WS-FLAG2-TRUE TO TRUE.
       STOP RUN.