IDENTIFICATION DIVISION.
       PROGRAM-ID. Program1.
       AUTHOR. John Doe.
       DATE-WRITTEN. 01/01/2021.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT Input-File ASSIGN TO 'input.txt'
       ORGANIZATION IS SEQUENTIAL.
       
       SELECT Output-File ASSIGN TO 'output.txt' 
       ORGANIZATION IS SEQUENTIAL. 
       
       DATA DIVISION. 
       FILE SECTION. 
       FD Input-File. 
       01 Input-Record.
       05 Input-Name PIC X(20).
       01 Output-Record.
       05 Output-Name PIC X(20).
       
       WORKING-STORAGE SECTION.
       01 Count PIC 9(3) VALUE 0.
       
       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           OPEN INPUT Input-File
           OUTPUT Output-File
           PERFORM READ-INPUT UNTIL EOF 
           CLOSE Input-File 
           CLOSE Output-File 
           STOP RUN. 
           
       READ-INPUT.
           READ Input-File 
           AT END SET EOF TO TRUE 
           NOT AT END 
               ADD 1 TO Count 
               MOVE Input-Name TO Output-Name 
               WRITE Output-Record 
       END-READ.
       
       END-PROGRAM Program1.