IDENTIFICATION DIVISION.
PROGRAM-ID. EMPLOYEE-SALARY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 SALARY-TABLE.
   02 EMPLOYEE-NAME PIC X(25) VALUE "JANE SMITH".
   02 EMPLOYEE-ID PIC 9(6) VALUE 123456.
   02 EMPLOYEE-JOB-LEVEL PIC 9(2) VALUE 10.
   02 EMPLOYEE-SALARY PIC 9(8)V99 VALUE 50000.00.
   02 ADDICTION PIC 9(3) VALUE 5.
   02 TOTAL-SALARY PIC 9(10)V99.

PROCEDURE DIVISION.
BEGIN.
   MULTIPLY EMPLOYEE-SALARY BY EMPLOYEE-JOB-LEVEL GIVING TOTAL-SALARY.
   COMPUTE TOTAL-SALARY ROUNDED = TOTAL-SALARY + (ADDICTION * 500.00).
   DISPLAY "Employee" SPACE EMPLOYEE-ID "whose name is" SPACE EMPLOYEE-NAME "has a salary of $" TOTAL-SALARY.
   STOP RUN.
END PROGRAM EMPLOYEE-SALARY.