IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
ENVIRONMENT DIVISION.
DATA DIVISION.

01 INPUT-DATA.
   05 A PIC 9(6) VALUE 123456.
   05 B PIC X.
   05 C PIC 9(6)V99.

01 OUTPUT-DATA.
   05 RESULT PIC 9(10)V99.

PROCEDURE DIVISION.
   PERFORM MULTIPLICATION WITH TEST AFTER VARYING A FROM 1
        BY 2 UNTIL A > 10
        AND MULTIPLY B BY 0.5
        AND DIVIDE C BY 10
        END-PERFORM.

MULTIPLICATION.
   MULTIPLY A BY B GIVING RESULT.
   DISPLAY 'The result is:' RESULT.