*> This program calculates the average of a set of numbers
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AVERAGE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNT PIC 99. *> variable for number of inputs
       01 TOTAL PIC 9999. *> variable to store total sum
       01 AVERAGE PIC 9999V99. *> variable to store calculated average
       01 NUMBERS PIC 9(3) OCCURS 10 TIMES. *> array to store input numbers
       PROCEDURE DIVISION.
       BEGIN.
           PERFORM INPUT-LOOP *> perform input loop
           PERFORM CALCULATE-AVERAGE *> perform average calculation
           DISPLAY "The average of the numbers is " AVERAGE *> display average
           STOP RUN.
       INPUT-LOOP.
           DISPLAY "Enter number: "
           ACCEPT NUMBERS(COUNT) *> accept input and store in array at current count
           ADD 1 TO COUNT *> increment input count
           IF COUNT < 10 *> loop until 10 inputs received
               PERFORM INPUT-LOOP *> perform input loop again
           END-IF.
       CALCULATE-AVERAGE.
           PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT = 10 *> loop through array
               ADD NUMBERS(COUNT) TO TOTAL *> add current number to total
           END-PERFORM.
           DIVIDE TOTAL BY 10 *> divide total by number of inputs
           MOVE TOTAL TO AVERAGE *> store calculated average
           DISPLAY "Calculation complete.".