IDENTIFICATION DIVISION.
      PROGRAM-ID.  Print-Table.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT Book-List-File ASSIGN TO 'BOOKLIST.DAT'.

      DATA DIVISION.
      FILE SECTION.
      FD Book-List-File.
      01 Book-Record.
          05 Book-Name       PIC X(30).
          05 Book-Price      PIC 9(5)V99.

      WORKING-STORAGE SECTION.
      01 Book-Count             PIC 9(3).
      01 Tax-Rate               PIC 9(3)V99 VALUE 0.07.

      PROCEDURE DIVISION.
      Begin-Procedure.
          OPEN INPUT Book-List-File
          PERFORM Read-Book-Records UNTIL Book-Count = 5
          CLOSE Book-List-File
      End-Procedure.

      Read-Book-Records.
          READ Book-List-File
          AT END
              MOVE 1 TO Book-Count
          NOT AT END
              ADD 1 TO Book-Count
              COMPUTE Book-Tax = Book-Price * Tax-Rate
              DISPLAY 'Book Name: ' Book-Name
              DISPLAY 'Book Price: ' Book-Price
              DISPLAY 'Book Tax: ' Book-Tax
              DISPLAY 'Total Price: ' Book-Price + Book-Tax
      End-Read-Book-Records.

      IDENTIFICATION DIVISION.
      PROGRAM-ID.  Print-Table.

      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT Book-List-File ASSIGN TO 'BOOKLIST.DAT'.

      DATA DIVISION.
      FILE SECTION.
      FD Book-List-File.
      01 Book-Record.
          05 Book-Name       PIC X(30).
          05 Book-Price      PIC 9(5)V99.


      WORKING-STORAGE SECTION.
      01 Book-Count             PIC 9(3).
      01 Tax-Rate               PIC 9(3)V99 VALUE 0.07.


      PROCEDURE DIVISION.
      Begin-Procedure.
          OPEN INPUT Book-List-File
          PERFORM Read-Book-Records UNTIL Book-Count = 5
          CLOSE Book-List-File
      End-Procedure.

      Read-Book-Records.
          READ Book-List-File
          AT END
              MOVE 1 TO Book-Count
          NOT AT END
              ADD 1 TO Book-Count
              COMPUTE Book-Tax = Book-Price * Tax-Rate
              DISPLAY 'Book Name: ' Book-Name
              DISPLAY 'Book Price: ' Book-Price
              DISPLAY 'Book Tax: ' Book-Tax
              DISPLAY 'Total Price: ' Book-Price + Book-Tax
      End-Read-Book-Records.