Identification Division.
Program-Id. HelloWorld.
Author. Jane Doe.
Date-Written. 01/01/2020.
Date-Compiled. 01/03/2020.
Description. This is a simple COBOL program that prints "Hello, world!" to the screen.

Environment Division.
Input-Output Section.
File-Control.
Select Screen-Out Assign to System-Display.

Data Division.
File Section.
FD Screen-Out.
01 Screen-Text Pic X(12).

Working-Storage Section.
01 Screen-Category Pic X(9) Value "Hello, ".
01 Screen-Name Pic X(9) Value "World!".

Procedure Division.
Display Screen-Category upon Screen-Text.
Move Screen-Name to Screen-Text.
Display Screen-Text upon Screen-Text.
Stop Run.