IDENTIFICATION DIVISION.
       PROGRAM-ID. Hello-World-Program.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-MAINFRAME.
       OBJECT-COMPUTER. IBM-MAINFRAME.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT IN-FILE ASSIGN TO INFILE-IN.
       SELECT OUT-FILE ASSIGN TO OUTFILE-OUT.
       
       DATA DIVISION.
       FILE SECTION.
       FD  INFILE-IN
           RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS STANDARD
           DATA RECORD IS IN-RECORD.
       01 IN-RECORD.
           05 IN-NAME PIC A(20).
           05 IN-AGE PIC 99.
           05 IN-LOCATION PIC A(10).
       
       FD  OUTFILE-OUT
           RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS STANDARD
           DATA RECORDS ARE OUT-RECORD.
       01 OUT-RECORD.
           05 OUT-NAME PIC A(20).
           05 OUT-AGE PIC 99.
           05 OUT-MESSAGE PIC X(50).
       
       WORKING-STORAGE SECTION.
       01 WS-COUNT PIC 9(3) VALUE ZERO.
       01 WS-TOTAL-AGE PIC 9(3) VALUE ZERO.
       01 WS-AVERAGE-AGE PIC 9(3)V99.
       
       PROCEDURE DIVISION.
       000-MAIN.
           OPEN INPUT INFILE-IN
           OUTPUT OUTFILE-OUT.
           
       100-LOOP.
           READ INFILE-IN
               AT END GO TO 200-EXIT.
           ADD 1 TO WS-COUNT.
           ADD IN-AGE TO WS-TOTAL-AGE.
           DIVIDE WS-TOTAL-AGE BY WS-COUNT
               GIVING WS-AVERAGE-AGE.
           MOVE IN-NAME TO OUT-NAME.
           MOVE IN-AGE TO OUT-AGE.
           STRING "Hello " DELIMITED BY SIZE
               IN-NAME DELIMITED BY SIZE
               ", your average age is " DELIMITED BY SIZE
               WS-AVERAGE-AGE DELIMITED BY SIZE
               "!" DELIMITED BY SIZE
               INTO OUT-MESSAGE.
           WRITE OUTLINE-REC FROM OUT-RECORD.
           GO TO 100-LOOP.
           
       200-EXIT.
           CLOSE INFILE-IN
           OUTFILE-OUT.
           STOP RUN.