IDENTIFICATION DIVISION.
      PROGRAM-ID. MYPROGRAM.
      AUTHOR. JOHN SMITH.
      DATE WRITTEN. JULY 21, 2021.
      DATE-COMPILED.
      
      DATA DIVISION.
      FILE SECTION.
      FD INPUT-FILE
      01 INPUT-RECORD.
         05 IDNO PIC X(10).
         05 NAME PIC X(20).
         05 SALARY PIC 9(5).
         05 PROJECTS OCCURS 10 TIMES.
            10 PROJECT-NAME PIC X(15).
            10 PROJECT-HOURS PIC 99.
      
      WORKING-STORAGE SECTION.
      01 TOTAL-SALARY PIC 9(7)V99.
      01 TOTAL-HOURS PIC 9(4).
      01 NUMBER-OF-PROJECTS PIC 99.
      01 AVERAGE-SALARY PIC 9(6)V99.
      
      PROCEDURE DIVISION.
      BEGIN.
          OPEN INPUT INPUT-FILE.
          READ INPUT-FILE.
      LOOP.
          PERFORM CALCULATE-SALARY.
          ADD PROJECT-HOURS TO TOTAL-HOURS.
          ADD 1 TO NUMBER-OF-PROJECTS.
          READ INPUT-FILE.
          AT END MOVE "N" TO END-OF-FILE.
      END-LOOP.
      CLOSE INPUT-FILE.
      PERFORM CALCULATE-AVERAGE.
      DISPLAY "Total salary: " TOTAL-SALARY.
      DISPLAY "Total hours: " TOTAL-HOURS.
      DISPLAY "Average salary: " AVERAGE-SALARY.
      STOP RUN.
      
      CALCULATE-SALARY.
          MULTIPLE SALARY BY PROJECT-HOURS GIVING SALARY.
          ADD SALARY TO TOTAL-SALARY.
      
      CALCULATE-AVERAGE.
          DIVIDE TOTAL-SALARY BY NUMBER-OF-PROJECTS GIVING AVERAGE-SALARY.