IDENTIFICATION DIVISION.  
 PROGRAM-ID. HELLO-WORLD.  
 DATA DIVISION.  
 WORKING-STORAGE SECTION.  
 01  WS-HELLO-MESSAGE PIC X(11) VALUE 'HELLO WORLD'.  
 LINKAGE SECTION.  
 01  LS-INPUT-NUMBER PIC 9(3) USAGE COMP.  
 01  LS-OUTPUT-NUMBER PIC 9(3) USAGE COMP.  
 PROCEDURE DIVISION USING LS-INPUT-NUMBER, LS-OUTPUT-NUMBER.  
 DISPLAY 'Enter a number between 100 and 999: '.  
 ACCEPT LS-INPUT-NUMBER FROM CONSOLE.  
 PERFORM CHECK-NUMBER.  
 DISPLAY 'The number you entered is: '.  
 DISPLAY LS-OUTPUT-NUMBER.  
 STOP RUN.  
 CHECK-NUMBER SECTION.  
 IF LS-INPUT-NUMBER < 100 OR LS-INPUT-NUMBER > 999  
     DISPLAY 'Invalid number entered.'  
 ELSE  
     MOVE LS-INPUT-NUMBER TO LS-OUTPUT-NUMBER.  
     DISPLAY 'Number successfully validated.'  
 END-IF.