IDENTIFICATION DIVISION.
       PROGRAM-ID. LONG-CODE.
       AUTHOR. YOUR-NAME.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 INPUT-ARRAY.
           05 NUMBERS OCCURS 10 TIMES.
               10 NUM PIC 9(2).

       01 OUTPUT-ARRAY.
           05 SORTED-NUMBERS OCCURS 10 TIMES.
               10 VALUE PIC 9(2).

       PROCEDURE DIVISION.
       START-OF-PROGRAM.
           DISPLAY "Welcome to Long Code!".

           PERFORM ACCEPT-INPUT UNTIL END-OF-INPUT
           PERFORM SORT-ARRAY
           PERFORM DISPLAY-OUTPUT
           
           STOP RUN.

       ACCEPT-INPUT.
           DISPLAY "Enter a number:".
           ACCEPT NUM FROM CONSOLE
           IF NUM = 0
               SET END-OF-INPUT TO TRUE
           ELSE
               ADD 1 TO INDEX
               MOVE NUM TO NUMBERS(INDEX)

       SORT-ARRAY.
           SET END-OF-SORT TO FALSE
           PERFORM UNTIL END-OF-SORT
               SET END-OF-SORT TO TRUE
               PERFORM VARYING I FROM 2 BY 1 UNTIL I > INDEX
                   IF SORTED-NUMBERS(I-1) > SORTED-NUMBERS(I)
                       MOVE SORTED-NUMBERS(I) TO TEMP-VALUE
                       MOVE SORTED-NUMBERS(I-1) TO SORTED-NUMBERS(I)
                       MOVE TEMP-VALUE TO SORTED-NUMBERS(I-1)
                       SET END-OF-SORT TO FALSE

       DISPLAY-OUTPUT.
           DISPLAY "The sorted numbers are:".
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > INDEX
               DISPLAY SORTED-NUMBERS(I)