01  STUDENT-FILE.                                            
           05  STUDENT-RECORD OCCURS 50 TIMES.                          
               10  STUDENT-ID PIC X(5).                                     
               10  STUDENT-NAME.                                          
                   15  FIRST-NAME PIC X(10).                            
                   15  MIDDLE-INITIAL PIC X.                             
                   15  LAST-NAME PIC X(10).                             
               10  STUDENT-ADDRESS PIC X(20).                           
               10  STUDENT-AGE PIC 9(2).                          
               10  STUDENT-GRADES.                                
                   15  COURSE-NAME OCCURS 5 TIMES.                
                       20  COURSE-ID PIC X(5).                   
                       20  COURSE-GRADE PIC X.                   
                   15  CLASS-RANK PIC 9(2).                       
                               
       01  COURSE-FILE.                                                
           05  COURSE-RECORD OCCURS 5 TIMES.                           
               10  COURSE-ID PIC X(5).                                 
               10  COURSE-TITLE PIC X(15).                             
               10  COURSE-CREDITS PIC 9(2).                            
               10  COURSE-TYPE PIC X(10).                              
                                                                  
       PROCEDURE DIVISION. 
                       
       MAIN PROCEDURE SECTION. 
       *** This is the main procedure section. ***
           
       BEGIN. 
       *** This is the start of the program. ***
           
           OPEN INPUT COURSE-FILE.                             
           OPEN INPUT STUDENT-FILE.                            
           
           PERFORM UNTIL END-OF-FILE                            
               READ COURSE-FILE                                  
                   AT END                                         
                       SET END-OF-FILE TO TRUE                     
                   NOT AT END                                      
                       PERFORM PROCESS-COURSE.                 
                       
               READ STUDENT-FILE                                 
                   AT END                                         
                       SET END-OF-FILE TO TRUE.                    
                   NOT AT END                                      
                       PERFORM PROCESS-STUDENT.                        
                       
               END-READ.                                           
           END-PERFORM.                                             
           
           CLOSE COURSE-FILE.                                       
           CLOSE STUDENT-FILE.                                      
           
           STOP RUN.                                               
                                                               
       PROCESS-COURSE. 
       *** This is the process for each course record. ***
           
           COMPUTE COURSE-CREDITS = COURSE-CREDITS * STUDENT-AGE. 
           
           IF COURSE-NAME(1) = "MATH" THEN 
               SET CLASS-RANK TO 1. 
           END-IF. 
           
           WRITE COURSE-RECORD. 
               
       PROCESS-STUDENT. 
       *** This is the process for each student record. ***
           
           IF STUDENT-AGE > 18 THEN 
               SET STUDENT-ADDRESS TO "ADULT". 
           ELSE 
               SET STUDENT-ADDRESS TO "MINOR". 
           END-IF. 
           
           WRITE STUDENT-RECORD. 
               
           SET CLASS-RANK UP BY 1.
       END PROGRAM.