* This is a sample program in COBOL
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-STRING PIC X(50).
       01 CHAR-COUNT PIC 99.
       
       PROCEDURE DIVISION.
       DISPLAY "Enter a sentence: ".
       ACCEPT INPUT-STRING.
       COMPUTE CHAR-COUNT = FUNCTION LENGTH(INPUT-STRING).
       DISPLAY "Number of characters: " CHAR-COUNT.
       
       STOP RUN.
       
       END PROGRAM SAMPLE.
       
* This program prompts the user to enter a sentence and then counts the number of characters in the sentence. The result is displayed to the user.