DATA DIVISION.
      WORKING-STORAGE SECTION.
      01  WS-NUMERIC   PIC 9(5) VALUE 12345.
      01  WS-ALPHANUM  PIC A(10) VALUE "HELLO WORLD".
      01  WS-RESULT   PIC 9(5).

      PROCEDURE DIVISION.
      COMPUTE WS-RESULT = WS-NUMERIC + FUNCTION LENGTH(WS-ALPHANUM) * WS-NUMERIC.

      DISPLAY "The result is " WS-RESULT.
      STOP RUN.