IDENTIFICATION DIVISION.                                   
PROGRAM-ID. MYPROGRAM.                                      
DATA DIVISION.                                              
FILE SECTION.                                               
FD MYFILE.                                                  
01 MYRECORD.                                                
   03 MYNAME    PIC X(20).                                   
   03 MYAGE     PIC 9(3).                                    
   03 MYADDRESS.                                             
      05 STREET       PIC X(30).                             
      05 CITY         PIC X(20).                             
      05 STATE        PIC X(2).                              
      05 ZIPCODE      PIC X(5).                              
WORKING-STORAGE SECTION.                                    
01 WS-COUNTER  PIC 9(3) VALUE 0.                             
01 WS-TOTAL-AGE  PIC 9(5) VALUE ZERO.                        
01 WS-MEAN-AGE  PIC 9(5)V99.                                 
PROCEDURE DIVISION.                                          
OPEN INPUT MYFILE.                                           
LOOPING.                                                     
    READ MYFILE INTO MYRECORD                                 
    AT END MOVE 'YES' TO WS-EOF                               
    NOT AT END                                               
        COMPUTE WS-COUNTER = WS-COUNTER + 1                   
        COMPUTE WS-TOTAL-AGE = WS-TOTAL-AGE + MYAGE           
END-READ.                                                    
COMPUTE WS-MEAN-AGE = WS-TOTAL-AGE / WS-COUNTER               
DISPLAY 'Total records: ' WS-COUNTER                          
DISPLAY 'Mean age: ' WS-MEAN-AGE                              
DISPLAY 'End of file? ' WS-EOF
CLOSE MYFILE.
STOP RUN.