IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX-COBOL.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 RESULT PIC S9(5)V9(2) VALUE 0.
77 NUM1 PIC S9(5) VALUE -12345.
77 NUM2 PIC S9(5) VALUE 23456.
PROCEDURE DIVISION.
MAIN-LOGIC.
    MULTIPLY NUM1 BY NUM2 GIVING RESULT.
    DISPLAY "The multiplied result is: " RESULT.
    STOP RUN.