IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-AVERAGE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORDS ARE OMITTED
       FD OUTPUT-FILE
           RECORDS ARE OMITTED
       WORKING-STORAGE SECTION.
       01 DATA-RECORD.
           05 FILE-ID PIC X(05).
           05 STUDENT-ID PIC 9(05).
           05 GRADE-1 PIC 9(03).
           05 GRADE-2 PIC 9(03).
           05 GRADE-3 PIC 9(03).
           05 GRADE-AVERAGE PIC 9(03)V9(02).
       01 TOTAL-GRADE.
           05 TOTAL-GRADES PIC 9(05).
       01 COUNTER.
           05 COUNT PIC 9(02).
       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM UNTIL EOF = 'Y'
           READ INPUT-FILE INTO DATA-RECORD
               IF FILE-ID = 'A'
                   PERFORM CALCULATE-AVERAGE
                   COMPUTE TOTAL-GRADES = TOTAL-GRADES + GRADE-AVERAGE
                   ADD 1 TO COUNT
                   WRITE OUTPUT-FILE FROM DATA-RECORD
               END-IF
           END-PERFORM
           DIVIDE TOTAL-GRADES BY COUNT GIVING GRADE-AVERAGE
           DISPLAY 'THE AVERAGE OF STUDENTS IN FILE ' FILE-ID ' IS ' GRADE-AVERAGE
           CLOSE INPUT-FILE, OUTPUT-FILE
           STOP RUN.
           CALCULATE-AVERAGE.
           COMPUTE GRADE-AVERAGE = (GRADE-1 + GRADE-2 + GRADE-3) / 3.