IDENTIFICATION DIVISION.
      PROGRAM-ID. Sample-Program.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 WS-EMPLOYEE.
         05 WS-NAME PIC X(20).
         05 WS-EMP-NO PIC 9(4).
         05 WS-SALARY PIC 9(6)V99.
      PROCEDURE DIVISION.
      ACCEPT WS-EMPLOYEE.
      DISPLAY "EMPLOYEE NAME: " WS-NAME.
      DISPLAY "EMPLOYEE NUMBER: " WS-EMP-NO.
      DISPLAY "EMPLOYEE SALARY: " WS-SALARY.
      IF WS-SALARY > 5000
            DISPLAY "HIGH SALARY"
      END-IF.
      STOP RUN.