IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO-COBOL.
           ENVIRONMENT DIVISION.
           DATA DIVISION.
               WORKING-STORAGE SECTION.
               01 MESSAGE PIC X(20) VALUE 'HELLO, WORLD!'.
           PROCEDURE DIVISION.
               DISPLAY MESSAGE.
               STOP RUN.