IDENTIFICATION DIVISION.
       PROGRAM-ID. Print-Payroll-Report.
       DATA DIVISION.
       FILE SECTION.
       FD Employee-File
       LABEL RECORDS ARE STANDARD.
       01 Employee-Record.
           05 Employee-Number      PIC 9(5).
           05 Employee-Name        PIC X(20).
           05 Employee-Address     PIC X(30).
           05 Employee-Position    PIC X(15).
           05 Employee-Salary      PIC 9(9)V99.
       WORKING-STORAGE SECTION.
       01 Current-Payroll        PIC S9(9)V99 VALUE ZERO.
       01 Total-Salary           PIC S9(9)V99 VALUE ZERO.
       PROCEDURE DIVISION.
       1000-START.
           OPEN INPUT Employee-File
           PERFORM UNTIL DONE = TRUE
               READ Employee-File
                   AT END MOVE 'YES' TO DONE
                   NOT AT END
                       COMPUTE Total-Salary = Total-Salary + Employee-Salary
                       PERFORM 2000-PRINT-REPORT
                   END-READ
           END-PERFORM.
       2000-PRINT-REPORT.
           DISPLAY 'Employee Number: ' Employee-Number
           DISPLAY 'Employee Name: ' Employee-Name
           DISPLAY 'Employee Address: ' Employee-Address
           DISPLAY 'Employee Position: ' Employee-Position
           DISPLAY 'Employee Salary: ' Employee-Salary
           DISPLAY '================================='
           ADD Employee-Salary TO Current-Payroll
       2000-EXIT.
           IF DONE = TRUE
               DISPLAY 'Total Payroll: ' Current-Payroll
               DISPLAY '================================='
               MOVE ZERO TO Current-Payroll
           END-IF.
       3000-CLOSE.
           CLOSE Employee-File.
           STOP RUN.