*** PROGRAM TO CALCULATE AREA AND PERIMETER OF A RECTANGLE ***

IDENTIFICATION DIVISION.
PROGRAM-ID. RECTANGLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LENGTH           PIC 9(3).
01 WIDTH            PIC 9(3).
01 AREA             PIC 9(5).
01 PERIM            PIC 9(5).

PROCEDURE DIVISION.
    DISPLAY "Enter length: " with no advancing.
    ACCEPT LENGTH.

    DISPLAY "Enter width: " with no advancing.
    ACCEPT WIDTH.

    COMPUTE AREA = LENGTH * WIDTH.
    COMPUTE PERIM = (2 * LENGTH) + (2 * WIDTH).

    DISPLAY "The area of the rectangle is: " AREA.
    DISPLAY "The perimeter of the rectangle is: " PERIM.

STOP RUN.