IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COMPANY-NAME PIC X(10) VALUE 'ABC COMPANY'.
01 NUM-EMPLOYEES PIC 9(5) VALUE 10000.
01 TOTAL-REVENUE PIC 9(8) VALUE 1000000.

PROCEDURE DIVISION.
DISPLAY 'Welcome to ' COMPANY-NAME.
DISPLAY 'There are currently ' NUM-EMPLOYEES ' employees at ' COMPANY-NAME.
DISPLAY 'The total revenue for the company is ' TOTAL-REVENUE.

STOP RUN.