01 STUDENT-RECORD
                           05 STUDENT-NAME PIC X(15)
                           05 STUDENT-ID PIC 9(5)
                           05 STUDENT-AGE PIC 99
                           05 STUDENT-GRADE PIC 9V99
                           05 STUDENT-ADDRESS.
                               10 HOUSE-NO PIC 9(4)
                               10 STREET PIC X(20)
                               10 CITY PIC X(15)
                               10 STATE PIC X(10).