IDENTIFICATION DIVISION.
PROGRAM-ID. MULTIPLY-TWO.

/* This program multiplies two numbers and displays the result. */

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 NUM1 PIC 9(3) VALUE 537.
  01 NUM2 PIC 9(3) VALUE 298.
  01 PRODUCT PIC 9(5).

PROCEDURE DIVISION.
  MULTIPLY NUM1 BY NUM2 GIVING PRODUCT.
  DISPLAY NUM1 "x" NUM2 " =" PRODUCT.
  STOP RUN.