IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL.

           SELECT OUTFILE ASSIGN TO DISK
           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD INFILE
              LABEL RECORDS ARE STANDARD
              VALUE OF FILE-ID IS "INPUTFILE.TXT".

           01 IN-REC.
               05 STUDENT-ID             PIC 9(04).
               05 STUDENT-NAME           PIC X(20).
               05 COURSE-NAME            PIC X(20).

           FD OUTFILE
              LABEL RECORDS ARE STANDARD
              VALUE OF FILE-ID IS "OUTPUTFILE.TXT".

           01 OUT-REC.
               05 STU-ID-OUTPUT         PIC 9(04).
               05 STU-NAME-OUTPUT       PIC X(20).
               05 COURSE-NAME-OUTPUT    PIC X(20).
               05 GRADE-OUTPUT          PIC 9(02).
               05 PASS-FAIL-OUTPUT      PIC X(02).

       WORKING-STORAGE SECTION.
           01 END-OF-FILE        PIC X(05) VALUE "NO ".

           01 GRADE-IN-WORDS     PIC X(10).

       PROCEDURE DIVISION.
           MAIN-PARA.
               OPEN INPUT INFILE
               OPEN OUTPUT OUTFILE
               PERFORM UNTIL END-OF-FILE = "YES "
                   READ INFILE
                       AT END MOVE "YES " TO END-OF-FILE
                   END-READ
                   COMPUTE GRADE-OUTPUT = FUNCTION NUMVAL(GRADE-IN-WORDS)
                   MOVE STUDENT-ID TO STU-ID-OUTPUT
                   MOVE STUDENT-NAME TO STU-NAME-OUTPUT
                   MOVE COURSE-NAME TO COURSE-NAME-OUTPUT
                   MOVE GRADE-OUTPUT TO GRADE-OUTPUT
                   IF GRADE-OUTPUT >= 60
                       MOVE "P" TO PASS-FAIL-OUTPUT
                   ELSE
                       MOVE "F" TO PASS-FAIL-OUTPUT
                   END-IF
                   WRITE OUT-REC
                   NEXT SENTENCE
               END-PERFORM
           END-PARA.

           CLOSE INFILE
           CLOSE OUTFILE.

           STOP RUN.