IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-ONE PIC S9(5)V99.
       01 VAR-TWO PIC S9(5)V99.
       01 VAR-THREE PIC S9(5)V99.
       01 RESULT PIC S9(5)V99.
       PROCEDURE DIVISION.
       DISPLAY "NOTE: PLEASE ENTER THREE NUMBERS TO BE ADDED:".
       ACCEPT VAR-ONE.
       ACCEPT VAR-TWO.
       ACCEPT VAR-THREE.
       COMPUTE RESULT = VAR-ONE + VAR-TWO + VAR-THREE.
       DISPLAY "THE RESULT OF ADDING" VAR-ONE "AND" VAR-TWO "AND" VAR-THREE "IS:" RESULT.
       STOP RUN.
END PROGRAM EXAMPLE.