IDENTIFICATION DIVISION.
       PROGRAM-ID. SORT-ARRAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEST-DATA.
           05 NUMBERS OCCURS 10 TIMES.
               10 NUMBER PIC 9(2) VALUE 0.
       01 SORTED-DATA.
           05 SORTED-NUMBERS OCCURS 10 TIMES.
               10 SORTED-NUMBER PIC 9(2) VALUE 0.
       PROCEDURE DIVISION.
       BEGIN.
       DISPLAY "UNSORTED NUMBERS:".
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
           DISPLAY NUMBERS(I)
       END-PERFORM.
       PERFORM SORT-ARRAY.
       DISPLAY "SORTED NUMBERS:".
       PERFORM VARYING J FROM 1 BY 1 UNTIL J > 10
           DISPLAY SORTED-NUMBERS(J)
       END-PERFORM.
       STOP RUN.
       SORT-ARRAY.
           PERFORM VARYING K FROM 1 BY 1 UNTIL K > 9
               PERFORM VARYING L FROM 1 BY 1 UNTIL L > 9 - K
                   IF NUMBERS(L) > NUMBERS(L+1)
                       MOVE NUMBERS(L) TO SORTED-NUMBERS(L+1)
                       MOVE NUMBERS(L+1) TO SORTED-NUMBERS(L)
                   END-IF
               END-PERFORM
           END-PERFORM.