IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARIABLES.
    05 WS-INPUT1 PIC 9(3).
    05 WS-INPUT2 PIC 9(3).
    05 WS-RESULT PIC 9(4).

PROCEDURE DIVISION.
    DISPLAY "Enter first number:".
    ACCEPT WS-INPUT1.
    DISPLAY "Enter second number:".
    ACCEPT WS-INPUT2.

    COMPUTE WS-RESULT = WS-INPUT1 + WS-INPUT2.

    DISPLAY "The sum of inputs is: ", WS-RESULT.
    DISPLAY "End of program.".
    
STOP RUN.