IDENTIFICATION DIVISION.        //This division is used to identify the source language being used.
PROGRAM-ID. progName.           //This is the program name that will be used to identify it in the system.
DATA DIVISION.                  //This division holds the program's data declarations.
WORKING-STORAGE SECTION.        //Holds variables and data used by the program during execution.

01 studentRecord.               //Creates a data structure called studentRecord.

    05 lastName      PIC X(30). //Declares a variable for the last name of the student, with maximum length of 30 characters.
    05 firstName     PIC X(30). //Declares a variable for the first name of the student, with maximum length of 30 characters.
    05 studentId     PIC 9(10). //Declares a variable for the student ID, with maximum length of 10 digits.
    05 dob           PIC 9(8).  //Declares a variable for the date of birth, with format DDMMYYYY.
    05 gender        PIC X.     //Declares a variable for the gender of the student, with maximum length of 1 character.

PROCEDURE DIVISION.
MAIN SECTION.

    DISPLAY "Enter student information:"
    ACCEPT studentRecord.
    
    DISPLAY "Student Record:"
    DISPLAY "Last Name: " studentRecord.lastName.
    DISPLAY "First Name: " studentRecord.firstName.
    DISPLAY "Student ID: " studentRecord.studentId.
    DISPLAY "Date of Birth: " studentRecord.dob.
    
    IF studentRecord.gender = "F"             //Checks if student is female.
        DISPLAY "Student is Female."
    ELSE IF studentRecord.gender = "M"        //Checks if student is male.
        DISPLAY "Student is Male."
    ELSE                                      //If not female or male, displays an error.
        DISPLAY "Error: Gender not specified."
END PROGRAM progName.        //Ends the program using the program name specified in the identification division.