IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE ASSIGN TO DISK "INPUT.TXT".
SELECT OUT-FILE ASSIGN TO DISK "OUTPUT.TXT".
DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 IN-RECORD.
05 IN-NAME PIC X(20).
05 IN-AGE PIC 9(3).
FD OUT-FILE.
01 OUT-RECORD.
05 OUT-NAME PIC X(20).
05 OUT-AGE PIC 9(3).
WORKING-STORAGE SECTION.
01 NUM-RECORDS PIC 9(3).
PROCEDURE DIVISION.
MAIN-PROCESS.
OPEN INPUT IN-FILE.
OPEN OUTPUT OUT-FILE.
ACCEPT NUM-RECORDS FROM CONSOLE.
PERFORM READ-RECORDS UNTIL END-OF-FILE.
CLOSE IN-FILE.
CLOSE OUT-FILE.
STOP RUN.
READ-RECORDS.
READ IN-FILE INTO IN-RECORD.
IF IN-AGE >= 18
    MOVE IN-NAME TO OUT-NAME.
    MOVE IN-AGE TO OUT-AGE.
    WRITE OUT-RECORD.
END-IF.