IDENTIFICATION DIVISION.
       PROGRAM-ID. FACTORIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FACTORIAL-NUMBER PIC 9(3) VALUE 10.
       01 TOTAL-NUMBER PIC 9(6) VALUE 1.
       01 COUNTER PIC 9(3) VALUE 1.
       PROCEDURE DIVISION.
       PERFORM MULTIPLY-FACTORIAL UNTIL COUNTER > FACTORIAL-NUMBER.
       DISPLAY TOTAL-NUMBER.
       STOP RUN.
       MULTIPLY-FACTORIAL.
           MULTIPLY TOTAL-NUMBER BY COUNTER GIVING TOTAL-NUMBER.
          ADD 1 TO COUNTER.
          EXIT.