***REGISTRATION FORM PROGRAM***

       IDENTIFICATION DIVISION.
       PROGRAM-ID. REGFORM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO 'STUDENT.DAT'
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE.
       01 STUDENT-RECORD.
           05 STUDENT-ID            PIC X(5).
           05 STUDENT-NAME          PIC X(20).
           05 STUDENT-AGE           PIC 99.
           05 STUDENT-GENDER        PIC X.
           05 STUDENT-COURSE        PIC X(15).

       WORKING-STORAGE SECTION.
       01 STUDENT-ID-NUM           PIC 9(5).
       01 STUDENT-EXIST            PIC X.
       01 STUDENT-COUNT            PIC 9(2).
       01 STUDENT-FIELD-COUNT      PIC 9(2).
       01 UNITS-TAKEN              PIC 999.

       PROCEDURE DIVISION.
       MAIN-PROCESS.

         * DISPLAY WELCOME MESSAGE AND INSTRUCTIONS
           DISPLAY 'WELCOME TO THE REGISTRATION FORM PROGRAM'
           DISPLAY 'PLEASE ENTER STUDENT INFORMATION AS REQUESTED'
           DISPLAY 'PRESS ENTER TO CONTINUE'.

         * GET STUDENT ID AND CHECK IF IT ALREADY EXISTS IN FILE
           DISPLAY 'STUDENT ID: '
           ACCEPT STUDENT-ID
           MOVE STUDENT-ID TO STUDENT-ID-NUM
           MOVE 'N' TO EXIST
           OPEN INPUT STUDENT-FILE
           PERFORM CHECK-STUDENT-EXIST UNTIL STUDENT-EXIST = 'Y'
           CLOSE STUDENT-FILE.

         * GET STUDENT NAME
           DISPLAY 'STUDENT NAME: '
           ACCEPT STUDENT-NAME.

         * GET STUDENT AGE
           DISPLAY 'STUDENT AGE: '
           ACCEPT STUDENT-AGE.

         * GET STUDENT GENDER AND VALIDATE INPUT
           DISPLAY 'STUDENT GENDER (M/F): '
           ACCEPT STUDENT-GENDER
           PERFORM VALIDATE-STUDENT-GENDER UNTIL STUDENT-GENDER = 'M' OR 'F'.

         * GET STUDENT COURSE
           DISPLAY 'STUDENT COURSE: '
           ACCEPT STUDENT-COURSE.

         * GET NUMBER OF UNITS TAKEN AND VALIDATE INPUT
           DISPLAY 'NUMBER OF UNITS TAKEN: '
           ACCEPT UNITS-TAKEN
           PERFORM VALIDATE-UNITS-TAKEN UNTIL UNITS-TAKEN > 0.

         * WRITE STUDENT RECORD TO FILE
           OPEN EXTEND STUDENT-FILE
           WRITE STUDENT-RECORD
           CLOSE STUDENT-FILE.

         * DISPLAY SUCCESS MESSAGE AND STUDENT INFORMATION
           DISPLAY 'REGISTRATION SUCCESSFUL!'
           DISPLAY 'STUDENT ID: ' STUDENT-ID
           DISPLAY 'STUDENT NAME: ' STUDENT-NAME
           DISPLAY 'STUDENT AGE: ' STUDENT-AGE
           DISPLAY 'STUDENT GENDER: ' STUDENT-GENDER
           DISPLAY 'STUDENT COURSE: ' STUDENT-COURSE
           DISPLAY 'UNITS TAKEN: ' UNITS-TAKEN
           STOP RUN.

       CHECK-STUDENT-EXIST.
           READ STUDENT-FILE
           AT END MOVE 'Y' TO STUDENT-EXIST
           NOT AT END IF STUDENT-ID-NUM = STUDENT-ID
             MOVE 'Y' TO STUDENT-EXIST
           END-IF.

       VALIDATE-STUDENT-GENDER.
           IF STUDENT-GENDER NOT = 'M' AND STUDENT-GENDER NOT = 'F'
             DISPLAY 'INVALID INPUT! PLEASE ENTER M FOR MALE AND F FOR FEMALE'
             ACCEPT STUDENT-GENDER.
           END-IF.

       VALIDATE-UNITS-TAKEN.
           IF UNITS-TAKEN > 20
             DISPLAY 'INVALID INPUT! PLEASE ENTER NUMBER OF UNITS TAKEN BELOW 20'
             ACCEPT UNITS-TAKEN.
           END-IF.

       END PROGRAM REGFORM.