IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       AUTHOR. JOHN SMITH.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIB-ARRAY.
          05 FIB-INDEX PICTURE 9(3) VALUE 3.
          05 FIB-VALUES OCCURS 50 TIMES INDEXED BY FIB-INDEX.
             10 FIB-NUMBER PICTURE 9(10) VALUE 0.
             10 FIB-LAST-NUMBER PICTURE 9(10) VALUE 1.
             10 FIB-PREVIOUS-NUMBER PICTURE 9(10) VALUE 1.

       PROCEDURE DIVISION.
       COMPUTE-FIBONACCI.
          PERFORM VARYING FIB-INDEX FROM 1 BY 1
             UNTIL FIB-INDEX > 50
             COMPUTE FIB-NUMBER = FIB-LAST-NUMBER + FIB-PREVIOUS-NUMBER
             MOVE FIB-NUMBER TO FIB-VALUES (FIB-INDEX)
             MOVE FIB-PREVIOUS-NUMBER TO FIB-LAST-NUMBER
             MOVE FIB-NUMBER TO FIB-PREVIOUS-NUMBER
          END-PERFORM.

       DISPLAY 'Fibonacci Sequence Generated:'.
       PERFORM VARYING FIB-INDEX FROM 1 BY 1
          UNTIL FIB-INDEX > 50
          DISPLAY FIB-VALUES (FIB-INDEX)
       END-PERFORM.

       DISPLAY 'Fibonacci sum of 50 numbers:'.
       COMPUTE FIB-SUM = FUNCTION SUM (FIB-VALUES).
       DISPLAY FIB-SUM.

       STOP RUN.