IDENTIFICATION DIVISION.
      PROGRAM-ID. MYPROGRAM.
      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      SOURCE-COMPUTER. IBM-PC.
      OBJECT-COMPUTER. IBM-PC.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
            SELECT STUDENTS-FILE
                ASSIGN TO "students.dat"
                ORGANIZATION IS LINE SEQUENTIAL.
      DATA DIVISION.
      FILE SECTION.
      FD STUDENTS-FILE.
      01 STUDENT-RECORD.
         05 STUDENT-ID PIC X(10).
         05 STUDENT-NAME PIC X(30).
         05 STUDENT-AGE PIC 99.
      WORKING-STORAGE SECTION.
          01 STUDENT-TOTAL PIC 9(3) COMP.
          01 STUDENT-AVERAGE PIC 9(3)V99.
      PROCEDURE DIVISION.
      OPENING-PARAGRAPH.
          DISPLAY "INPUT STUDENT DETAILS:".
          OPEN INPUT STUDENTS-FILE.
      PROCESS-PARAGRAPH.
          READ STUDENTS-FILE
              AT END MOVE "NO" TO EOF-SWITCH
             NOT AT END
                  ADD 1 TO STUDENT-TOTAL
                  ADD STUDENT-AGE TO STUDENT-AVERAGE
          END-READ.
      CLOSING-PARAGRAPH.
          CLOSE STUDENTS-FILE.
          COMPUTE STUDENT-AVERAGE = STUDENT-AVERAGE / STUDENT-TOTAL.
          DISPLAY "TOTAL STUDENTS: ", STUDENT-TOTAL.
          DISPLAY "AVERAGE AGE: ", STUDENT-AVERAGE.