IDENTIFICATION DIVISION.                         * starting point of program
PROGRAM-ID. MYPROGRAM.                            * name of program
DATA DIVISION.                                    * data section
WORKING-STORAGE SECTION.                          * declaration of variables and constants
01 INP1 PIC 9(3).                                 * 3-digit input number
01 INP2 PIC 9(3).                                 * 3-digit input number
01 RESULT PIC 9(4).                               * 4-digit result
01 TEMP1 PIC 9(3).                                * temporary variable 1
01 TEMP2 PIC 9(3).                                * temporary variable 2
PROCEDURE DIVISION.                               * execution section
MAIN-LOGIC.                                       * main logic of the program
ACCEPT INP1.                                      * accept first input from user
ACCEPT INP2.                                      * accept second input from user
MOVE INP1 TO TEMP1.                               * move input to temporary variable 1
MOVE INP2 TO TEMP2.                               * move input to temporary variable 2
MULTIPLY TEMP1 BY 100.                            * multiply temporary variable 1 by 100 to shift decimal point
ADD TEMP2 TO TEMP1.                               * add temporary variable 2 to temporary variable 1
MOVE TEMP1 TO RESULT.                             * move result to output variable
DISPLAY "The result is " RESULT                    * display the result
STOP.                                              * end program execution