IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO "example.txt" ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
    FD INPUT-FILE.
    01 RECORD.
        05 FIELD-1 PIC X(10).
        05 FIELD-2 PIC 9(5).
        05 FIELD-3 PIC 9(3).
        05 FIELD-4 PIC X(20).

WORKING-STORAGE SECTION.
01 TOTAL-AMOUNT PIC 9(8)V99.
01 MAX-AMOUNT PIC 9(8)V99 VALUE 0.
01 MIN-AMOUNT PIC 9(8)V99 VALUE 99999999.99.
01 RECORD-COUNT PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    OPEN INPUT INPUT-FILE
    PERFORM UNTIL RECORD-COUNT = 100
        READ INPUT-FILE AT END
            DISPLAY "End of file reached"
            EXIT PERFORM
        END-READ
        COMPUTE TOTAL-AMOUNT = FIELD-2 / FIELD-3
        IF TOTAL-AMOUNT > MAX-AMOUNT
            SET MAX-AMOUNT TO TOTAL-AMOUNT
        END-IF
        IF TOTAL-AMOUNT < MIN-AMOUNT
            SET MIN-AMOUNT TO TOTAL-AMOUNT
        END-IF
        ADD 1 TO RECORD-COUNT
    END-PERFORM
    CLOSE INPUT-FILE
    DISPLAY "Maximum amount is " MAX-AMOUNT
    DISPLAY "Minimum amount is " MIN-AMOUNT
    DISPLAY RECORD-COUNT "records processed".

STOP RUN.