IDENTIFICATION DIVISION.                    *This is the Identification Division of a COBOL program
       PROGRAM-ID. EXAMPLEPROGRAM.                 *The program name is EXAMPLEPROGRAM
       DATA DIVISION.                              *This is the Data Division of the program
       WORKING-STORAGE SECTION.                    *This section contains variables to be used throughout the program
       01 EMPLOYEE-RECORD.                         *This is a group item called EMPLOYEE-RECORD
          05 EMPLOYEE-NAME PIC X(20).              *This is a field for the employee's name, 20 characters long
          05 EMPLOYEE-ID PIC 9(6).                 *This is a field for the employee's ID number, 6 digits long
          05 EMPLOYEE-SALARY PIC 9(8)V99.          *This is a field for the employee's salary, 8 digits with 2 decimal places
       PROCEDURE DIVISION.                         *This is the Procedure Division of the program
       MAIN-PROCEDURE.                             *This is the main procedure
           DISPLAY "Welcome to the Employee Database".        *Outputs "Welcome to the Employee Database" to the screen
           ACCEPT EMPLOYEE-NAME                      *Prompts the user to enter the employee's name
           ACCEPT EMPLOYEE-ID                        *Prompts the user to enter the employee's ID number
           ACCEPT EMPLOYEE-SALARY                    *Prompts the user to enter the employee's salary
           IF EMPLOYEE-SALARY > 50000                *Checks if the employee's salary is greater than 50000
               DISPLAY "This employee is a high earner".     *Outputs "This employee is a high earner" to the screen
           ELSE                                      *If not, the following code is executed
               DISPLAY "This employee is an average earner". *Outputs "This employee is an average earner" to the screen
           END-IF.                                   *Ends the IF statement
       END PROGRAM EXAMPLEPROGRAM.                    *Ends the program