IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-PROGRAM.

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INPUT-RECORD.
           05 IN-ID PIC X(5).
           05 IN-NAME PIC X(20).
           05 IN-SAL PIC 9(5).
       RECORDING MODE IS F.

       WORKING-STORAGE SECTION.
       01 OUT-RECORD.
           05 OUT-ID PIC X(5).
           05 OUT-NAME PIC X(20).
           05 OUT-SAL PIC 9(5).
       01 TOTAL-SAL PIC 9(5)V99 VALUE 0.

       PROCEDURE DIVISION.
       MAIN-EXEC.

       OPEN INPUT INFILE
       PERFORM UNTIL EOF-FLAG
           READ INFILE
            AT END
               MOVE 'Y' TO EOF-FLAG
            NOT AT END
               ADD IN-SAL TO TOTAL-SAL
               MOVE IN-ID TO OUT-ID
               MOVE IN-NAME TO OUT-NAME
               MOVE IN-SAL TO OUT-SAL
               WRITE OUT-RECORD
       END-PERFORM.

       CLOSE INFILE.

       DISPLAY "TOTAL SALARY: " TOTAL-SAL.

       STOP RUN.