IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALARY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE
               ASSIGN TO 'EMPLOYEE.DAT'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE
           LABEL RECORDS ARE STANDARD.
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-ID       PIC X(6).
           05 EMPLOYEE-NAME     PIC X(20).
           05 EMP-ADDRESS.
               10 ADDRESS-LINE1  PIC X(20).
               10 ADDRESS-LINE2  PIC X(20).
           05 EMP-DEPARTMENT   PIC X(10).
           05 EMP-SALARY       PIC 9(5)V99.
           05 EMP-STATUS       PIC X.
       WORKING-STORAGE SECTION.
       01 TOTAL-SALARY           PIC 9(6)V99
           VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT EMPLOYEE-FILE.
           PERFORM READ-PARA UNTIL EMP-STATUS = 'Z'.
           PERFORM CALCULATE-PARA.
           CLOSE EMPLOYEE-FILE.
           DISPLAY 'TOTAL SALARY:' TOTAL-SALARY.
           STOP RUN.
       READ-PARA.
           READ EMPLOYEE-FILE
               AT END MOVE 'Z' TO EMP-STATUS.
           ADD EMP-SALARY TO TOTAL-SALARY.
       CALCULATE-PARA.
           MULTIPLY TOTAL-SALARY BY 12
               GIVING TOTAL-SALARY.
           MULTIPLY TOTAL-SALARY BY 0.05
               GIVING TOTAL-SALARY.