identification division.
      program-id. complex-calculation.

      environment division.
      input-output section.
      file-control.
      select data-file assign to "datafile.dat"
             organization is sequential.

      data division.
      file section.
      fd data-file.
      01 data-record.
         05 num1 pic 9(3).
         05 filler pic x.
         05 num2 pic 9(3).
         05 filler pic x.
         05 result pic 9(4).

      working-storage section.
      01 counter pic 9(3) value 0.
      01 temp-num pic 9(4).

      procedure division.
      begin.
          open input data-file
          perform until counter = 10
             read data-file
             add num1 to num2
             move result to temp-num
             perform check-result
             add 1 to counter
          end-perform
          close data-file
          stop run.

      check-result.
          if temp-num > 999
              move 999 to result
          else if temp-num < -999
              move -999 to result
          end-if
          display "The result is: " result.