* Program to calculate the average of numbers
       IDENTIFICATION DIVISION.
       PROGRAM-ID. AVG-CALC.
       AUTHOR. Your Name.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(2).
       01 NUM2 PIC 9(2).
       01 NUM3 PIC 9(2).
       01 AVG PIC 9(4).

       PROCEDURE DIVISION.
       MAIN:
           DISPLAY "Please enter three numbers:"
           ACCEPT NUM1, NUM2, NUM3
           COMPUTE AVG = (NUM1 + NUM2 + NUM3) / 3
           DISPLAY "The average of" NUM1 "and" NUM2 "and" NUM3 "is" AVG
           STOP RUN.
       
       END PROGRAM AVG-CALC.