IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(20) VALUE 'WORLD'.
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY 'HELLO ' WS-NAME '!'.
           STOP RUN.
       END PROGRAM HELLO-WORLD.