CHAPERON SECTION.                             * Section header
       EXEC SQL                                       * Execute SQL statement
            INCLUDE SQLCA                            * Include SQL communication area

       PERFORM UNTIL WS-END-OF-DATA = 'Y'             * Do until end of data flag is set to 'Y'
       	 EXEC SQL								   * Execute SQL statement
		SELECT *								   * Select all columns from table
		    INTO :WS-STUDENT-INFO					  * Move data to working storage variable
		FROM STUDENT-TABLE-NAME                           * From table name
		WHERE STUDENT-ID = :WS-STUDENT-ID				  * Where student ID matches
		END-EXEC.                                   * End SQL execution

        MOVE WS-STUDENT-INFO(1:6) TO WS-STUDENT-NAME    * Move student name from working storage
        MOVE WS-STUDENT-INFO(7:3) TO WS-STUDENT-AGE     * Move student age from working storage
        MOVE WS-STUDENT-INFO(10:1) TO WS-STUDENT-SEX     * Move student sex from working storage

        IF WS-STUDENT-AGE > 18                         * Compare student age
            DISPLAY 'Student Name: ' WS-STUDENT-NAME    * Display student name
            DISPLAY 'Student Age: ' WS-STUDENT-AGE      * Display student age
            DISPLAY 'Student Sex: ' WS-STUDENT-SEX      * Display student sex
        ELSE
            DISPLAY 'Student is under 18 years old'      * Inform that student is underage
        END-IF.
       
       END-EXEC.                                       * End SQL execution
       END-PERFORM.                                    * End perform loop