IDENTIFICATION DIVISION.
       PROGRAM-ID. CNTRPROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  CNTR-TOTAL      PIC 9(4).
       01  CNTR-ARRAY.
           05  CNTR-ELEM       PIC 9(2) OCCURS 10 TIMES.
           05  CNTR-CNT        PIC 9(4).            
       PROCEDURE DIVISION.
       PERFORM VARYING CNTR1 FROM 1 BY 1
          UNTIL CNTR1 > 10
          PERFORM VARYING CNTR2 FROM 1 BY 1
       UNTIL CNTR2 > 10
          ADD CNTR1 TO CNTR-CNT(CNTR2)
       END-PERFORM.
       PERFORM PRINT-COUNTERS.
       STOP RUN.
       PRINT-COUNTERS.
       DISPLAY 'Printing and summing counters:'. 
       SET CNTR-TOTAL TO ZERO.
       PERFORM VARYING CNTR3 FROM 1 BY 1
          UNTIL CNTR3 > 10
          DISPLAY 'Counter element ' CNTR3 ' = ' CNTR-CNT(CNTR3)
          ADD CNTR-CNT(CNTR3) TO CNTR-TOTAL
          END-PERFORM.
       DISPLAY 'Total counter sum: ' CNTR-TOTAL.