01 MONTHLY-WAGE-GROUP.
      05 COMPANY-A-PAYROLL-DATA.
          10 COMP-A-EMPLOYEE-NAME        PIC X(15).
          10 COMP-A-EMPLOYEE-ID          PIC 999.
          10 COMP-A-HOURLY-RATE          PIC 9(4)V99.
          10 COMP-A-HOURS-WORKED         PIC 9(3).
          10 COMP-A-DAYS-OFF             PIC 9(2).
      05 COMPANY-B-PAYROLL-DATA.
          10 COMP-B-EMPLOYEE-NAME        PIC X(15).
          10 COMP-B-EMPLOYEE-ID          PIC 999.
          10 COMP-B-HOURLY-RATE          PIC 9(4)V99.
          10 COMP-B-HOURS-WORKED         PIC 9(3).
          10 COMP-B-DAYS-OFF             PIC 9(2).
  01 MONTHLY-WAGE-REPORT.
      05 MONTHLY-WAGES                  PIC 9(8)V99.
      05 COMPANY-A-PAYROLL-TOTAL        PIC 9(8)V99.
      05 COMPANY-B-PAYROLL-TOTAL        PIC 9(8)V99.
  01 COMPANY-A-PAYROLL-TOTAL-TABLE.
      05 COMP-A-TOTAL-TABLE OCCURS 0 TO 250 TIMES
          DEPENDING ON COMPANY-A-PAYROLL-TOTAL.
          10 COMPANY-A-INDEX            PIC 9(3).
          10 COMPANY-A-TOTAL            PIC 9(8)V99.
  01 COMPANY-B-PAYROLL-TOTAL-TABLE.
      05 COMP-B-TOTAL-TABLE OCCURS 0 TO 250 TIMES
          DEPENDING ON COMPANY-B-PAYROLL-TOTAL.
          10 COMPANY-B-INDEX            PIC 9(3).
          10 COMPANY-B-TOTAL            PIC 9(8)V99.
  01 TOTAL-WAGE-TABLE.
      05 TOTAL-WAGE-TABLE OCCURS 0 TO 500 TIMES
          DEPENDING ON COMPANY-A-PAYROLL-TOTAL.
      10 WEEKLY-WAGE                   PIC 9(8)V99.
      10 MONTHLY-WAGE                  PIC 9(8)V99.
      10 TOTAL-WAGES                   PIC 9(8)V99.
  01 EMPLOYEE-INDEX                   PIC 9(3)    INITIAL 1.
  01 COMPANY-A-INDEX                  PIC 9(3)    INITIAL 1.
  01 COMPANY-B-INDEX                  PIC 9(3)    INITIAL 1.
  01 TOTAL-WAGE-INDEX                 PIC 9(3)    INITIAL 1.

      PERFORM UNTIL EMPLOYEE-INDEX > 250
          IF COMPANY-A-INDEX = 1
              MOVE COMPANY-A-PAYROLL-DATA(EMPLOYEE-INDEX) TO COMPANY-A-PAYROLL-TOTAL
              PERFORM VARYING COMPANY-A-INDEX FROM 1 BY 1
                  UNTIL COMPANY-A-INDEX > 250
                      IF COMPANY-A-TOTAL-TABLE(COMPANY-A-INDEX) = COMPANY-A-PAYROLL-TOTAL
                          ADD COMPANY-A-HOURS-WORKED OF COMPANY-A-PAYROLL-DATA(EMPLOYEE-INDEX)
                              TO TOTAL-WAGE-TABLE(TOTAL-WAGE-INDEX).
                      ADD 1 TO COMPANY-A-INDEX.
             
          ELSE IF COMPANY-B-INDEX = 1
              MOVE COMPANY-B-PAYROLL-DATA(EMPLOYEE-INDEX) TO COMPANY-B-PAYROLL-TOTAL
              PERFORM VARYING COMPANY-B-INDEX FROM 1 BY 1
                  UNTIL COMPANY-B-INDEX > 250
                      IF COMPANY-B-TOTAL-TABLE(COMPANY-B-INDEX) = COMPANY-B-PAYROLL-TOTAL
                          ADD COMPANY-B-HOURS-WORKED OF COMPANY-B-PAYROLL-DATA(EMPLOYEE-INDEX)
                              TO TOTAL-WAGE-TABLE(TOTAL-WAGE-INDEX).
                      ADD 1 TO COMPANY-B-INDEX.
          
          ADD 1 TO EMPLOYEE-INDEX.
      END-PERFORM.

      PERFORM VARYING TOTAL-WAGE-INDEX FROM 1 BY 1
          UNTIL TOTAL-WAGE-INDEX > EMPLOYEE-INDEX
          COMPUTE WEEKLY-WAGE = TOTAL-WAGE-TABLE(TOTAL-WAGE-INDEX)/4
          COMPUTE MONTHLY-WAGE = TOTAL-WAGE-TABLE(TOTAL-WAGE-INDEX)
          COMPUTE TOTAL-WAGES = MONTHLY-WAGE + WEEKLY-WAGE
          MOVE TOTAL-WAGES TO MONTHLY-WAGES(TOTAL-WAGE-INDEX).
      END-PERFORM.