IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-1 PIC 9(5) VALUE 32000.
01 NUM-2 PIC 9(5) VALUE 40000.
01 RESULT PIC 9(5).
PROCEDURE DIVISION.
MULTIPLY NUM-1 BY NUM-2 GIVING RESULT.
STOP RUN.