000100 IDENTIFICATION DIVISION.                       // start of IDENTIFICATION DIVISION
000200 PROGRAM-ID. MAINPROGRAM.                       // declaration of PROGRAM-ID
000300 AUTHOR. Your Name.                             // author information
000400 DATE-WRITTEN. 01/01/2020.                      // date of code creation
000600 ENVIRONMENT DIVISION.                          // start of ENVIRONMENT DIVISION
000700 CONFIGURATION SECTION.                         // declaration of CONFIGURATION SECTION
000800 SOURCE-COMPUTER. IBM-MAINFRAME.                // type of computer platform
001000 OBJECT-COMPUTER. IBM-MAINFRAME.                // type of compiled computer platform
010100 DATA DIVISION.                                 // start of DATA DIVISION
010200 FILE SECTION.                                  // declaration of FILE SECTION
010500 FD CUSTOMER-FILE.                              // file description for CUSTOMER-FILE
010600 01 CUSTOMER-RECORD.                            // record description for CUSTOMER-RECORD
010700 05 CUST-NAME PIC X(20).                        // field description for customer name
010800 05 CUST-ADDRESS PIC X(30).                     // field description for customer address
010900 WORKING-STORAGE SECTION.                       // start of WORKING-STORAGE SECTION
011000 01 WS-COUNTER PIC 9(3) VALUE 0.                // variable for counting customer records
011100 01 WS-FLAG PIC X VALUE 'N'.                     // variable for flagging records
012200 PROCEDURE DIVISION.                            // start of PROCEDURE DIVISION
012300 DISPLAY 'CUSTOMER LIST'.                       // display heading for customer list
012400 OPEN INPUT CUSTOMER-FILE.                      // open CUSTOMER-FILE for input
012500 READ CUSTOMER-FILE INTO CUSTOMER-RECORD.       // read first record in CUSTOMER-FILE
012600 PERFORM UNTIL WS-FLAG = 'Y'.                    // loop until flag is set to 'Y'
013100   ADD 1 TO WS-COUNTER                          // increment counter
013200   IF CUST-NAME = 'JOHN SMITH'                  // check if customer is JOHN SMITH
013300      DISPLAY 'Found John Smith at record ' WS-COUNTER.  // display message
013400      MOVE 'Y' TO WS-FLAG.                      // set flag to 'Y'
013500   END-IF.
013600   READ CUSTOMER-FILE INTO CUSTOMER-RECORD.     // read next record in CUSTOMER-FILE
013700 END-PERFORM.                                    // end of loop
013800 CLOSE CUSTOMER-FILE.                            // close CUSTOMER-FILE
014000 STOP RUN.                                       // stop execution