IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 WS-MESSAGE PIC X(20).

PROCEDURE DIVISION.
START-PGM.
    MOVE 'Hello, World!' TO WS-MESSAGE.
    DISPLAY WS-MESSAGE.
    STOP RUN.
END-PGM.