IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
       AUTHOR. YOUR NAME.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT INFILE ASSIGN TO 'INPUT.TXT'
             ORGANIZATION IS LINE SEQUENTIAL.
          SELECT OUTFILE ASSIGN TO 'OUTPUT.TXT'
             ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INPUT-RECORD.
          05 INPUT-NAME       PIC X(20).
          05 INPUT-AGE        PIC 99.
          05 INPUT-CITY       PIC X(15).

       FD OUTFILE.
       01 OUTPUT-RECORD.
          05 OUTPUT-NAME      PIC X(20).
          05 OUTPUT-AGE       PIC 99.
          05 OUTPUT-CITY      PIC X(15).

       WORKING-STORAGE SECTION.
       01 COUNTER             PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INFILE.
           OPEN OUTFILE.
           READ INFILE
               AT END MOVE 'Y' TO END-OF-FILE
               NOT AT END PERFORM 200-PROCESS-RECORD
           END-READ.
           CLOSE INFILE.
           CLOSE OUTFILE.
           STOP RUN.

       200-PROCESS-RECORD.
           PERFORM UNTIL END-OF-FILE = 'Y'
               ADD 1 TO COUNTER.
               MOVE INPUT-NAME TO OUTPUT-NAME.
               MOVE INPUT-AGE TO OUTPUT-AGE.
               MOVE INPUT-CITY TO OUTPUT-CITY.
               WRITE OUTPUT-RECORD.
               READ INFILE
                   AT END MOVE 'Y' TO END-OF-FILE
                   NOT AT END PERFORM 200-PROCESS-RECORD
               END-READ.
           END-PERFORM.