IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-VARIABLE PIC 9(3).

PROCEDURE DIVISION.
DISPLAY 'Enter a number: ' upon sysout.
ACCEPT MY-VARIABLE FROM CONSOLE.
DISPLAY 'The number you entered was: ' upon sysout.
DISPLAY MY-VARIABLE UPON CONSOLE.
STOP RUN.