IDENTIFICATION DIVISION.
* Program Name: Calculator
AUTHOR. Bryant Hayes.
DATE-WRITTEN. 10/02/2021.
DATE-COMPILED. 10/03/2021.

DATA DIVISION.
* Declare variables for calculation
WORKING-STORAGE SECTION.
* Input variables
01 NUM1 PIC 99V9.
01 NUM2 PIC 99V9.
* Output variables
01 SUM PIC S9(3)V9.
01 DIFF PIC S9(3)V9.
01 PROD PIC S9(3)V9.
01 QUOT PIC S9(3)V9.

PROCEDURE DIVISION.
* Start the program
BEGIN.
* Prompt user for first number
DISPLAY "Enter first number: ".
ACCEPT NUM1.
* Prompt user for second number
DISPLAY "Enter second number: ".
ACCEPT NUM2.
* Calculate sum
COMPUTE SUM = NUM1 + NUM2.
DISPLAY "Sum = " SUM.
* Calculate difference
COMPUTE DIFF = NUM1 - NUM2.
DISPLAY "Difference = " DIFF.
* Calculate product
COMPUTE PROD = NUM1 * NUM2.
DISPLAY "Product = " PROD.
* Check for division by zero
IF NUM2 = 0 THEN
    DISPLAY "Cannot divide by zero."
ELSE
* Calculate quotient
    COMPUTE QUOT = NUM1 / NUM2.
    DISPLAY "Quotient = " QUOT.
END-IF.
STOP RUN.