Identification Division.                                  // This division identifies the program
Program-Id. myProgram.                                     // The name of the program

Data Division.                                             // This division declares the data used in the program
Working-Storage Section.                                   // The Working-Storage section declares variables used for calculations
01 myNumber PIC 9(5) VALUE 0.                               // Declaring variable 'myNumber' as a 5-digit numeric field with initial value of 0
01 myString PIC X(20).                                      // Declaring variable 'myString' as a 20-character alphanumeric field
01 myFlag PIC X VALUE 'N'.                                  // Declaring variable 'myFlag' as single character with initial value of 'N'

Procedure Division.                                         // This division contains the main logic of the program
    Main-Logic.                                             // User-defined paragraph for main logic
        Display 'Enter a number: '.                         // Display prompt for user to enter a number
        Accept myNumber.                                    // Accept input from user and store in 'myNumber' variable
        If myNumber >= 10000                                // If 'myNumber' is greater than or equal to 10000
            Set myFlag to 'Y'.                              // Set 'myFlag' variable to 'Y' to indicate condition is met
        End-If.
        If myFlag = 'Y'                                     // If 'myFlag' is equal to 'Y'
            Move 'Number is greater than or equal to 10000'  // Move string to 'myString' variable
        Else                                                 // Otherwise
            Move 'Number is less than 10000'                 // Move string to 'myString' variable
        End-If.
        Display myString.                                   // Display the final result based on the condition
    End Main-Logic.

    Display 'Program end'.                                  // Display message indicating end of program
    Stop.                                                   // Stop the execution of the program
End Program.                                                // End of program