IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALARY.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 INPUT-RECORD.
        05 EMPLOYEE-NAME PIC X(30).
        05 EMPLOYEE-ID PIC 9(5).
        05 HOURLY-RATE PIC 99V99.
        05 HOURS-WORKED PIC 9(4).
    01 OUTPUT-RECORD.
        05 EMPLOYEE-NAME PIC X(30).
        05 EMPLOYEE-ID PIC 9(5).
        05 GROSS-PAY PIC 999V99.
        05 TAX-RATE PIC 99V99.
        05 NET-PAY PIC 999V99.
    01 TAX-RATE-DETAILS.
        05 TAX-RATES OCCURS 5 TIMES INDEXED BY I.
            10 MIN-SALARY PIC 999V99 VALUE 0.
            10 MAX-SALARY PIC 999V99 VALUE 0.
            10 TAX-RATE PIC 99V99 VALUE 0.
PROCEDURE DIVISION.
    MOVE 0 TO GROSS-PAY      
    MOVE 0 TO TAX-RATE
    MOVE 0 TO NET-PAY
    INITIATE-TAX-RATES
    PERFORM CALCULATE-GROSS-PAY 
    PERFORM CALCULATE-TAX 
    PERFORM DISPLAY-SALARY 
STOP RUN.
INITIATE-TAX-RATES.
    MOVE 500 TO MAX-SALARY (1)
    MOVE 0.05 TO TAX-RATE (1)
    MOVE 1000 TO MAX-SALARY (2)
    MOVE 0.1 TO TAX-RATE (2)
    MOVE 1500 TO MAX-SALARY (3)
    MOVE 0.15 TO TAX-RATE (3)
    MOVE 2000 TO MAX-SALARY (4)
    MOVE 0.2 TO TAX-RATE (4)
    MOVE 0.25 TO TAX-RATE (5).
CALCULATE-GROSS-PAY.
    MULTIPLY HOURLY-RATE BY HOURS-WORKED
    GIVING GROSS-PAY.
CALCULATE-TAX.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        IF GROSS-PAY > = MIN-SALARY (I) AND
        GROSS-PAY <= MAX-SALARY (I)
        THEN
            MOVE TAX-RATE (I) TO TAX-RATE
            EXIT PERFORM
    END-PERFORM.
    MULTIPLY GROSS-PAY BY TAX-RATE
    GIVING TAX-RATE.
    SUBTRACT TAX-RATE FROM GROSS-PAY
    GIVING NET-PAY.
DISPLAY-SALARY.
    DISPLAY "Employee Name:" EMPLOYEE-NAME
    DISPLAY "Employee ID:" EMPLOYEE-ID
    DISPLAY "Gross Pay:" GROSS-PAY
    DISPLAY "Tax Rate:" TAX-RATE
    DISPLAY "Net Pay:" NET-PAY.