IDENTIFICATION DIVISION.
       PROGRAM-ID. Welcome.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 msg PIC X(40) VALUE "Welcome to my COBOL program!".
       PROCEDURE DIVISION.
           DISPLAY msg.
       STOP RUN.