IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEX-PROGRAM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-DATA.
          05 NUM1 PIC 9(5)V9(2).
          05 NUM2 PIC 9(5)V9(2).
          05 OPERAND PIC X(1).
       01 OUTPUT-DATA.
          05 RESULT PIC S9(5)V9(2).

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           PERFORM READ-DATA.
           PERFORM CALCULATE.
           PERFORM DISPLAY-RESULT.
           STOP RUN.

       READ-DATA.
           DISPLAY "ENTER NUM1: ".
           ACCEPT NUM1.
           DISPLAY "ENTER NUM2: ".
           ACCEPT NUM2.
           DISPLAY "ENTER OPERAND (+,-,*,/): ".
           ACCEPT OPERAND.

       CALCULATE.
           IF OPERAND = "+" THEN
               COMPUTE RESULT = NUM1 + NUM2 
           ELSE IF OPERAND = "-" THEN
               COMPUTE RESULT = NUM1 - NUM2
           ELSE IF OPERAND = "*" THEN
               COMPUTE RESULT = NUM1 * NUM2
           ELSE IF OPERAND = "/" THEN
               DIVIDE NUM1 BY NUM2 GIVING RESULT
               ON SIZE ERROR
                   DISPLAY "ERROR: DIVISION BY ZERO"
                   MOVE 0 TO RESULT
               END-DIVIDE.

       DISPLAY-RESULT.
           DISPLAY "RESULT = " RESULT.