IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-FILE-NAME PIC X(20) VALUE 'INPUT.TXT'.
01 OUTPUT-FILE-NAME PIC X(20) VALUE 'OUTPUT.TXT'.
01 INPUT-RECORD.
    05 INPUT-NUMBER PIC 9(5).
    05 INPUT-NAME PIC X(20).

01 OUTPUT-RECORD.
    05 OUTPUT-NUMBER PIC 9(5).
    05 OUTPUT-NAME PIC X(20).

01 TOTAL PIC 9(8).
01 COUNTER PIC 9(5).

01 ERROR-MESSAGE PIC X(50) VALUE 'ERROR: Invalid input record, please check and try again.'.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.

OPEN INPUT INPUT-FILE-NAME.
OPEN OUTPUT OUTPUT-FILE-NAME.

READ INPUT-FILE INTO INPUT-RECORD.
PERFORM UNTIL INPUT-RECORD = 'EOF' OR INPUT-RECORD = 'end of file'
    IF INPUT-NUMBER NOT NUMERIC THEN
        DISPLAY ERROR-MESSAGE
    ELSE
        MOVE INPUT-NUMBER TO OUTPUT-NUMBER
    END-IF

    MOVE INPUT-NAME TO OUTPUT-NAME
    COMPUTE TOTAL = TOTAL + INPUT-NUMBER.
    ADD 1 TO COUNTER.

    WRITE OUTPUT-RECORD.
    READ INPUT-FILE INTO INPUT-RECORD.
END-PERFORM.

CLOSE INPUT.
CLOSE OUTPUT.

DISPLAY 'Total numbers processed: ' TOTAL.
DISPLAY 'Total records processed: ' COUNTER.

STOP RUN. 

END PROGRAM EXAMPLE.