IDENTIFICATION DIVISION.
      PROGRAM-ID. STANDBY-REPORT.
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01  TOT-HOURS.
          05  TOT-HR-REG         PIC Z(6).
          05  TOT-HR-OVT         PIC Z(6).
      01  FR-HOURS.
          05  FR-HR-REG          PIC Z(6).
          05  FR-HR-OVT          PIC Z(6).
      01  TOTAL-PAYROLL.
          05  TOTAL-PAY          PIC Z(9).
          05  TOTAL-PAY2         PIC Z(9).
      01  PAY-CALCULATION.
          05  PAYRATE            PIC Z(4).    /* set payrate amount */
          05  FR-HOURS-MIN           PIC 99.
          05  FR-HOURS-HRS   PIC 999.
          05  FR-TOT-HOURS           PIC 99.
          05  FR-TOT-HOURS1    PIC 999.
      PROCEDURE DIVISION.
          MOVE 40 TO FR-TOT-HOURS.      /* set total hours */
          COMPUTE TOT-HOURS = FR-HOURS. /* calculate total regular hours */
          IF FR-TOT-HOURS = FR-HOURS    /* check if total hours match input */
              MULTIPLY PAYRATE BY FR-HOURS
              GIVING TOTAL-PAY
          ELSE
             MULTIPLY PAYRATE BY TOT-HOURS
             GIVING TOTAL-PAY2.
          DISPLAY "Total payroll is " TOTAL-PAY "for " TOT-HR-REG "regular hours and " TOT-HR-OVT "overtime hours."
          DISPLAY "The calculated payroll is " TOTAL-PAY2 "for " FR-HR-REG "regular hours and " FR-HR-OVT "overtime hours."
          STOP RUN.