IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FIRST-NAME      PIC X(10) VALUE "JOHN".
       PROCEDURE DIVISION.
       DISPLAY "HELLO, " WS-FIRST-NAME "!".
       STOP RUN.