IDENTIFICATION DIVISION.
       PROGRAM-ID.SAMPLE.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
		   
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-RECORD.
          05 IN-FIELD-1   PIC X(10).
          05 IN-FIELD-2   PIC X(10).
       
       WORKING-STORAGE SECTION.
       01 TOTALS.
          05 IN-FIELD-1-TOTAL   PIC 9(4)V99.
          05 IN-FIELD-2-TOTAL   PIC 9(4)V99.
       
       01 COUNTERS.
          05 RECORD-COUNT   PIC 99 VALUE ZERO.
          05 FIELD-1-COUNT   PIC 99 VALUE ZERO.
          05 FIELD-2-COUNT   PIC 99 VALUE ZERO.
       
       01 DECIMAL-POINT.
          05 POINT              PIC X.
          88 POINT-FOUND VALUE '.'.
          88 POINT-NOT-FOUND VALUE SPACE.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "STARTING PROGRAM...".
		   OPEN INPUT INFILE.
		   PERFORM READ-RECORD THRU END-OF-FILE.
		   CLOSE INFILE.
		   DISPLAY "PROGRAM COMPLETE!".
		   STOP RUN.
       
       READ-RECORD.
          READ INFILE
          AT END SET END-OF-FILE TO TRUE
          NOT AT END
             ADD 1 TO RECORD-COUNT
			 MOVE IN-FIELD-1 TO IN-FIELD-1-TOTAL
			 MOVE IN-FIELD-2 TO IN-FIELD-2-TOTAL
			 
			 INSPECT IN-FIELD-1-TOTAL TALLYING FIELD-1-COUNT
             FOR ALL SPACE.
             INSPECT IN-FIELD-1-TOTAL CONVERTING SPACE TO ZERO.
			 
             INSPECT IN-FIELD-2-TOTAL TALLYING FIELD-2-COUNT
             FOR ALL SPACE.
             INSPECT IN-FIELD-2-TOTAL CONVERTING SPACE TO ZERO.
			 
			 IF POINT-FOUND
                ADD 1 TO FIELD-2-COUNT
             ELSE
                ADD 1 TO FIELD-1-COUNT
             END-IF.
				 
			 ADD IN-FIELD-1-TOTAL TO TOTALS (I)
			 ADD IN-FIELD-2-TOTAL TO TOTALS (2).
			 
			 WRITE IN-RECORD FROM TOTALS.
			 
			 DISPLAY RECORD-COUNT "RECORDS READ SO FAR...".
		
	   END-OF-FILE.
		 DISPLAY "END OF FILE REACHED. TOTAL RECORDS READ: " RECORD-COUNT.
		 DISPLAY "TOTALS FOR IN-FIELD-1: " TOTALS (I).
		 DISPLAY "TOTALS FOR IN-FIELD-2: " TOTALS (2).
		 DISPLAY "TOTAL SPACE CHARACTERS IN IN-FIELD-1: " FIELD-1-COUNT.
	  	 DISPLAY "TOTAL SPACE CHARACTERS IN IN-FIELD-2: " FIELD-2-COUNT.