IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUST-FILE ASSIGN TO "CUSTFILE.DAT".
           SELECT ORDERS-FILE ASSIGN TO "ORDERS.DAT".
           SELECT INV-FILE ASSIGN TO "INVFILE.DAT".

       DATA DIVISION.
       FILE SECTION.
       FD CUST-FILE.
          01 CUSTOMER-RECORD.
              05 C-CUSTOMER-NUMBER    PIC X(4).
              05 C-CUSTOMER-NAME      PIC X(30).
              05 C-CUSTOMER-ADDRESS   PIC X(50).
       FD ORDERS-FILE.
          01 ORDER-RECORD.
              05 O-ORDER-NUMBER       PIC X(6).
              05 O-ORDER-DATE         PIC X(10).
              05 O-CUSTOMER-NUMBER    PIC X(4).
              05 O-ORDER-TOTAL        PIC 9(6)V99.
       FD INV-FILE.
          01 INVOICE-RECORD.
              05 I-INVOICE-NUMBER     PIC X(6).
              05 I-ORDER-NUMBER       PIC X(6).
              05 I-INVOICE-DATE       PIC X(10).
              05 I-PRODUCT-CODE       PIC X(4).
              05 I-PRODUCT-QUANTITY   PIC 999.
              05 I-PRODUCT-PRICE      PIC 9(6)V99.

       WORKING-STORAGE SECTION.
       01 NUM-CUSTOMERS           PIC 99.
       01 NUM-ORDERS              PIC 99.
       01 NUM-INVOICES            PIC 99.
       01 COUNTER                 PIC 99.
       01 TOTAL-ORDERS            PIC 9(6)V99.
       01 TOTAL-INVOICES          PIC 9(6)V99.

       PROCEDURE DIVISION.
       100-MAIN-LOGIC.
           OPEN INPUT CUST-FILE, ORDERS-FILE, INV-FILE.
           READ CUST-FILE AT END GO TO 999-EXIT.
           MOVE 1 TO COUNTER.
           PERFORM 200-GET-ORDERS.
           PERFORM 110-PROCESS-CUSTOMER.
           GO TO 100-MAIN-LOGIC.
       200-GET-ORDERS.
           READ ORDERS-FILE AT END GO TO 299-EXIT.
           IF ORDER-RECORD(O-CUSTOMER-NUMBER) = CUSTOMER-RECORD(C-CUSTOMER-NUMBER)
               ADD ORDER-RECORD(O-ORDER-TOTAL) TO TOTAL-ORDERS
               PERFORM 300-GET-INVOICES
           ELSE
               PERFORM 200-GET-ORDERS.
       300-GET-INVOICES.
           READ INV-FILE AT END GO TO 399-EXIT.
           IF INVOICE-RECORD(I-ORDER-NUMBER) = ORDER-RECORD(O-ORDER-NUMBER)
               ADD INVOICE-RECORD(I-PRODUCT-QUANTITY) TO NUM-INVOICES
               MULTIPLY INVOICE-RECORD(I-PRODUCT-PRICE) BY INVOICE-RECORD(I-PRODUCT-QUANTITY) GIVING TOTAL-INVOICES
               PERFORM 300-GET-INVOICES
           ELSE
               PERFORM 200-GET-ORDERS.
       110-PROCESS-CUSTOMER.
           DISPLAY "CUSTOMER: " CUSTOMER-RECORD(C-CUSTOMER-NAME) "HAS" NUM-ORDERS "ORDERS AND" NUM-INVOICES "INVOICES."
           ADD TOTAL-ORDERS TO CUSTOMER-RECORD(C-CUSTOMER-NUMBER).
           READ CUST-FILE AT END GO TO 999-EXIT.
           MOVE 0 TO COUNTER.
           MOVE 1 TO NUM-ORDERS, NUM-INVOICES, TOTAL-ORDERS, TOTAL-INVOICES.
       999-EXIT.
           CLOSE CUST-FILE, ORDERS-FILE, INV-FILE.
           STOP RUN.