IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-VAR1                    PIC X(20).
       01  WS-VAR2                    PIC S9(11)V99.
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "HELLO, WORLD!".
           PERFORM CALCULATION.
           STOP RUN.

       CALCULATION.
           MULTIPLY WS-VAR2 BY 10.
           ADD 25 TO WS-VAR2.
           MOVE "MY NAME IS" TO WS-VAR1.