IDENTIFICATION DIVISION.  // This is the identification division which contains program name, author, and other identifying information.
PROGRAM-ID. complex-code.  // Program ID is used to uniquely identify a COBOL program.

ENVIRONMENT DIVISION.  // This division contains information about the environment where the program will run.
INPUT-OUTPUT SECTION.  // This section defines the files to be used for input and output.

DATA DIVISION.  // This division is used to declare variables and working storage for the program.
WORKING-STORAGE SECTION.  // This section contains working variables that are used during program execution.

01 NUM1 PIC 9(3) VALUE 123.  // Declaration of a numeric variable 'NUM1' with a picture clause. Initial value is set to 123.
01 NUM2 PIC 9(3) VALUE 456.  // Declaration of another numeric variable 'NUM2' with a picture clause. Initial value is set to 456.

PROCEDURE DIVISION.  // This division contains the actual logic and processing of the program.
MAIN-PARA.  // Main paragraph label is used to denote the main logic of the program.
DISPLAY "The sum of NUM1 and NUM2 is " NUM1 + NUM2.  // Display statement to print the sum of NUM1 and NUM2.

STOP RUN.  // This statement is used to terminate the execution of the program.