IDENTIFICATION DIVISION.                               //Starting division
PROGRAM-ID. HELLO-WORLD.                                //Program name
AUTHOR. JOHN DOE.                                       //Author name
ENVIRONMENT DIVISION.                                   //Environment division
CONFIGURATION SECTION.                                  //Config section
SOURCE-COMPUTER. IBM-370.                               //Computer type
OBJECT-COMPUTER. IBM-370.                               //Target computer
DATA DIVISION.                                          //Data division
WORKING-STORAGE SECTION.                                //Working storage section
77  MSG            PIC X(80).                            //Declare variable for message output
PROCEDURE DIVISION.                                     //Procedure division
MAIN.
    MOVE "HELLO, WORLD!" TO MSG.                         //Assign value to variable
    DISPLAY MSG.                                        //Output message
STOPRUN.                                                 //Stop program