IDENTIFICATION DIVISION.
      PROGRAM-ID. MYPROGRAM.
      DATA DIVISION.
      WORKING-STORAGE SECTION.

      01  INPUT-DATA.
          05  NUM1 PIC S9(5)V9(2).
          05  NUM2 PIC S9(3)V9(1).
          05  OP PIC X.
          05  RESULT PIC S9(5)V9(2).

      PROCEDURE DIVISION.
      DISPLAY "ENTER THE FIRST NUMBER: ".
      ACCEPT NUM1.
      DISPLAY "ENTER THE SECOND NUMBER: ".
      ACCEPT NUM2.
      DISPLAY "ENTER THE OPERATION (+, -, *, /): ".
      ACCEPT OP.

      IF OP = "+" THEN
         ADD NUM1, NUM2 GIVING RESULT
      ELSE IF OP = "-" THEN
         SUBTRACT NUM2 FROM NUM1 GIVING RESULT
      ELSE IF OP = "*" THEN
         MULTIPLY NUM1 BY NUM2 GIVING RESULT
      ELSE IF OP = "/" THEN
         DIVIDE NUM1 BY NUM2 GIVING RESULT
      END-IF.

      DISPLAY "RESULT: " RESULT.
      STOP RUN.