IDENTIFICATION DIVISION.
      PROGRAM-ID. SAMPLEPROG.
      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT INFILE ASSIGN TO "INPUTFILE".
      SELECT OUTFILE ASSIGN TO "OUTPUTFILE".
      DATA DIVISION.
      FILE SECTION.
      FD INFILE.
      01  INPUT-RECORD PIC X(50).
      FD OUTFILE.
      01  OUTPUT-RECORD PIC X(50).
      WORKING-STORAGE SECTION.
      01  EOF-SWITCH PIC X.
      01  SWITCH-IN PIC X.
      01  SWITCH-OUT PIC X.
      01  SWITCH-LOOP.
         05  SWITCH-RESET PIC X.
         05  SWITCH-START PIC X.
         05  SWITCH-END PIC X.
      PROCEDURE DIVISION.
      MAIN-PROCEDURE.
      OPEN INPUT INFILE
      OPEN OUTPUT OUTFILE
      PERFORM READ-IN-FILE
      PERFORM UNTIL EOF-SWITCH EQUALS 'Y'
         IF SWITCH-IN EQUALS '0'
            PERFORM PRE-LOOP
         ELSE
            PERFORM POST-LOOP
      END-PERFORM
      PERFORM CLOSE-FILES
      STOP RUN.
      READ-IN-FILE.
      READ INFILE INTO INPUT-RECORD
      AT END MOVE 'Y' TO EOF-SWITCH
      END-READ.
      PRE-LOOP.
      MOVE INPUT-RECORD TO OUTPUT-RECORD
      WRITE OUTPUT-RECORD FROM INPUT-RECORD
      PERFORM READ-IN-FILE.
      POST-LOOP.
      IF SWITCH-START EQUALS 'Y'
         MOVE INPUT-RECORD TO OUTPUT-RECORD
         WRITE OUTPUT-RECORD FROM INPUT-RECORD
      END-IF
      IF SWITCH-RESET EQUALS 'Y'
         MOVE INPUT-RECORD TO OUTPUT-RECORD
         WRITE OUTPUT-RECORD FROM INPUT-RECORD
         MOVE 'Y' TO SWITCH-RESET
      END-EVALUATE
      EVALUATE SWITCH-END
         WHEN 'Y'
            MOVE 'N' TO SWITCH-END
         WHEN 'N'
            MOVE 'Y' TO SWITCH-START
            PERFORM POST-LOOP
         WHEN OTHER
            CONTINUE
      END-EVALUATE.
      CLOSE-FILES.
      CLOSE INFILE
      WITH OPTION KEEP
      CLOSE OUTFILE.