IDENTIFICATION DIVISION.              * This is the identification division of the program
PROGRAM-ID. MAINPROGRAM.              * This is the program id
DATA DIVISION.                        * This is the data division of the program
WORKING-STORAGE SECTION.              * This is the working-storage section
01 COUNT PIC 99 VALUE ZERO.            * This is a working storage variable defined with level number 01, alphanumeric, length 2 and initial value 0
PROCEDURE DIVISION.                   * This is the procedure division of the program
MAIN.                                  * This is the main program
    MOVE 1 TO COUNT.                   * This moves the value 1 to the COUNT variable
    PERFORM ADDITION-LOOP              * This performs the ADDITION-LOOP procedure
    DISPLAY 'Addition Result: ' COUNT. * This displays the result of the ADDITION-LOOP procedure
    STOP.                              * This stops the program execution
ADDITION-LOOP.                         * This is the ADDITION-LOOP procedure
    IF COUNT < 10                      * This checks if the COUNT variable is less than 10
        ADD 1 TO COUNT                 * This adds 1 to the COUNT variable
        PERFORM ADDITION-LOOP.         * This recursively calls the ADDITION-LOOP procedure
    END-IF.                            * End of IF statement
    EXIT.                              * This exits the procedure
END PROGRAM MAINPROGRAM.               * End of the program