****************************
      *> GENERATE RANDOM PASSWORD
      ****************************

             IDENTIFICATION DIVISION.
             PROGRAM-ID. RANDOM-PASSWORD.

             DATA DIVISION.
             WORKING-STORAGE SECTION.
             01 PASSWORD-TABLE.
                05 ACCESS-LIMIT PIC 9(2) VALUE 10.
                05 RANDOM-PASSWORD PIC X(10).

             01 GENERATE-RANDOM.
                05 RANDOM-SEED USAGE COMP.
                05 RANDOM-TABLE.
                   10 LETTER-TABLE OCCURS 26 TIMES
                       INDEXED BY ALPHABET-INDEX.
                      15 LETTER-VALUE PIC X.
                   10 NUMBER-TABLE OCCURS 10 TIMES
                       INDEXED BY NUMBER-INDEX.
                      15 NUMBER-VALUE PIC 9.
                   10 SPECIAL-CHAR-TABLE OCCURS 10 TIMES
                       INDEXED BY SPECIAL-INDEX.
                      15 SPECIAL-VALUE PIC X.

             PROCEDURE DIVISION.
             000-MAIN PROCEDURE.
                 PERFORM 100-INITIALIZE-RANDOM-TABLE
                     VARYING ALPHABET-INDEX FROM 1 BY 1
                     UNTIL ALPHABET-INDEX > 26
                 PERFORM 200-GENERATE-PASSWORD
                     VARYING ACCESS-COUNT FROM 1 BY 1
                     UNTIL ACCESS-COUNT > ACCESS-LIMIT
             100-INITIALIZE-RANDOM-TABLE.
                 MOVE 1234567 TO RANDOM-SEED
                 INSPECT RANDOM-PASSWORD TALLYING
                     MISSING-LETTERS FOR CHARACTERS
                     BEFORE INITIAL "A"
                 PERFORM 110-INITIALIZE-LETTER-TABLE
                     VARYING NUMBER-INDEX FROM 0 BY 1
                     UNTIL NUMBER-INDEX > MISSING-LETTERS
                 PERFORM 120-INITIALIZE-NUMBER-TABLE
                     VARYING NUMBER-INDEX FROM 1 BY 1
                     UNTIL NUMBER-INDEX > 10
                 PERFORM 130-INITIALIZE-SPECIAL-CHAR-TABLE
                     VARYING SPECIAL-INDEX FROM 0 BY 1
                     UNTIL SPECIAL-INDEX > MISSING-LETTERS
             110-INITIALIZE-LETTER-TABLE.
                 COMPUTE LETTER-VALUE = RANDOM-SEED MOD 26 + 65
                 ADD 65 TO RANDOM-SEED
             120-INITIALIZE-NUMBER-TABLE.
                 COMPUTE NUMBER-VALUE = RANDOM-SEED MOD 10 + 48
                 ADD 48 TO RANDOM-SEED
             130-INITIALIZE-SPECIAL-CHAR-TABLE.
                 COMPUTE SPECIAL-VALUE = RANDOM-SEED MOD 10 + 33
                 ADD 33 TO RANDOM-SEED
             200-GENERATE-PASSWORD.
                 PERFORM 210-GENERATE-LETTERS
                     VARYING ALPHABET-INDEX FROM 1 BY 1
                     UNTIL ALPHABET-INDEX > 10
                 PERFORM 220-GENERATE-NUMBERS
                     VARYING NUMBER-INDEX FROM 1 BY 1
                     UNTIL NUMBER-INDEX > 3
                 PERFORM 230-GENERATE-SPECIAL-CHARS
                     VARYING SPECIAL-INDEX FROM 1 BY 1
                     UNTIL SPECIAL-INDEX > 1
             210-GENERATE-LETTERS.
                 MOVE LETTER-VALUE TO RANDOM-PASSWORD(ALPHABET-INDEX)
                 ADD 1 TO RANDOM-SEED
             220-GENERATE-NUMBERS.
                 MOVE NUMBER-VALUE TO RANDOM-PASSWORD(NUMBER-INDEX + 10)
                 ADD 1 TO RANDOM-SEED
             230-GENERATE-SPECIAL-CHARS.
                 MOVE SPECIAL-VALUE TO RANDOM-PASSWORD(SPECIAL-INDEX + 13)
                 ADD 1 TO RANDOM-SEED
             300-DISPLAY-PASSWORD.
                 DISPLAY "Generated password is: ", RANDOM-PASSWORD
                 STOP RUN.

             END PROGRAM RANDOM-PASSWORD.