Identification Division.
    Program-ID. Complex-Math.
    Author. Your Name.

Data Division.
     Working-Storage Section.
   01  Constant-Values.
       02 Value1 PIC 9(4)V9(2).
       02 Value2 PIC 9(3).
       02 Value3 PIC 9(4)V9(2).
   01  Calculation-Values.
       02 Result1 PIC 9(5)V9(2).
       02 Result2 PIC 9(4).

Procedure Division.
    Begin.
       Compute Result1 = Value1 + ((Value2 * 2) / (Value3 * 1.5))
       Multiply Result2 by Value1 giving Result2
       Subtract Result1 from Result2

       Display "The result of the complex calculation is: "
       Display Result1

       Stop Run.