IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-1 PIC S9(4)V9(2).
01 NUM-2 PIC S9(4)V9(2).
01 SUM PIC S9(4)V9(2).
01 DISPLAY-MSG1 PIC X(25) VALUE 'ENTER FIRST NUMBER:'.
01 DISPLAY-MSG2 PIC X(25) VALUE 'ENTER SECOND NUMBER:'.
01 ERROR-MSG PIC X(50) VALUE 'ERROR: PLEASE ENTER VALID NUMBERS'.
PROCEDURE DIVISION.
DISPLAY DISPLAY-MSG1
ACCEPT NUM-1
DISPLAY DISPLAY-MSG2
ACCEPT NUM-2
COMPUTE SUM = NUM-1 + NUM-2
IF NUM-1 > 999 THEN
    DISPLAY ERROR-MSG
ELSEIF NUM-2 > 999 THEN
    DISPLAY ERROR-MSG
ELSE
    DISPLAY 'SUM OF ' NUM-1 ' AND ' NUM-2 ' IS ' SUM
END-IF.