IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-ARRAY.
 05 NUM1 PIC 9(3).
 05 NUM2 PIC 9(3).
 05 RESULT PIC 9(4).

PROCEDURE DIVISION.
MAIN-PARA.
  MOVE 123 TO NUM1
  MOVE 456 TO NUM2
  PERFORM CALCULATE 10 TIMES.
  DISPLAY "RESULT: " RESULT
  STOP RUN.

CALCULATE.
  COMPUTE RESULT = NUM1 + NUM2.