IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME                 PIC X(20) VALUE "WORLD".
       01 WS-OUTPUT               PIC X(40).
       01 WS-COUNTDOWN            PIC 99 VALUE 10.
       PROCEDURE DIVISION.
          DISPLAY "*******************************" UPON CONSOLE
          DISPLAY "*** WELCOME TO HELLO WORLD! ***" UPON CONSOLE
          DISPLAY "*******************************" UPON CONSOLE
          DISPLAY " " UPON CONSOLE
          PERFORM DISP-HELLO UNTIL WS-COUNTDOWN = 0
          DISPLAY " " UPON CONSOLE
          DISPLAY "*** THE END ***" UPON CONSOLE
          STOP RUN.
    
       DISP-HELLO.
          MOVE "HELLO, " TO WS-OUTPUT
          STRING WS-OUTPUT, WS-NAME INTO WS-OUTPUT DELIMITED BY " " 
          DISPLAY WS-OUTPUT UPON CONSOLE
          SUBTRACT 1 FROM WS-COUNTDOWN.