IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-SUM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'INFILE'.
           SELECT OUTPUT-FILE ASSIGN TO 'OUTFILE'.
           INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01  RECORD-IN.
           05  NUM1    PIC S9(9)       VALUE 0.
           05  NUM2    PIC S9(9)       VALUE 0.
       FD OUTPUT-FILE.
       01  RECORD-OUT        PIC X(27).


       WORKING-STORAGE SECTION.
       01  RESULT              PIC S9(9)   VALUE 0.
       01  NUM1-STR            PIC X(9).
       01  NUM2-STR            PIC X(9).
       01  POSI                PIC 9(2).

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           OPEN INPUT INPUT-FILE OUTPUT OUTPUT-FILE.
           PERFORM UNTIL EOF = 'Y'
               READ INPUT-FILE
                   IF EOF = 'Y'
                       GO TO END-PROGRAM
                   END-IF
                   MOVE NUM1 TO NUM1-STR
                   MOVE NUM2 TO NUM2-STR
                   PERFORM ADD-NUMBERS
                   MOVE RESULT TO RECORD-OUT
                   WRITE RECORD-OUT
           END-PERFORM
           END-PROGRAM.
           CLOSE INPUT-FILE OUTPUT-FILE.

       ADD-NUMBERS.
           PERFORM VARYING POSI FROM 9 BY -1 UNTIL POSI = 1
               ADD 48 TO NUM1-STR(POSI:1)
               ADD 48 TO NUM2-STR(POSI:1)
           END-PERFORM
           COMPUTE RESULT = FUNCTION NUM1-STR + FUNCTION NUM2-STR.