IDENTIFICATION DIVISION.                         * opening statement of COBOL program
       PROGRAM-ID. HELLO-WORLD.                          * program name

       DATA DIVISION.                                   *this is where data definitions are declared
       WORKING-STORAGE SECTION.                         
       01 VAR-1 PIC S99 VALUE 10.                        * declare variable with a signed 99 type and initial value of 10
       01 VAR-2 PIC 9999 VALUE 50.                       * declare variable with an unsigned 9999 type and initial value of 50
       01 RESULT PIC 9999 VALUE 0.                       * declare variable to store result, initial value is 0

       PROCEDURE DIVISION.                               * main execution section
       MAIN SECTION.                                     * start of main section
           MULTIPLY VAR-1 BY VAR-2 GIVING RESULT.        * perform multiplication of VAR-1 and VAR-2 and store result in RESULT
           DISPLAY "The result of VAR-1 and VAR-2 is " RESULT ".".     * display the result to screen
           STOP RUN.                                     * stop the program

       END PROGRAM HELLO-WORLD.                          * end of program