IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT INPUT-FILE ASSIGN TO 'INPUT.TXT'.
            SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'.

       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS.
       01  INPUT-RECORD.
           05  INPUT-FIELD1       PIC X(10).
           05  INPUT-FIELD2       PIC 9(5).
           05  INPUT-FIELD3       PIC X(10).

       FD  OUTPUT-FILE
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS.
       01  OUTPUT-RECORD.
           05  OUTPUT-FIELD1      PIC X(20).
           05  OUTPUT-FIELD2      PIC 9(10).
           05  OUTPUT-FIELD3      PIC X(30).

       WORKING-STORAGE SECTION.
       01  WS-VAR1                 PIC 9(5).
       01  WS-VAR2                 PIC X(10).
       01  WS-COUNTER              PIC S9(5) VALUE 0.

       PROCEDURE DIVISION.
       0000-MAIN.
           PERFORM 0100-READ-INPUT-RECORDS
           PERFORM 0200-PROCESS-RECORD
           PERFORM 0300-WRITE-OUTPUT-RECORD
           PERFORM 0400-CLOSE-FILES
           STOP RUN.

       0100-READ-INPUT-RECORDS.
           OPEN INPUT INPUT-FILE
           READ INPUT-FILE INTO INPUT-RECORD
               AT END SET WS-COUNTER TO 1.
           CLOSE INPUT INPUT-FILE.

       0200-PROCESS-RECORD.
           IF WS-COUNTER = 0
               MOVE INPUT-FIELD2 TO WS-VAR1
               MOVE INPUT-FIELD3 TO WS-VAR2
               PERFORM 0210-UPPERCASE-FIELDS
           ELSE
               ADD 1 TO WS-VAR1.

       0300-WRITE-OUTPUT-RECORD.
           OPEN OUTPUT OUTPUT-FILE.
           MOVE WS-VAR2 TO OUTPUT-FIELD3
           WRITE OUTPUT-RECORD FROM OUTPUT-FIELD1
                                        OUTPUT-FIELD2
                                        OUTPUT-FIELD3.
           CLOSE OUTPUT OUTPUT-FILE.

       0400-CLOSE-FILES.
           CLOSE INPUT INPUT-FILE.
           CLOSE OUTPUT OUTPUT-FILE.

       0210-UPPERCASE-FIELDS.
           STRING INPUT-FIELD1 DELIMITED BY ' '
                 DELIMITER SIZE 1
                 CONVERTING 'abcdefghijklmnopqrstuvwxyz'
                 TO     'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
                 GIVING INPUT-FIELD1.

       END PROGRAM SAMPLE.