IDENTIFICATION DIVISION.
PROGRAM-ID. complex-program.
DATA DIVISION.
WORKING-STORAGE SECTION.

77 num-one PIC 9(3).
77 num-two PIC 9(3).
77 result PIC 9(5).

01 num-list.
02 num-item PIC 9(3) OCCURS 10 TIMES.

01 calc-section.
03 temp-num PIC 9(5).
03 temp-mult PIC 9(5).
03 temp-sum PIC 9(5).
03 temp-div PIC 9(5).

PROCEDURE DIVISION.

DISPLAY "Enter the first number:"
ACCEPT num-one.

DISPLAY "Enter the second number:"
ACCEPT num-two.

PERFORM VARYING i FROM 1 BY 1 UNTIL i > 10
  COMPUTE temp-num = num-one * i
         temp-mult = temp-num * num-two
         temp-sum = temp-mult + num-two
         temp-div = temp-sum / i
  MOVE temp-div TO num-item(i)
END-PERFORM.

PERFORM VARYING j FROM 1 BY 1 UNTIL j > 10
  ADD num-item(j) TO result
END-PERFORM.

DISPLAY "The result is:" result.

STOP RUN.