IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEX-PROGRAM.

       * This is a program that performs complex calculations
       * and outputs the results in a report format.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       * Declaring the input file for the data to be read

       SELECT INPUT-FILE ASSIGN TO "DATAFILE.DAT" 
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD INPUT-FILE.
       01 INPUT-RECORD.
           05 INPUT-NUMBER PIC 9(8)V9(2).
           05 INPUT-DESCRIPTION PIC X(20).

       WORKING-STORAGE SECTION.

       * Declaring working variables for calculations and report formatting

       01 COUNTER PIC 99.
       01 TOTAL-NUMBER PIC 9(8)V9(2).
       01 AVG-NUMBER PIC 9(8)V9(2).
       01 MAX-NUMBER PIC 9(8)V9(2).
       01 MIN-NUMBER PIC 9(8)V9(2).
       01 REPORT-LINE PIC X(80).

       PROCEDURE DIVISION.

       * Opening the input file for reading
       OPEN INPUT INPUT-FILE.

       * Resetting the counter variables to 0
       MOVE 0 TO COUNTER.
       MOVE 0 TO TOTAL-NUMBER.
       MOVE 0 TO MAX-NUMBER.
       MOVE 99999999.99 TO MIN-NUMBER.

       * Reading data from input file and performing calculations
       PERFORM READ-FILE UNTIL INPUT-NUMBER = 0.

       * Closing the input file
       CLOSE INPUT-FILE.

       * Calculating average and formatting report line
       COMPUTE AVG-NUMBER = TOTAL-NUMBER / COUNTER.
       MOVE "Average number: " TO REPORT-LINE
       MOVE AVG-NUMBER TO REPORT-LINE(17:11).

       * Outputting report line to console or printer
       DISPLAY REPORT-LINE.

       STOP RUN.

       * Subroutine to read data from input file and perform calculations
       READ-FILE.
           READ INPUT-FILE
               AT END EXIT.

           * Incrementing counter and calculating total
           ADD 1 TO COUNTER.
           ADD INPUT-NUMBER TO TOTAL-NUMBER.

           * Updating max and min numbers if necessary
           IF INPUT-NUMBER > MAX-NUMBER
               MOVE INPUT-NUMBER TO MAX-NUMBER.
           IF INPUT-NUMBER < MIN-NUMBER
               MOVE INPUT-NUMBER TO MIN-NUMBER.

           * Formatting report line for current input record
           MOVE INPUT-DESCRIPTION TO REPORT-LINE(2:20).
           MOVE INPUT-NUMBER TO REPORT-LINE(25:11).

           * Outputting report line to console or printer
           DISPLAY REPORT-LINE.
       END READ-FILE.