IDENTIFICATION DIVISION.
    
       PROGRAM-ID. TEST-CODE.
    
       ENVIRONMENT DIVISION.
    
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT I-O-FILE ASSIGN TO "TESTFILE"
           ORGANIZATION IS SEQUENTIAL.
    
       DATA DIVISION.
    
       FILE SECTION.
       FD  I-O-FILE.
       01  I-O-RECORD.
           05  EMPLOYEE-ID           PIC 9(5).
           05  EMPLOYEE-NAME         PIC X(20).
           05  EMPLOYEE-ADDRESS      PIC X(30).
           05  EMPLOYEE-SALARY       PIC 9(6).
    
       WORKING-STORAGE SECTION.
       01  COUNT                   PIC 9(2) VALUE 0.
       01  HEADER-LINE.
           05                      PIC X(30) VALUE 'EMPLOYEE DETAILS'.
    
       PROCEDURE DIVISION.
    
       100-MAIN-ROUTE.
    
           OPEN INPUT I-O-FILE.
    
           PERFORM UNTIL EOF-CHECK
               READ I-O-FILE AT END
                   MOVE 'Y' TO EOF-CHECK
               END-READ
               DISPLAY 'EMPLOYEE ID: ' EMPLOYEE-ID
               DISPLAY 'EMPLOYEE NAME: ' EMPLOYEE-NAME
               DISPLAY 'EMPLOYEE ADDRESS: ' EMPLOYEE-ADDRESS
               DISPLAY 'EMPLOYEE SALARY: ' EMPLOYEE-SALARY
           END-PERFORM.
    
       EOF-CHECK.
           READ I-O-FILE AT END
              MOVE 'Y' TO EOF-CHECK
           END-READ.
    
           PERFORM PRINT-HEADER
           PERFORM PRINT-EMPLOYEE-DETAILS
    
       PRINT-HEADER.
           ADD 1 TO COUNT
           DISPLAY 'COUNT: ' COUNT.
           DISPLAY HEADER-LINE.
    
       PRINT-EMPLOYEE-DETAILS.
           DISPLAY 'EMPLOYEE ID: ' EMPLOYEE-ID
           DISPLAY 'EMPLOYEE NAME: ' EMPLOYEE-NAME
           DISPLAY 'EMPLOYEE ADDRESS: ' EMPLOYEE-ADDRESS
           DISPLAY 'EMPLOYEE SALARY: ' EMPLOYEE-SALARY.
    
       999-EXIT.
           CLOSE I-O-FILE
           STOP RUN.