IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-TOTAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4).
       01 NUM2 PIC 9(4).
       01 TOTAL PIC 9(4).

       PROCEDURE DIVISION.
       CALCULATE-TOTAL.
           DISPLAY "Enter first number: "
           ACCEPT NUM1
           DISPLAY "Enter second number: "
           ACCEPT NUM2
           ADD NUM1 TO NUM2 GIVING TOTAL
           DISPLAY "Total is: " TOTAL
       STOP RUN.