IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-INPUTS PIC 99. 
01 CURRENT-INPUT PIC 99.
01 INPUT-COUNT PIC 99.
01 TOTAL PIC S9(9) COMP.

PROCEDURE DIVISION.
INPUT-SECTION.
    DISPLAY "Enter the number of inputs: ".
    ACCEPT NUM-INPUTS.
    MOVE ZERO TO TOTAL.
        
PERFORM UNTIL INPUT-COUNT EQUAL TO NUM-INPUTS
    DISPLAY "Enter input #", INPUT-COUNT, ": ".
    ACCEPT CURRENT-INPUT.
    
    COMPUTE TOTAL = TOTAL + CURRENT-INPUT.
    
    ADD 1 TO INPUT-COUNT.
END-PERFORM.

DISPLAY "The total is: ", TOTAL.

STOP RUN.