IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-CODE.
       AUTHOR. JOHN DOE.
       ENVIRONMENT DIVISION.
       
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 NUM-A PIC 9(8).
       01 NUM-B PIC 9(8).
       01 SUM PIC S9(9) COMP.
       01 DIVISOR PIC 9(2).
       01 REMAINDER PIC 9(2).
       
       LINKAGE SECTION.
       01 MSG-TEXT.
           05 FILLER    PIC X(6).
           05 MSG-LINE  PIC X(80).
           05 FILLER    PIC X(6).
       
       PROCEDURE DIVISION.
       
       START.
           DISPLAY "Enter 2 integers to be divided: ".
           ACCEPT NUM-A NUM-B.
           IF NUM-B = 0
               DISPLAY "Divisor cannot be 0.".
           ELSE
               DIVIDE NUM-A BY NUM-B GIVING SUM REMAINDER.
               
               IF REMAINDER = 0
                   DISPLAY MSG-TEXT FROM MSG-LINE(1:8) "The result is: " SUM.
               ELSE
                   MOVE "Invalid Input" TO MSG-LINE(1:20).
                   GO TO PRINT.
                       
       PRINT.
           DISPLAY MSG-TEXT FROM MSG-LINE(1:20).
           EXIT PROGRAM.
           
       END PROGRAM SAMPLE-CODE.