IDENTIFICATION DIVISION.
     PROGRAM-ID. ADD-EM.
     DATA DIVISION.
     WORKING-STORAGE SECTION.
     01 A        PIC 9(4) VALUE IS 1500.
     01 B        PIC 9(4) VALUE IS 500.
     01 C        PIC 9(4) VALUE IS 0.
     PROCEDURE DIVISION.
     ADD A, B GIVING C.
     DISPLAY "The sum is: "C.
     STOP RUN.