IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

working-storage section.
01  num1 pic s9(3).
01  num2 pic s9(3).
01  sum pic s9(4).

procedure division.
    display "Enter the first number: ".
    accept num1.

    display "Enter the second number: ".
    accept num2.

    compute sum = num1 + num2.

    display "The sum is " sum.

    stop run.