IDENTIFICATION DIVISION.
       PROGRAM-ID. MATH-OPERATIONS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1           PIC 9(10).
       01 NUM2           PIC 9(10).
       01 RESULT         PIC 9(10).
       01 TEMP           PIC 9(10) VALUE 0.

       PROCEDURE DIVISION.
       MOVE 1234567890 TO NUM1.
       MOVE 2468013579 TO NUM2.

       ADD NUM1, NUM2 GIVING RESULT.
       DISPLAY "Addition: " RESULT.

       SUBTRACT NUM1 FROM NUM2 GIVING RESULT.
       DISPLAY "Subtraction: " RESULT.

       MULTIPLY NUM1 BY NUM2 GIVING RESULT.
       DISPLAY "Multiplication: " RESULT.

       DIVIDE NUM1 INTO NUM2 GIVING RESULT.
       DISPLAY "Division: " RESULT.

       IF (NUM1 < NUM2) THEN
           MOVE NUM1 TO TEMP.
           MOVE NUM2 TO NUM1.
           MOVE TEMP TO NUM2.
       END-IF.
       DISPLAY "Largest Number: " NUM1.

       STOP RUN.