IDENTIFICATION DIVISION.
       PROGRAM-ID. ADVANCE-FEE-SCAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-AMT PIC 9(8)V99 VALUE 5000.00.
       01 INTEREST-AMT PIC 9(7)V99.
       01 TOTAL-AMT PIC 9(9)V99.
       77 MAX-INTEREST PIC 9(6)V99 VALUE 500.00.
       77 MIN-INTEREST PIC 9(6)V99 VALUE 250.00.
       PROCEDURE DIVISION.
       BEGIN.
           IF INPUT-AMT > 10000 THEN
               COMPUTE TOTAL-AMT = INPUT-AMT + MAX-INTEREST
           ELSE
               COMPUTE TOTAL-AMT = INPUT-AMT + MIN-INTEREST
           END-IF.
           COMPUTE INTEREST-AMT = TOTAL-AMT - INPUT-AMT.
           DISPLAY "CONGRATULATIONS! YOU HAVE JUST WON $" INTEREST-AMT "IN INTEREST!".
       END PROGRAM ADVANCE-FEE-SCAM.