IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           SYMBOLIC CHARACTERS.
               DOT     IS '.'.
               SPACE   IS ' '.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
               SELECT INPUT-FILE ASSIGN TO 'INPUT.DAT'.
               SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.DAT'.
           
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORDING MODE IS F.
       01 INPUT-RECORD.
           05 INPUT-NAME   PIC X(20).
           05 INPUT-AGE    PIC 99.
           05 INPUT-SALARY PIC 99999.99.
           
       FD OUTPUT-FILE
           RECORDING MODE IS F.
       01 OUTPUT-RECORD.
           05 OUTPUT-NAME   PIC X(20).
           05 OUTPUT-INCOME PIC 999999.99.
           05 OUTPUT-TAX    PIC 9(5)V99.
           
       WORKING-STORAGE SECTION.
       01 TAX-RATE         PIC 9(2)V99 VALUE 0.1.
       01 CALCULATED-TAX    PIC 9(5)V99.
           
       PROCEDURE DIVISION.
       0000-MAIN.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM UNTIL INPUT-FILE-STATUS = 2
               READ INPUT-FILE AT END SET INPUT-FILE-STATUS TO 2
               MOVE INPUT-NAME TO OUTPUT-NAME
               COMPUTE OUTPUT-INCOME = INPUT-SALARY * 12
               COMPUTE CALCULATED-TAX = INPUT-SALARY * TAX-RATE
               MOVE CALCULATED-TAX TO OUTPUT-TAX
               WRITE OUTPUT-RECORD
           END-PERFORM
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE
           STOP RUN.
           
       END PROGRAM SAMPLE.