DATA DIVISION.

WORKING-STORAGE SECTION.

01 EMPLOYEE-TABLE.

   05 EMPLOYEE-NAME       PIC X(20).
   05 EMPLOYEE-ID         PIC 9(5).
   05 EMPLOYEE-DEPT       PIC 9.

01 DEPT-TABLE.

   05 DEPT-NUM        PIC 9.
   05 DEPT-NAME       PIC X(15).

01 EMPLOYEE-COUNTER        PIC 9(5) VALUE 1.

01 DEPT-COUNTER            PIC 9(5) VALUE 1.

01 TOTAL-SALARY             PIC 9(7)V99 VALUE 0.

01 EMPLOYEE-REPORT.

   05 EMPLOYEE-HEADER     PIC X(20) VALUE "EMPLOYEE REPORT".
   05 EMPLOYEE-FOOTER     PIC X(20) VALUE "END OF REPORT".

   05 EMPLOYEE-BODY.
      10 EMPLOYEE-TITLE   PIC X(20) VALUE "EMPLOYEE DETAILS".
      10 EMPLOYEE-LINE    PIC X(30) VALUE "----------------------".
      10 EMPLOYEE-INFO    PIC X(50).

   05 DEPT-REPORT.

      10 DEPT-TITLE       PIC X(20) VALUE "DEPARTMENT REPORT".
      10 DEPT-LINE        PIC X(30) VALUE "----------------------".
      10 DEPT-INFO        PIC X(50).

PROCEDURE DIVISION.

   PERFORM INITIALIZE-DATA.
   PERFORM READ-EMPLOYEE-FILE.
   PERFORM READ-DEPT-FILE.

   SORT EMPLOYEE-TABLE ASCENDING
      ON EMPLOYEE-ID
      USING EMPLOYEE-ID.

   SORT DEPT-TABLE ASCENDING
      ON DEPT-NUM
      USING DEPT-NUM.

   PERFORM GENERATE-REPORT.

   STOP RUN.

INITIALIZE-DATA.
   MOVE 0 TO EMPLOYEE-COUNTER, DEPT-COUNTER, TOTAL-SALARY.

READ-EMPLOYEE-FILE.
   READ EMPLOYEE-FILE
      AT END
         MOVE "END OF FILE" TO EMPLOYEE-INFO
         PERFORM DISPLAY-EMPLOYEE-REPORT
      NOT AT END
         MOVE EMPLOYEE-NAME TO EMPLOYEE-INFO
         MOVE EMPLOYEE-ID TO EMPLOYEE-INFO
         MOVE EMPLOYEE-DEPT TO EMPLOYEE-INFO
         PERFORM CALCULATE-SALARY.

READ-DEPT-FILE.
   READ DEPT-FILE
      AT END
         MOVE "END OF FILE" TO DEPT-INFO
         PERFORM DISPLAY-DEPT-REPORT
      NOT AT END
         MOVE DEPT-NUM TO DEPT-INFO
         MOVE DEPT-NAME TO DEPT-INFO.

CALCULATE-SALARY.
   MULTIPLY EMPLOYEE-ID BY 100
       GIVING TOTAL-SALARY.

GENERATE-REPORT.
   PERFORM DISPLAY-EMPLOYEE-REPORT.
   PERFORM DISPLAY-DEPT-REPORT.

DISPLAY-EMPLOYEE-REPORT.
   DISPLAY EMPLOYEE-HEADER.
   DISPLAY EMPLOYEE-INFO.
   DISPLAY EMPLOYEE-LINE.
   DISPLAY EMPLOYEE-FOOTER.

DISPLAY-DEPT-REPORT.
   DISPLAY DEPT-TITLE.
   DISPLAY DEPT-INFO.
   DISPLAY DEPT-LINE.
   DISPLAY DEPT-FOOTER.