IDENTIFICATION DIVISION.                            * This is the Identification Division, it contains basic information about the program.
PROGRAM-ID. COMPLEX-CALC.                           * This is the program name.
DATA DIVISION.                                      * This is the Data Division, it defines the data used in the program.
WORKING-STORAGE SECTION.                            * This is the Working-Storage Section, it defines variables used in the program.

01 NUM-ONE         PIC 9(5) VALUE 12345.             * This is a variable declaration, it defines a numeric variable called NUM-ONE with a length of 5 digits and an initial value of 12345.
01 NUM-TWO         PIC 9(5) VALUE 67890.             * Another variable declaration for NUM-TWO.

PROCEDURE DIVISION.                                  * This is the Procedure Division, it contains the actual program logic.
MAIN-LOGIC.

MULTIPLY NUM-ONE BY NUM-TWO GIVING NUM-ONE.          * This statement multiplies the values of NUM-ONE and NUM-TWO and stores the result in NUM-ONE.

DISPLAY 'The product of NUM-ONE and NUM-TWO is ' NUM-ONE.  * This statement displays the result of the previous multiplication.

END PROGRAM COMPLEX-CALC.                           * This is the end of the program logic.