IDENTIFICATION DIVISION.        * starting point of COBOL program
       PROGRAM-ID. SAMPLE-PROGRAM.     * name of program
       DATA DIVISION.                  * declaration of data items
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5).               * first number to be entered
       01 NUM2 PIC 9(5).               * second number to be entered
       01 RESULT PIC 9(6).             * result of calculation
       PROCEDURE DIVISION.             * actual code of program
       MAIN-PROCEDURE.
           DISPLAY "Enter first number:".
           ACCEPT NUM1.                * user inputs first number
           DISPLAY "Enter second number:".
           ACCEPT NUM2.                * user inputs second number
           COMPUTE RESULT = NUM1 + NUM2.  * addition of two numbers
           DISPLAY "Result is:".
           DISPLAY RESULT.             * output of calculation
           STOP RUN.                   * stop execution of the program
       END PROGRAM SAMPLE-PROGRAM.      * end of program