IDENTIFICATION DIVISION. 
 PROGRAM-ID. MY-PROGRAM. 

 DATA DIVISION. 
 WORKING-STORAGE SECTION. 
 01 NUM1 PIC XX. 
 01 NUM2 PIC XX. 
 01 RESULT PIC XX. 

 PROCEDURE DIVISION. 
  MOVE '12' TO NUM1. 
  MOVE '34' TO NUM2. 
  MULTIPLY NUM1 BY NUM2 GIVING RESULT. 
  DISPLAY 'RESULT:' RESULT. 
  DIVIDE '56' INTO RESULT GIVING NUM1. 
  DISPLAY 'FINAL RESULT:' NUM1. 

 STOP RUN.