IDENTIFICATION DIVISION.                                                            
       PROGRAM-ID. Generate-Math-Table.                                                      
       DATA DIVISION.                                                                        
       WORKING-STORAGE SECTION.                                                              
       01 NUM-IN-PARA.                                                                                                           
           05 NUM-INPUT PIC 9(2) VALUE 10.                                                                                                                                                    
           05 MULTIPLIER PIC 9(2) VALUE 1.                                                                                                                                                   
           05 RESULT PIC 9(4).                                                                                                                                                             
       PROCEDURE DIVISION.                                                                      
       PERFORM PARA-HEADER                                                                    
       PERFORM PARA-TABLE.                                                                     
       
       PARA-HEADER.                                                                            
            DISPLAY "MULTIPLICATION TABLE".                                                   
            DISPLAY "------------------------".                                             
            DISPLAY "Number|Multiplier|Result".                                      
            DISPLAY "------------------------".                                             
            
       PARA-TABLE.                                                                                    
            DISPLAY NUM-INPUT                                                                     
            PERFORM VARYING MULTIPLIER FROM 1 BY 1 UNTIL MULTIPLIER > 10                   
                COMPUTE RESULT = NUM-INPUT * MULTIPLIER                                              
                DISPLAY RESULT                                                                       
            END-PERFORM.                                                                        
            .
        
       STOP RUN.