IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX CODE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-ARRAY.
   02 FIRST-NUMBER PIC 9(5).
   02 SECOND-NUMBER PIC 9(5).
   02 THIRD-NUMBER PIC 9(5).
   02 RESULT PIC 9(5).
01 OUTPUT-ARRAY.
   02 RESULT-NUMBER PIC 9(5).
01 TEMP-NUM PIC 9(5).
01 MAXIMUM-NUMBER PIC 9(5).
01 MINIMUM-NUMBER PIC 9(5).
01 TOTAL PIC 9(5).
01 AVERAGE PIC 9(5).

PROCEDURE DIVISION.
MAIN-LOGIC SECTION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
        ACCEPT INPUT-ARRAY (I)
    END-PERFORM.
    MOVE FIRST-NUMBER TO TEMP-NUM
    IF SECOND-NUMBER > FIRST-NUMBER
        MOVE SECOND-NUMBER TO MAXIMUM-NUMBER
        MOVE FIRST-NUMBER TO MINIMUM-NUMBER
    ELSE
        MOVE FIRST-NUMBER TO MAXIMUM-NUMBER
        MOVE SECOND-NUMBER TO MINIMUM-NUMBER
    END-IF
    IF THIRD-NUMBER > MAXIMUM-NUMBER
        MOVE THIRD-NUMBER TO MAXIMUM-NUMBER
    END-IF
    IF THIRD-NUMBER < MINIMUM-NUMBER
        MOVE THIRD-NUMBER TO MINIMUM-NUMBER
    END-IF
    ADD FIRST-NUMBER, SECOND-NUMBER, THIRD-NUMBER GIVING TOTAL
    DIVIDE TOTAL BY 3 GIVING AVERAGE
    MOVE AVERAGE TO RESULT
    ACCEPT OUTPUT-ARRAY (1) FROM RESULT-NUMBER.

END PROGRAM COMPLEX CODE.