ENVIRONMENT DIVISION.
   CONFIGURATION SECTION.
   SOURCE-COMPUTER. IBM-370.
   
   DATA DIVISION.
   FILE SECTION.
   FD IN-FILE.
   01 IN-RECORD.
      02 EMPLOYEE-ID PIC 9(5).
      02 EMPLOYEE-NAME PIC X(20).
      02 EMPLOYEE-AGE PIC 99.
      02 EMPLOYEE-SALARY PIC 9(6).
   
   WORKING-STORAGE SECTION.
   01 MAX-SALARY PIC 9(6).
   
   PROCEDURE DIVISION.
   OPEN INPUT IN-FILE.
   PERFORM UNTIL MAX-SALARY = 999999
      READ IN-FILE
      AT END MOVE 999999 TO MAX-SALARY
      NOT AT END
         IF EMPLOYEE-SALARY > MAX-SALARY
            MOVE EMPLOYEE-SALARY TO MAX-SALARY
      END-IF
   END-PERFORM.
   CLOSE IN-FILE.
   DISPLAY "The maximum salary is " MAX-SALARY.
   
   STOP RUN.