ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'INPUT.TXT'
    SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'.

DATA DIVISION.
FILE SECTION.

FD INPUT-FILE
    LABEL RECORD STANDARD
    BLOCK CONTAINS 0 RECORDS
    RECORDING MODE F.

01 INPUT-RECORD.
    02 INPUT-NAME PIC X(20).
    02 INPUT-AGE PIC 99.

FD OUTPUT-FILE
    LABEL RECORD STANDARD
    BLOCK CONTAINS 0 RECORDS
    RECORDING MODE F.

01 OUTPUT-RECORD.
    02 OUTPUT-NAME PIC X(20).
    02 OUTPUT-AGE PIC ZZ9.

WORKING-STORAGE SECTION.

01 COUNT PIC 99 VALUE 0.
01 TOTAL-AGE PIC 999 VALUE 0.

PROCEDURE DIVISION.
OPEN INPUT INPUT-FILE.
OPEN OUTPUT OUTPUT-FILE.

READ INPUT-FILE
AT END GO TO END-OF-FILE.
    ADD INPUT-AGE TO TOTAL-AGE.
    ADD 1 TO COUNT.
    MOVE INPUT-RECORD TO OUTPUT-RECORD.
    WRITE OUTPUT-RECORD.
    READ INPUT-FILE
    AT END MOVE TOTAL-AGE TO OUTPUT-AGE.

END-OF-FILE.
CLOSE INPUT-FILE.
CLOSE OUTPUT-FILE.

STOP RUN.