IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VAR-1 PIC 9(5) VALUE 100.
01 VAR-2 PIC 9(5) VALUE 200.
01 RESULT PIC 9(6) VALUE 0.
PROCEDURE DIVISION.
    MULTIPLY VAR-1 BY VAR-2 GIVING RESULT.
    DISPLAY 'The result is: ' RESULT.
    COMPUTE RESULT = RESULT + 50.
    IF RESULT > 500
       DISPLAY 'The final result is too high!'.
    ELSE
       DISPLAY 'The final result is: ' RESULT.
    END-IF.
STOP RUN.