IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROG.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 99 VALUE 10.   
01 NUM2 PIC 99 VALUE 20.
01 SUM PIC 99.

PROCEDURE DIVISION.
    COMPUTE SUM = NUM1 + NUM2.
    DISPLAY "The sum of " NUM1 " and " NUM2 " is " SUM ".".
STOP RUN.