IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO-WORLD.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 HELLO-MSG PIC X(12).
      PROCEDURE DIVISION.
      DISPLAY 'Hello, world!'.
      STOP RUN.
`
Output: