IDENTIFICATION DIVISION.       //Start of identification division
PROGRAM-ID. TEST-CODE.         //Program name
DATA DIVISION.                 // Start of data division
WORKING-STORAGE SECTION.
01 INCOME PIC 9(6)V99.         //Declaring a variable INCOME of type decimal with 6 digits before decimal point and 2 digits after
01 TAX AMOUNT PIC 9(6)V99.     // Declaring a variable TAX AMOUNT of type decimal with 6 digits before decimal point and 2 digits after
PROCEDURE DIVISION.           // Start of procedure division
MAIN-PARAGRAPH.
 DISPLAY "Please enter your monthly income:" //Prompting user for input
 ACCEPT INCOME                   // Accepting input from user and storing in variable INCOME
 PERFORM CALCULATE-TAX           // Calling PROCEDURE CALCULATE-TAX
 DISPLAY "Your monthly tax amount is " TAX AMOUNT // Displaying output to user with calculated tax amount
STOP RUN.                       // End of program execution
PROCEDURE CALCULATE-TAX.        // Subroutine to calculate tax amount
 MULTIPLY INCOME BY 0.1 GIVING TAX AMOUNT // Calculating tax amount as 10% of income and storing in variable TAX AMOUNT