IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 INPUT-X PIC S9(4)V9(2).
       01 INPUT-Y PIC S9(4)V9(2).
       01 RESULT PIC S9(4)V9(2).
       01 COUNTER PIC S9(4).
       
       PROCEDURE DIVISION.
       
       ADD X, Y GIVING RESULT.
       DISPLAY 'Result of addition is: ' RESULT.
       
       PERFORM UNTIL COUNTER = 10
           MULTIPLY RESULT BY 2 GIVING RESULT
           ADD 10 TO COUNTER
       END-PERFORM.
       
       DISPLAY 'Final Result: ' RESULT.
       
       STOP RUN.
       
       * This program takes two numerical inputs and adds them,
         then multiplies the result by 2 and adds 10 to the result
         for a total of 10 times, displaying the final result.*