Identification Division.           * start of program
Program-ID. Example.                * program name

Data Division.
Working-Storage Section.
77 Number-Of-Numbers Pic 9(2).      * variable for number of numbers to be entered
77 Maximum-Number Pic 9(3).          * variable for maximum number
77 Minimum-Number Pic 9(3).          * variable for minimum number

01 Numbers.
   05 Input-Number Occurs 25 Times.  * array to hold input numbers
      10 Number Pic 9(3).
   
Procedure Division.
Display "Enter the number of numbers to be entered: ".
Accept Number-Of-Numbers.
Display "Enter the maximum number: ".
Accept Maximum-Number.
Display "Enter the minimum number: ".
Accept Minimum-Number.

Perform Varying I from 1 by 1 until I > Number-Of-Numbers
  Display "Enter number ", I:2 " : ".
  Accept Numbers(I).
End-Perform.

Set Minimum-Number to Numbers(1).
Set Maximum-Number to Numbers(1).

Perform Varying J from 1 by 1 until J > Number-Of-Numbers
  If Numbers(J) > Maximum-Number
    Set Maximum-Number to Numbers(J)
  End-If.
  If Numbers(J) < Minimum-Number
    Set Minimum-Number to Numbers(J)
  End-If.
End-Perform.

Display "The maximum number is: " Maximum-Number.
Display "The minimum number is: " Minimum-Number.

Stop Run.                           * end of program