IDENTIFICATION DIVISION.
PROGRAM-ID. masterProgram.
 
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 counter       PIC 9(3) VALUE 1.
    01 result        PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
  PERFORM UNTIL counter > 1000
    COMPUTE result = result + counter
    ADD 1 TO counter
  END-PERFORM.

  DISPLAY "The final result is " result.
 
STOP RUN.