IDENTIFICATION DIVISION.
PROGRAM-ID. ExaminationGrades.
AUTHOR. John Smith.
*This program calculates the average grade of an examination*
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NumOfStudents PIC 9(2) VALUE 0.
01 TotalGrade PIC 9(5)V99 VALUE 0.
01 AverageGrade PIC 9(3)V99 VALUE 0.
01 ExamGrades OCCURS 50 TIMES INDEXED BY I.
02 ExamGrade PIC 9(2)V99.
01 Counter PIC 9(2) VALUE 1.

PROCEDURE DIVISION.
0000-Main.
    DISPLAY "Enter the number of students:".
    ACCEPT NumOfStudents.

    PERFORM 1000-GetGrades VARYING Counter FROM 1 BY 1 UNTIL Counter > NumOfStudents.

    PERFORM 2000-CalculateAverage.

    DISPLAY "The average grade of the examination is:".
    DISPLAY AverageGrade.

    STOP RUN.

1000-GetGrades.
    DISPLAY "Enter grade for student " Counter ":".
    ACCEPT ExamGrades(Counter).

2000-CalculateAverage.
    PERFORM 3000-SumGrades.
    COMPUTE AverageGrade = TotalGrade / NumOfStudents.

3000-SumGrades.
    SET I TO 1.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > NumOfStudents
        ADD ExamGrades(I) TO TotalGrade.