PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    DISPLAY "Current value of I: " I
    IF I NOT = 5 THEN
        IF I MOD 3 = 0 THEN
            PERFORM DIVIDE I BY 2 GIVING I
            DISPLAY "After dividing by 2, I is now: " I
        ELSE
            PERFORM MULTIPLY I BY 3 GIVING I
            DISPLAY "After multiplying by 3, I is now: " I
        END-IF
    ELSE
        DISPLAY "Skipping 5"
    END-IF
END-PERFORM.