IDENTIFICATION DIVISION.
       PROGRAM-ID. Print-Multiplication-Table.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT Input-File ASSIGN TO "input.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
        FD  Input-File.
        01  Input-Line PIC X(10).

       WORKING-STORAGE SECTION.
        01  Num-Table PIC 9(3) OCCURS 10 TIMES.
        01  Result PIC 9(4).
        01  Multiplier PIC 9 VALUE 1.

       PROCEDURE DIVISION.
       Main-Loop.
           READ Input-File INTO Input-Line
               NOT AT END
                   PERFORM Process-Line
           END-READ
           DISPLAY "     Multiplication Table     "
           DISPLAY "      From 1 to 10      "
           MOVE 1 TO Multiplier
           PERFORM Calculate-Multiplication
           DISPLAY "-----------------------------"
           DISPLAY "        End of Table         "
           STOP RUN.

       Process-Line.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
               MOVE Input-Line TO Num-Table(I)
           END-PERFORM.

       Calculate-Multiplication SECTION.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
               DISPLAY "                  "
               PERFORM VARYING J FROM 1 BY 1 UNTIL J > 10
                   MULTIPLY Num-Table(J) BY Multiplier
                       GIVING Result
                   DISPLAY Num-Table(J) " * " Multiplier " = " Result
               END-PERFORM
               ADD 1 TO Multiplier
           END-PERFORM