IDENTIFICATION DIVISION.
PROGRAM-ID. TOP-EMPLOYEE-REPORT.
PROCEDURE DIVISION.
DISPLAY "TOP EMPLOYEE REPORT".
DISPLAY "ENTER NUMBER OF EMPLOYEES:".
ACCEPT NUM-OF-EMPLOYEES.
DISPLAY "ENTER EMPLOYEE ID, NAME, AND SALARY FOR EACH EMPLOYEE:".

PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > NUM-OF-EMPLOYEES
    DISPLAY "EMPLOYEE " COUNT ":".
    ACCEPT EMPLOYEE-ID(COUNT).
    ACCEPT EMPLOYEE-NAME(COUNT).
    ACCEPT EMPLOYEE-SALARY(COUNT).
END-PERFORM.

DISPLAY "GENERATING TOP EMPLOYEE REPORT".

MOVE 0 TO MAX-SALARY.
MOVE 0 TO INDEX.
PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > NUM-OF-EMPLOYEES
    IF EMPLOYEE-SALARY(COUNT) > MAX-SALARY
        MOVE EMPLOYEE-SALARY(COUNT) TO MAX-SALARY.
        MOVE COUNT TO INDEX.
    END-IF.
END-PERFORM.

DISPLAY "TOP EMPLOYEE: " EMPLOYEE-NAME(INDEX) ", EMPLOYEE ID: " EMPLOYEE-ID(INDEX) ", SALARY: " MAX-SALARY.

STOP RUN.