IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-NUM1 PIC 9(5).
01 INPUT-NUM2 PIC 9(5).
01 SUM PIC 9(5).
01 ERROR-CODE PIC 9(3).

PROCEDURE DIVISION.
PERFORM BEGIN-PROGRAM VARYING ERROR-CODE FROM 1
    BY 1 UNTIL ERROR-CODE = 3.
    
BEGIN-PROGRAM.
    DISPLAY "Please enter a number: ".
    ACCEPT INPUT-NUM1.
    DISPLAY "Please enter another number: ".
    ACCEPT INPUT-NUM2.

    COMPUTE SUM = INPUT-NUM1 + INPUT-NUM2.

    IF SUM > 99999 THEN
        ADD 1 TO ERROR-CODE
    ELSE
        DISPLAY "The sum of " INPUT-NUM1 " and " INPUT-NUM2 " is " SUM.

END PROGRAM.