IDENTIFICATION DIVISION. 
PROGRAM-ID. HELLO-WORLD. 

* This program displays the message 'Hello, World!' to the user.
* Usage:
* CALL 'HELLO-WORLD' USING MESSAGE.

DATA DIVISION. 
WORKING-STORAGE SECTION. 

* Input parameters
01 MESSAGE PIC X(14).

PROCEDURE DIVISION USING MESSAGE. 

* Display the message
DISPLAY MESSAGE 

STOP RUN.