IDENTIFICATION DIVISION.                        * Begin identification division
PROGRAM-ID. MY-PROGRAM.                         * Declare program name
DATA DIVISION.                                  * Begin data division
WORKING-STORAGE SECTION.                        * Declare working storage section
01 NUM-ARRAY.                                   * Declare array for storing numbers
   05 NUM-LENGTH PIC 9(2) VALUE 10.              * Define length of array
   05 NUM-ELEMENTS OCCURS 0 TO 9 TIMES           * Declare array elements
      DEPENDING ON NUM-LENGTH.                   * Depending on the length of array
   10 NUM PIC 9(3).                             * Define array element as number
01 RESULT PIC 9(4).                             * Declare variable for storing result

PROCEDURE DIVISION.                              * Begin procedure division
MAIN-PROCEDURE.                                  * Declare main procedure
    DISPLAY "Enter 10 numbers:"                  * Prompt user to enter numbers
    ACCEPT NUM-ARRAY FROM CONSOLE.               * Accept input from user and store in array    
    PERFORM VARYING I FROM 1 BY 1                * Loop through array elements
        UNTIL I > NUM-LENGTH                     * Until array length is reached
        COMPUTE RESULT = RESULT + NUM(I)**2      * Square each element and add to result
    END-PERFORM.                                 * End loop
    DISPLAY "The result is:" RESULT               * Display final result
    STOP RUN.                                     * End program
END PROGRAM MY-PROGRAM.                          * End program