IDENTIFICATION DIVISION.
   PROGRAM-ID. CALCULATE-AREA.

   *> This program calculates the area of a rectangle

   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 RECTANGLE.
      02 LENGTH        PIC 9(3).
      02 WIDTH         PIC 9(3).
      02 AREA          PIC 9(5)V99.

   PROCEDURE DIVISION.
   MAIN-ROUTINE.

       *> Accept user input for length and width
       DISPLAY "Enter length: "
       ACCEPT LENGTH
       DISPLAY "Enter width: "
       ACCEPT WIDTH

       *> Perform calculation to find area
       MULTIPLY LENGTH BY WIDTH GIVING AREA
       DISPLAY "The area of the rectangle is " AREA

       STOP RUN.