IDENTIFICATION	DIVISION
PROGRAM-ID.	SAMPLE-PROGRAM.
AUTHOR.		John Doe.
ENVIRONMENT	DIVISION.
CONFIGURATION	SECTION.
INPUT-OUTPUT	SECTION.
FILE-CONTROL.
SELECT SAMPLE-FILE ASSIGN TO 'SAMPLE.DAT'.
DAT-START-REC. ORGANIZATION IS SEQUENTIAL.
DATA	DIVISION.
FILE	SECTION.
FD SAMPLE-FILE RECORDING MODE IS F.
01 SAMPLE-RECORD.
05 SAMPLE-CODE PIC A(6).
05 SAMPLE-NAME PIC X(20).
05 SAMPLE-AGE PIC 9(3).
05 SAMPLE-ADDRESS PIC X(30).
WORKING-STORAGE   SECTION.
77 SAMPLE-COUNTER PIC 9(3) VALUE 1.
77 SAMPLE-TOTAL PIC 9(7) VALUE ZERO.
77 SAMPLE-AVERAGE PIC 9(7)V99.
77 SAMPLE-MAXIMUM PIC 9(3) VALUE ZERO.
77 SAMPLE-MINIMUM PIC 9(3) VALUE 999.
PROCEDURE	DIVISION.
MAIN-PROCESS.
OPEN INPUT SAMPLE-FILE.
READ SAMPLE-FILE AT END MOVE 'NO' TO EOF-SWITCH.
PERFORM UNTIL EOF-SWITCH EQUALS 'NO'
	IF SAMPLE-COUNTER GREATER THAN 50
		DISPLAY 'Cannot process more than 50 records'.
		MOVE 'YES' TO EOF-SWITCH.
	ELSE
		ADD SAMPLE-AGE TO SAMPLE-TOTAL.
		IF SAMPLE-AGE GREATER THAN SAMPLE-MAXIMUM
			MOVE SAMPLE-AGE TO SAMPLE-MAXIMUM.
		END-IF.
		IF SAMPLE-AGE LESS THAN SAMPLE-MINIMUM
			MOVE SAMPLE-AGE TO SAMPLE-MINIMUM.
		END-IF.
		DISPLAY 'Code: ' SAMPLE-CODE.
		DISPLAY 'Name: ' SAMPLE-NAME.
		DISPLAY 'Age: ' SAMPLE-AGE.
		DISPLAY 'Address: ' SAMPLE-ADDRESS.
		READ SAMPLE-FILE AT END MOVE 'NO' TO EOF-SWITCH.
	END-PERFORM.
DIVIDE SAMPLE-TOTAL BY SAMPLE-COUNTER GIVING SAMPLE-AVERAGE.
DISPLAY 'Average age is: ' SAMPLE-AVERAGE.
DISPLAY 'Maximum age is: ' SAMPLE-MAXIMUM.
DISPLAY 'Minimum age is: ' SAMPLE-MINIMUM.
CLOSE SAMPLE-FILE.
STOP RUN.