IDENTIFICATION DIVISION.
PROGRAM-ID. DEBUG-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM-A PIC 9(6) VALUE 123456.
77 NUM-B PIC 9(6) VALUE 654321.

PROCEDURE DIVISION.
MAIN-PROC.
    DISPLAY 'Number A is ' NUM-A
    DISPLAY 'Number B is ' NUM-B
    COMPUTE NUM-C = NUM-A + NUM-B
    DISPLAY 'The sum is ' NUM-C
    IF NUM-A > NUM-B
        DISPLAY 'Number A is greater than Number B'
    ELSE IF NUM-A < NUM-B
        DISPLAY 'Number A is less than Number B'
    ELSE
        DISPLAY 'Number A is equal to Number B'
    END-IF.

    STOP RUN.
END PROGRAM DEBUG-PROGRAM.