01  PS-INFO.
           05  PS-STORE-INFO.
               10  PS-STORE-ID             PIC X(4).
               10  PS-STORE-NAME           PIC X(20).
               10  PS-STORE-ADDRESS.
                   15  PS-STORE-STREET     PIC X(20).
                   15  PS-STORE-CITY       PIC X(15).
                   15  PS-STORE-STATE      PIC XX.
                   15  PS-STORE-ZIP        PIC 9(5).
           05  PS-PRODUCTS OCCURS 10 TIMES.
               10  PS-PRODUCT-ID           PIC X(6).
               10  PS-PRODUCT-NAME         PIC X(25).
               10  PS-PRODUCT-DESCRIPTION  PIC X(50).
       01  PS-SUMMARY.
           05  PS-TOTAL-STORES              PIC 99.
           05  PS-TOTAL-PRODUCTS            PIC 999.
       
       PROCEDURE DIVISION.
       000-MAIN.
           PERFORM 100-INITIALIZE.
           PERFORM 200-READ-FILE.
           PERFORM 300-PROCESS-PRODUCTS.
           PERFORM 400-PRINT-SUMMARY.
           STOP RUN.
       
       100-INITIALIZE.
           MOVE 0 TO PS-TOTAL-STORES
           MOVE 0 TO PS-TOTAL-PRODUCTS.
       
       200-READ-FILE.
           OPEN INPUT PS-INFO-FILE.
           READ PS-INFO-FILE
               AT END
                   MOVE "NO RECORDS FOUND" TO PS-ERROR-MSG
                   GO TO 400-PRINT-SUMMARY.
           PERFORM 210-PROCESS-STORES
           CLOSE PS-INFO-FILE.
       
       210-PROCESS-STORES.
           PERFORM UNTIL PS-EOF
           READ PS-INFO-FILE
               AT END
                   MOVE "END OF FILE REACHED" TO PS-ERROR-MSG
                   MOVE 1 TO PS-EOF
           END-READ.
           IF NOT PS-EOF
               ADD 1 TO PS-TOTAL-STORES.
               PERFORM 220-PROCESS-PRODUCTS.
           END-IF.
       
       220-PROCESS-PRODUCTS.
           PERFORM UNTIL PS-EOF
           READ PS-INFO-FILE
               AT END
                   MOVE "END OF FILE REACHED" TO PS-ERROR-MSG
                   MOVE 1 TO PS-EOF
           END-READ.
           IF NOT PS-EOF
               PERFORM 300-PROCESS-PRODUCTS
               ADD 1 TO PS-TOTAL-PRODUCTS.
           END-IF.
       MEMBER-ID
       400-PRINT-SUMMARY.
           DISPLAY "TOTAL STORES FOUND: " PS-TOTAL-STORES.
           DISPLAY "TOTAL PRODUCTS FOUND: " PS-TOTAL-PRODUCTS.
       999-EXIT.