IDENTIFICATION DIVISION.
       PROGRAM-ID. complex-program.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
           PERFORM VARYING OUTPUT-INDEX FROM 1 BY 1
           UNTIL OUTPUT-INDEX > 10
           DISPLAY "Complex Code" OUTPUT-INDEX
           COMPUTE COMPLEX-NUM = 2 * 5 * OUTPUT-INDEX
           END-PERFORM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OUTPUT-INDEX PIC 9(2) VALUE 1.
       SCREEN-CODE SECTION.
       01 COMPLEX-NUM PIC S9(9) USAGE COMP-3.
       LINKAGE SECTION.
       01 POINT-VALUE.
           02 FIRST-NUM PIC 9(5) COMP.
           02 SECOND-NUM PIC 9(5) COMP.
       PROCEDURE DIVISION USING POINT-VALUE.
       MAIN-PARA.
           PERFORM SUB-PARA THRU SUB-PARA-EXIT.
           MOVE POINT-VALUE TO FIRST-NUM, SECOND-NUM.
           IF FIRST-NUM GREATER THAN SECOND-NUM THEN
               DISPLAY "First number is greater:" FIRST-NUM INSPECT FIRST-NUM CONVERTING "AA" TO "ZZ".
           ELSE
               DISPLAY "Second number is greater:" SECOND-NUM INSPECT SECOND-NUM TALLYING AREAS WITH "ABC" GIVING AREA-CTR.
       SUB-PARA.
           DISPLAY "Entering sub-paragraph.".
       SUB-PARA-EXIT.
           DISPLAY "Exiting sub-paragraph.".
           GOBACK.
       END PROGRAM complex-program.