IDENTIFICATION DIVISION.
     
      PROGRAM-ID. CALCULATOR.
     
      ENVIRONMENT DIVISION.
     
      DATA DIVISION.
     
      WORKING-STORAGE SECTION.
     
      01 NUM1 PIC 9(5).
      01 NUM2 PIC 9(5).
      01 OPERATOR PIC A(1).
      01 RESULT PIC 9(6).
     
      PROCEDURE DIVISION.
     
      DISPLAY "Enter the first number: ".
      ACCEPT NUM1.
      DISPLAY "Enter the second number: ".
      ACCEPT NUM2.
      DISPLAY "Enter the operation (+,-,*,/): ".
      ACCEPT OPERATOR.

      EVALUATE OPERATOR
      	WHEN "+"
      		COMPUTE RESULT = NUM1 + NUM2
      	WHEN "-"
      		COMPUTE RESULT = NUM1 - NUM2
      	WHEN "*"
      		COMPUTE RESULT = NUM1 * NUM2
      	WHEN "/"
      		COMPUTE RESULT = NUM1 / NUM2
      	END-EVALUATE.
     
      DISPLAY "The result is: " RESULT.
     
      STOP RUN.
     
      END PROGRAM CALCULATOR.