IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NUM1-FILE ASSIGN TO 'INPUT.TXT'.
           SELECT NUM2-FILE ASSIGN TO 'OUTPUT.TXT'.
       DATA DIVISION.
       FILE SECTION.
       FD NUM1-FILE.
       01 NUM1 PIC 9(2).
       FD NUM2-FILE.
       01 NUM2 PIC 9(2).
       WORKING-STORAGE SECTION.
       01 TOTAL PIC 9(3).
       LINKAGE SECTION.
       01 NUM1-LINK PIC 9(2).
       01 NUM2-LINK PIC 9(2).
       PROCEDURE DIVISION.
       OPEN INPUT NUM1-FILE.
       OPEN OUTPUT NUM2-FILE.
       READ NUM1-FILE INTO NUM1-LINK.
       SET TOTAL TO 0.
       PERFORM UNTIL NUM1-FILE = 0
           SET NUM2-LINK TO NUM1-LINK
           ADD NUM2-LINK TO TOTAL
           READ NUM1-FILE INTO NUM1-LINK.
       END-PERFORM.
       WRITE TOTAL TO NUM2-FILE.
       CLOSE NUM1-FILE.
       CLOSE NUM2-FILE.
       STOP RUN.