IDENTIFICATION DIVISION.
      PROGRAM-ID. GENERATE-ARRAY.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 ARRAY-SIZE PIC 9(5) VALUE 10.
      01 ARRAY OCCURS 0 TO 99 DEPENDING ON ARRAY-SIZE.
         05 ARRAY-VALUE PIC X(10) VALUE 'COBOL'.
      01 INDEX PIC 9(5).
      PROCEDURE DIVISION.
      MAIN-LOOP.
           PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > ARRAY-SIZE
              MOVE 'COBOL' TO ARRAY(INDEX)
           END-PERFORM.
           DISPLAY 'Generated Array: '.
           PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > ARRAY-SIZE
              DISPLAY ARRAY(INDEX)
           END-PERFORM.
      STOP RUN.