IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1 PIC S9(3)V99.
       02  NUM2 PIC S9(3)V99.
       03  RESULT PIC S9(3)V99.

       PROCEDURE DIVISION.
       PERFORM CALCULATION
       DISPLAY "Result: " RESULT
       STOP RUN.

       CALCULATION.
           MULTIPLY NUM1 BY NUM2
           GIVING RESULT.
           ADD 5 TO RESULT
           ADD 10 TO RESULT 
           SUBTRACT NUM1 FROM RESULT
           SUBTRACT NUM2 FROM RESULT.