IDENTIFICATION DIVISION.
      PROGRAM-ID. MAIN-PROGRAM.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01  NUM1                PIC 9(3).
      01  NUM2                PIC 9(3).
      01  RESULT              PIC 9(4).
      PROCEDURE DIVISION.
      MAIN-PROCEDURE.
          DISPLAY "Enter the first number: "
          ACCEPT NUM1
          DISPLAY "Enter the second number: "
          ACCEPT NUM2
          MULTIPLY NUM1 BY NUM2 GIVING RESULT
          DISPLAY "The result is: ", RESULT
          STOP RUN.
      END PROGRAM MAIN-PROGRAM.