Identification Division.
Program-ID. MYPROGRAM.

Data Division.
Working-Storage Section.
77 VALUE-ONE PIC 9(4) VALUE 100.
77 VALUE-TWO PIC 9(4) VALUE 200.
77 RESULT PIC 9(4).

Procedure Division.
MULTIPLY VALUE-ONE BY VALUE-TWO GIVING RESULT.
DISPLAY 'The result of multiplying VALUE-ONE and VALUE-TWO is: ' RESULT.

If RESULT EQUALS 20000
    DISPLAY 'The result is equal to the maximum value.'
Else If RESULT GREATER THAN 20000
    DISPLAY 'The result is greater than the maximum value.'
End-If.

Quit Program.