IDENTIFICATION DIVISION.
PROGRAM-ID. PRINT-SALARY.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 EMPLOYEE-COUNT PIC 9(5).
  01 SALARY-TABLE.
    02 SALARY OCCURS 100 TIMES.
       03 EMP-NO PIC 9(5).
       03 EMP-SALARY PIC 9(10).

PROCEDURE DIVISION.
MAIN.
  DISPLAY "ENTER NUMBER OF EMPLOYEES: ".
  ACCEPT EMPLOYEE-COUNT.
  PERFORM INIT-SALARY-TABLE.
  PERFORM GET-EMPLOYEE-SALARY
    VARYING EMP-INDEX FROM 1 BY 1
    UNTIL EMP-INDEX > EMPLOYEE-COUNT.
  DISPLAY "EMPLOYEE NO: " EMP-NO(EMP-INDEX).
  DISPLAY "SALARY: " EMP-SALARY(EMP-INDEX).
END MAIN.

INIT-SALARY-TABLE.
  MOVE 0 TO EMP-NO.
  PERFORM VARY-EMP-SALARY(100 TIMES)
  MOVE SALARY-TABLE(100) TO EMP-NO(100).

GET-EMPLOYEE-SALARY.
  DISPLAY "ENTER EMPLOYEE NO: ".
  ACCEPT EMP-NO(EMP-INDEX).
  DISPLAY "ENTER SALARY: ".
  ACCEPT EMP-SALARY(EMP-INDEX).

VARY-EMP-SALARY.
  MOVE 1001 TO EMP-SALARY.
  ADD 1 TO EMP-NO.

END PROGRAM PRINT-SALARY.