IDENTIFICATION DIVISION.
PROGRAM-ID. MY-COBOL-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VALUE-1 PIC 9(3).
01 VALUE-2 PIC 9(3).
01 RESULT PIC 9(3).
PROCEDURE DIVISION.
    DISPLAY "Enter first value:".
    ACCEPT VALUE-1.
    DISPLAY "Enter second value:".
    ACCEPT VALUE-2.
    IF VALUE-1 > VALUE-2
        COMPUTE RESULT = VALUE-1 + VALUE-2
    ELSE
        COMPUTE RESULT = VALUE-1 - VALUE-2
    END-IF.
    DISPLAY "Result is: ", RESULT.
STOP RUN.