IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO DISK "input.txt".

DATA DIVISION.
FILE SECTION.
FD IN-FILE
    LABEL RECORD IS STANDARD 
    RECORDING MODE IS F
    BLOCK CONTAINS 0 RECORDS
    DATA RECORD IS IN-REC1.

01 IN-REC1.
    05 IN-FIRST-PART PIC X(10).
    88 EOF VALUE HIGH-VALUES.
    05 IN-SECOND-PART PIC 9(4).
    05 IN-THIRD-PART PIC A(8).

WORKING-STORAGE SECTION.
01 WS-OUTPUT-STRING PIC X(22).

PROCEDURE DIVISION.
MAIN-PROC.
    OPEN INPUT IN-FILE.
    PERFORM READ-PROC THRU READ-END UNTIL EOF.
    CLOSE IN-FILE.
    DISPLAY WS-OUTPUT-STRING.
    STOP RUN.

READ-PROC.
    READ IN-FILE INTO IN-REC1.
    IF EOF
        DISPLAY "END OF FILE" 
    ELSE
        PERFORM PROCESS-PROC.
    
PROCESS-PROC.
    COMPUTE WS-OUTPUT-STRING = IN-FIRST-PART(1:5) 
                                + IN-SECOND-PART 
                                + IN-THIRD-PART(1:3).
    DISPLAY "OUTPUT STRING: " WS-OUTPUT-STRING.

READ-END.
    EXIT.

END PROGRAM EXAMPLE.