IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALES.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       1 WS-BEER-SALES          PIC 9(7)V99.
       1 WS-WINE-SALES          PIC 9(7)V99.
       1 WS-LIQUOR-SALES        PIC 9(7)V99.
       1 WS-TOTAL-SALES         PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PROCESS.
               DISPLAY "ENTER BEER SALES:".
               ACCEPT WS-BEER-SALES.
               DISPLAY "ENTER WINE SALES:".
               ACCEPT WS-WINE-SALES.
               DISPLAY "ENTER LIQUOR SALES:".
               ACCEPT WS-LIQUOR-SALES.
               COMPUTE WS-TOTAL-SALES = WS-BEER-SALES + WS-WINE-SALES + WS-LIQUOR-SALES.
               DISPLAY "TOTAL SALES IS", WS-TOTAL-SALES.
       END PROGRAM CALCULATE-SALES.