IDENTIFICATION DIVISION.
PROGRAM-ID. PHONE-DIRECTORY.
DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 RECORD-IN.
   05 NAME-IN   PIC X(20).
   05 PHONE-IN  PIC X(10).
FD OUT-FILE.
01 RECORD-OUT.
   05 NAME-OUT  PIC X(20).
   05 FILLER   PIC X(10).
   05 PHONE-OUT PIC X(15).
WORKING-STORAGE SECTION.
01 PHONE-NUMBER PIC X(10).
01 SEARCH-NAME PIC X(20).
01 OPTION PIC X(1).
01 MORE-ENTRIES PIC X(3) VALUE 'YES'.
PROCEDURE DIVISION.
MAIN-PARAGRAPH.
   PERFORM DISPLAY-MENU.
   PERFORM GET-USER-INPUT.
   PERFORM SEARCH-PHONE-BOOK UNTIL MORE-ENTRIES = 'NO '.
   PERFORM CLOSE-FILES.
DISPLAY-MENU.
   DISPLAY 'PHONE DIRECTORY'.
   DISPLAY '1. SEARCH BY NAME.'
   DISPLAY '2. SEARCH BY PHONE NUMBER.'
   DISPLAY '3. EXIT.'
GET-USER-INPUT.
   DISPLAY 'ENTER YOUR SELECTON: ' WITH NO ADVANCING.
   ACCEPT OPTION.
   IF OPTION = ' 1 ' PERFORM GET-NAME-TO-SEARCH.
   IF OPTION = ' 2 ' PERFORM GET-PHONE-SEARCH.
   IF OPTION = ' 3 ' MOVE 'NO' TO MORE-ENTRIES.
GET-NAME-TO-SEARCH.
   DISPLAY 'ENTER NAME TO SEARCH: ' WITH NO ADVANCING.
   ACCEPT SEARCH-NAME.
GET-PHONE-SEARCH.
   DISPLAY 'ENTER PHONE NUMBER TO SEARCH: ' WITH NO ADVANCING.
   ACCEPT PHONE-NUMBER.
SEARCH-PHONE-BOOK.
   READ IN-FILE AT END MOVE 'NO' TO MORE-ENTRIES.
   IF MORE-ENTRIES = 'YES' PERFORM CHECK-RECORD.
CHECK-RECORD.
   IF NAME-IN = SEARCH-NAME OR PHONE-IN = PHONE-NUMBER
      DISPLAY 'NAME: ' NAME-IN.
      DISPLAY 'PHONE: ' PHONE-IN.
   IF MORE-ENTRIES = 'YES ' DISPLAY 'NO MATCHES FOUND.'.
CLOSE-FILES.
   CLOSE IN-FILE.
   CLOSE OUT-FILE.
STOP RUN.