IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COPYBOOK1.
       COPY COPYBOOK2.
       01  NAME-VARIABLES.
           05  FIRST-NAME         PIC X(20) VALUE SPACES.
           05  LAST-NAME          PIC X(20) VALUE SPACES.
           05  FULL-NAME          PIC X(40) VALUE SPACES.
       PROCEDURE DIVISION.
           PERFORM GET-USER-INPUT.
           PERFORM CONCATENATE-NAME.
           DISPLAY 'Your full name is ' FULL-NAME.
           STOP RUN.
       GET-USER-INPUT.
           DISPLAY 'Enter your first name: '.
           ACCEPT FIRST-NAME.
           DISPLAY 'Enter your last name: '.
           ACCEPT LAST-NAME.
       CONCATENATE-NAME.
           STRING FIRST-NAME DELIMITED BY SPACE 
           LAST-NAME INTO FULL-NAME.