IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 INPUT-DATA.
          05 NUM1        PIC S9(4)V9(2).
          05 NUM2        PIC S9(4)V9(2).
          05 RESULT      PIC S999V99.
          05 DISPLAY-MSG PIC X(50) VALUE 'The result of division is: '.

       PROCEDURE DIVISION.
       ACCEPT NUM1 FROM CONSOLE.
       ACCEPT NUM2 FROM CONSOLE.
       PERFORM DIVIDE-VALUES
       DISPLAY DISPLAY-MSG UPON CONSOLE
       MOVE RESULT TO DISPLAY-MSG
       GOBACK.

       DIVIDE-VALUES.
           DIVIDE NUM1 BY NUM2 GIVING RESULT.