IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
AUTHOR. JOHN SMITH.
DATE-WRITTEN. 01/01/2021.

ENVIRONMENT DIVISION.
CHOOSING INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'input.txt'.
    SELECT OUTPUT-FILE ASSIGN TO 'output.txt'.
    SELECT TEMP-FILE ASSIGN TO 'temp.tmp'.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 RECORD-IN
    05 FIELD1 PIC X(10).
    05 FIELD2 PIC X(20).
    05 FIELD3 PIC X(30).

SD OUTPUT-FILE.
01 RECORD-OUT
    05 FIELD1 PIC X(10).
    05 FIELD2 PIC X(20).
    05 FIELD3 PIC X(30).

WORKING-STORAGE SECTION.
01 TEMP-RECORD PIC X(60).

PROCEDURE DIVISION.
COPY "SORT" REPLACING ==CODE FOR OPTION2== BY ==INPUT-FILE== AT END OF INPUT-FILE.
OPEN INPUT INPUT-FILE.
OPEN OUTPUT OUTPUT-FILE.
OPEN EXTEND TEMP-FILE.
READ INPUT-FILE INTO RECORD-IN.
PERFORM UNTIL RECORD-IN = "END"
    MOVE RECORD-IN TO TEMP-RECORD.
    REWRITE TEMP-RECORD TO TEMP-FILE.
    READ INPUT-FILE INTO RECORD-IN.
END-PERFORM.
CLOSE TEMP-FILE.
OPEN INPUT TEMP-FILE.
READ TEMP-FILE INTO TEMP-RECORD.
PERFORM UNTIL RECORD-OUT = "END"
    MOVE TEMP-RECORD TO RECORD-OUT.
    WRITE OUTPUT-FILE FROM RECORD-OUT.
    READ TEMP-FILE INTO TEMP-RECORD.
END-PERFORM.
CLOSE INPUT-FILE.
CLOSE OUTPUT-FILE.

END PROGRAM SAMPLE-PROGRAM.