WORKING-STORAGE SECTION.
       01 COUNTER1 PIC 9(3) VALUE 0.
           88 AT-LIMIT VALUE 300.
       01 COUNTER2 PIC 9(3) VALUE 100.
           88 BELOW-LIMIT VALUE 50.
           
       PROCEDURE DIVISION.
       PERFORM UNTIL AT-LIMIT
           ADD 5 TO COUNTER1.
           MULTIPLY 2 BY COUNTER2 GIVING COUNTER2.
           DISPLAY "COUNTER1: ", COUNTER1.
           DISPLAY "COUNTER2: ", COUNTER2.
       END-PERFORM.