IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO DISK
                  FILE STATUS IS FILE-STATUS.
           SELECT OUT-FILE ASSIGN TO PRINTER
                  FILE STATUS IS PRINTER-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE
          LABEL RECORDS ARE STANDARD
          RECORD CONTAINS 80 CHARACTERS
          DATA RECORD IS IN-LINE.
       01 IN-LINE PIC X(80).
       FD OUT-FILE
          LABEL RECORDS ARE OMITTED
          RECORD CONTAINS 50 CHARACTERS
          DATA RECORD IS OUT-LINE.
       01 OUT-LINE PIC X(50).
       WORKING-STORAGE SECTION.
       01 FILE-STATUS PIC XX VALUE '00'.
       01 PRINTER-STATUS PIC XX VALUE '00'.
       01 EOF-FLAG PIC X VALUE 'N'.
       01 PAGE-COUNT PIC 99 VALUE ZERO.
       01 LINE-COUNT PIC 99 VALUE ZERO.
       01 HEADER-FLAG PIC X VALUE 'Y'.
       01 PAGE-HEADER PIC X(50) VALUE 'COBOL REPORT'.
       01 FIRST-NAME PIC X(20) VALUE SPACES.
       01 LAST-NAME PIC X(20) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
       OPEN INPUT IN-FILE.
       OPEN OUTPUT OUT-FILE.
       PERFORM READ-FILE UNTIL EOF-FLAG = 'Y'.
       PERFORM WRITE-FILE.
       CLOSE IN-FILE.
       CLOSE OUT-FILE.
       STOP RUN.
       READ-FILE.
       READ IN-FILE
          AT END MOVE 'Y' TO EOF-FLAG
          NOT AT END MOVE IN-LINE TO OUT-LINE.
       WRITE-FILE.
       IF HEADER-FLAG = 'Y'
          MOVE PAGE-HEADER TO OUT-LINE
          WRITE OUT-RECORD FROM OUT-LINE.
       MOVE IN-LINE(1:20) TO FIRST-NAME
       MOVE IN-LINE(21:20) TO LAST-NAME
       ADD 1 TO LINE-COUNT
       IF LINE-COUNT = 50
          MOVE ZERO TO LINE-COUNT
          ADD 1 TO PAGE-COUNT
          MOVE 'Y' TO HEADER-FLAG.
       MOVE FIRST-NAME TO OUT-LINE
       MOVE LAST-NAME TO OUT-LINE(22:20)
       WRITE OUT-RECORD FROM OUT-LINE.