IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NUMBER PIC 9(3).
       01 SECOND-NUMBER PIC 9(3).
       01 RESULT PIC 9(4).
       PROCEDURE DIVISION.
       DISPLAY "Enter first number: ".
       ACCEPT FIRST-NUMBER.
       DISPLAY "Enter second number: ".
       ACCEPT SECOND-NUMBER.
       COMPUTE RESULT = FIRST-NUMBER + SECOND-NUMBER.
       DISPLAY "The sum of " FIRST-NUMBER " and " SECOND-NUMBER " is: " RESULT.
       STOP RUN.