1 PROCEDURE DIVISION.
2 PROGRAM-BEGIN.
3     DISPLAY 'Hello, World'.
4     SET NUM-ONE TO 1.
5     SET NUM-TWO TO 2.
6     ADD NUM-ONE TO NUM-TWO GIVING RESULT-ONE.
7     MULTIPLY NUM-ONE BY NUM-TWO GIVING RESULT-TWO.
8     IF RESULT-TWO GREATER THAN RESULT-ONE
9         DISPLAY 'Result Two is greater than Result One'.
10    ELSE
11        DISPLAY 'Result One is greater than or equal to Result Two'.
12    END-IF.
13 PROGRAM-END.
14 DATA DIVISION.
15 WORKING-STORAGE SECTION.
16 01 NUM-ONE PIC 9(3).
17 01 NUM-TWO PIC 9(3).
18 01 RESULT-ONE PIC 9(3).
19 01 RESULT-TWO PIC 9(3).
20 PROCEDURE DIVISION.
21 PROGRAM-BEGIN.
22    DISPLAY 'Enter a number: '.
23    ACCEPT NUM-ONE.
24    IF NUM-ONE IS NUMERIC
25        DISPLAY 'You entered: ' NUM-ONE
26    ELSE
27        DISPLAY 'Invalid input!'.
28    END-IF.
29 PROGRAM-END.