Identification Division.                                            // This division contains the name and other identifying details of the program
 Program-ID. LOAN-PROCESSING.                                         // Name of the program
 Author. John Smith.                                                  // Author of the program
 Date-Written. 01/01/2021.                                            // Date of program creation
 Date-Compiled. 01/15/2021.                                           // Date of program compilation

 Environment Division.                                                // Includes information about the computer and operating system being used
 Configuration Section.
 Special-Names.                                                       // Used for defining special characters
     Decimal-Point is Comma.                                          // Sets the decimal point to a comma (instead of a period)
     Alphabet is Standard-ASCII.
     Class-Control.                                                  // Specifies characters to be replaced or removed
         * Replace Underscores with Spaces.                           // Replaces underscore characters with spaces
 Data Division.                                                       // Declares all data items used in the program
 File Section.
 FD LOAN-FILE                                                            
     RECORDING MODE IS F.
 01 LOAN-RECORD.
     02 LOAN-NO PIC 9(4).
     02 CUSTOMER-NAME PIC X(20).
     02 LOAN-AMOUNT PIC 9(6)V99.
     02 REPAY-DATE.
         03 LOAN-DAY PIC 99.
         03 LOAN-MONTH PIC 99.
         03 LOAN-YEAR PIC 99.
 Working-Storage Section.                                             // Used for declaring temporary variables
 01 TOTAL-AMOUNT PIC 9(10)V99 VALUE 0.                                 // Initialized total amount variable
 Procedure Division.
     PERFORM ACCEPT-INPUT UNTIL LOAN-NO = 0.                          // Loops until user enters 0 for loan number
     PERFORM PROCESS-LOAN.                                            // Processes loan record
     IF TOTAL-AMOUNT > 10000.                                         // Checks if total amount exceeds 10000
         DISPLAY "WARNING: Total loan amount exceeded!".
     END-IF.
     STOP RUN.                                                        // Ends program execution
 ACCEPT-INPUT.
     DISPLAY "Enter loan number (0 to exit): ".
     ACCEPT LOAN-NO.
     IF LOAN-NO <> 0.                                                 // Checks if loan number is not zero
         DISPLAY "Enter customer name: ".
         ACCEPT CUSTOMER-NAME.
         DISPLAY "Enter loan amount: ".
         ACCEPT LOAN-AMOUNT.
         DISPLAY "Enter repayment date (DDMMYY): ".
         ACCEPT LOAN-DAY.
         ACCEPT LOAN-MONTH.
         ACCEPT LOAN-YEAR.
     END-IF.
 PROCESS-LOAN.
     ADD LOAN-AMOUNT TO TOTAL-AMOUNT.                                  // Adds loan amount to total amount
     DISPLAY "Loan processed for customer " CUSTOMER-NAME "with amount $" LOAN-AMOUNT "due on " LOAN-MONTH "/" LOAN-DAY "/" LOAN-YEAR.