IDENTIFICATION DIVISION.
 PROGRAM-ID. SAMPLE-PROGRAM.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM1 PIC 9(4) VALUE 0.
 01 NUM2 PIC 9(4) VALUE 0.
 01 RESULT PIC 9(4).
 PROCEDURE DIVISION.
     MAIN-PARAGRAPH.
         PERFORM GET-NUM1
         PERFORM GET-NUM2
         PERFORM CALCULATION
         PERFORM DISPLAY-RESULT
         STOP RUN.
 GET-NUM1.
     DISPLAY "Enter the first number: " WITH NO ADVANCING
     ACCEPT NUM1.
 GET-NUM2.
     DISPLAY "Enter the second number: " WITH NO ADVANCING
     ACCEPT NUM2.
 CALCULATION.
     MULTIPLY NUM1 BY NUM2 GIVING RESULT.
 DISPLAY-RESULT.
     DISPLAY "The result is: " RESULT.