Identification Division.
Program-ID. Example.

* This is a sample program written in COBOL to calculate the area of a rectangle.
* It takes in the length and width of the rectangle as inputs and outputs the area.

Data Division.
Working-Storage Section.
77 length PIC 9(3).
77 width PIC 9(3).
77 area PIC 9(6).

Procedure Division.
Display "Enter the length of the rectangle: ".
Accept length.
Display "Enter the width of the rectangle: ".
Accept width.
Multiply length by width giving area.
Display "The area of the rectangle is: ", area.
Stop Run.

* Explanation:
* - The Identification Division contains the program name and ID.
* - The Data Division declares the variables to be used.
* - The Procedure Division contains the logic of the program.
* - Display and Accept statements are used to interact with the user and store their input.
* - The Multiply statement calculates the area and stores it in the area variable.
* - Finally, the Display statement prints out the calculated area and the program ends with a Stop Run statement.