IDENTIFICATION DIVISION. 
       PROGRAM-ID. CALCULATE-AREA. 

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 LENGTH        PIC 9(3). 
       01 WIDTH         PIC 9(3). 
       01 AREA          PIC 9(5)V99. 

       PROCEDURE DIVISION. 
       MAIN-PARA. 
           DISPLAY "Enter length: ". 
           ACCEPT LENGTH. 
           DISPLAY "Enter width: ". 
           ACCEPT WIDTH. 
           COMPUTE AREA = LENGTH * WIDTH. 
           DISPLAY "Area is: " AREA. 

       END PROGRAM CALCULATE-AREA.