*> This is a comment in COBOL
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-ONE PIC 9(4).
01 INPUT-TWO PIC 9(4).
01 RESULT PIC 9(5).
01 OPERATOR PIC X.

PROCEDURE DIVISION.
ADD COMPUTE-ADDITION.
SUBTRACT COMPUTE-SUBTRACTION.
MULTIPLY COMPUTE-MULTIPLICATION.
DIVIDE COMPUTE-DIVISION.

ADD:
    DISPLAY "Enter the first number:".
    ACCEPT INPUT-ONE.
    DISPLAY "Enter the second number:".
    ACCEPT INPUT-TWO.

COMPUTE-ADDITION:
    COMPUTE RESULT = INPUT-ONE + INPUT-TWO.
    MOVE "+" TO OPERATOR.
    PERFORM DISPLAY-RESULT.

SUBTRACT:
    DISPLAY "Enter the first number:".
    ACCEPT INPUT-ONE.
    DISPLAY "Enter the second number:".
    ACCEPT INPUT-TWO.

COMPUTE-SUBTRACTION:
    COMPUTE RESULT = INPUT-ONE - INPUT-TWO.
    MOVE "-" TO OPERATOR.
    PERFORM DISPLAY-RESULT.

MULTIPLY:
    DISPLAY "Enter the first number:".
    ACCEPT INPUT-ONE.
    DISPLAY "Enter the second number:".
    ACCEPT INPUT-TWO.

COMPUTE-MULTIPLICATION:
    COMPUTE RESULT = INPUT-ONE * INPUT-TWO.
    MOVE "*" TO OPERATOR.
    PERFORM DISPLAY-RESULT.

DIVIDE:
    DISPLAY "Enter the first number:".
    ACCEPT INPUT-ONE.
    DISPLAY "Enter the second number:".
    ACCEPT INPUT-TWO.

COMPUTE-DIVISION:
    COMPUTE RESULT = INPUT-ONE / INPUT-TWO.
    MOVE "/" TO OPERATOR.
    PERFORM DISPLAY-RESULT.

DISPLAY-RESULT:
    DISPLAY "The result of" INPUT-ONE OPERATOR INPUT-TWO "is" RESULT.