IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 String1 PIC X(8) VALUE "HELLO, ".
       01 String2 PIC X(6) VALUE "WORLD!".
       PROCEDURE DIVISION.
       DISPLAY String1 STRING2.
      // Displays "HELLO, WORLD!"
       STOP RUN.