IDENTIFICATION DIVISION.
      PROGRAM-ID. LONG-AND-COMPLEX.

      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01  STUDENT-RECORD.
          05  STUDENT-ID                    PIC 9(9).
          05  STUDENT-NAME                  PIC X(20).
          05  STUDENT-ADDRESS               PIC X(30).
          05  STUDENT-GRADES.
              10  MATH                      PIC 9(3).
              10  SCIENCE                   PIC 9(3).
              10  ENGLISH                   PIC 9(3).
              10  HISTORY                   PIC 9(3).

      PROCEDURE DIVISION.
      MAIN-PROCEDURE.
          PERFORM GET-STUDENT-INFO
          PERFORM CALCULATE-AVERAGE
          PERFORM PRINT-RESULTS
          STOP RUN.

      GET-STUDENT-INFO.
          DISPLAY "Enter Student ID: "
          ACCEPT STUDENT-ID
          DISPLAY "Enter Student Name: "
          ACCEPT STUDENT-NAME
          DISPLAY "Enter Student Address: "
          ACCEPT STUDENT-ADDRESS
          DISPLAY "Enter Math Grade: "
          ACCEPT MATH
          DISPLAY "Enter Science Grade: "
          ACCEPT SCIENCE
          DISPLAY "Enter English Grade: "
          ACCEPT ENGLISH
          DISPLAY "Enter History Grade: "
          ACCEPT HISTORY.

      CALCULATE-AVERAGE.
          COMPUTE STUDENT-AVERAGE = (MATH + SCIENCE + ENGLISH + HISTORY)/4.

      PRINT-RESULTS.
          DISPLAY "-------------------"
          DISPLAY "Student ID: " STUDENT-ID
          DISPLAY "Student Name: " STUDENT-NAME
          DISPLAY "Student Address: " STUDENT-ADDRESS
          DISPLAY "Math Grade: " MATH
          DISPLAY "Science Grade: " SCIENCE
          DISPLAY "English Grade: " ENGLISH
          DISPLAY "History Grade: " HISTORY
          DISPLAY "Student Average: " STUDENT-AVERAGE
          DISPLAY "-------------------".