IDENTIFICATION DIVISION.
       PROGRAM-ID. ADJUST-STATUS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. ANNUAL-REPORT
       OBJECT-COMPUTER. ANNUAL-REPORT

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO FILE1
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS FS1.
           SELECT OUTPUT-FILE ASSIGN TO FILE2
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               FILE STATUS IS FS2.
       
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORDING MODE F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 0 RECORDS
           DATA RECORD IS INPUT-RECORD.
       01 INPUT-RECORD.
           05 INPUT-NAME             PIC X(20).
           05 INPUT-STATUS           PIC X(1).
           05 INPUT-AMOUNT           PIC 9(5)V99.
       
       FD OUTPUT-FILE
           RECORDING MODE F
           LABEL RECORDS ARE STANDARD
           BLOCK CONTAINS 10 RECORDS
           DATA RECORD IS OUTPUT-RECORD.
       01 OUTPUT-RECORD.
           05 OUTPUT-NAME            PIC X(20).
           05 OUTPUT-STATUS          PIC X(1).
           05 OUTPUT-AMOUNT          PIC 9(5)V99.
       
       WORKING-STORAGE SECTION.
       01 WS-INPUT-STATUS           PIC X(1).
       01 WS-OUTPUT-STATUS          PIC X(1).
       
       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE
       
       PERFORM UNTIL FS1 = "10"
           READ INPUT-FILE
               AT END SET FS1 TO "10"
               NOT AT END
                   IF INPUT-STATUS IS EQUAL TO "A"
                       PERFORM ADJUST-STATUS
                   END-IF
           END-READ
       END-PERFORM
       
       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE
       STOP RUN
       
       ADJUST-STATUS.
           MOVE INPUT-STATUS TO WS-INPUT-STATUS.
       
           IF WS-INPUT-STATUS IS EQUAL TO "A"
               MOVE "Y" TO WS-OUTPUT-STATUS
           ELSE
               MOVE "N" TO WS-OUTPUT-STATUS
           END-IF
           
           MOVE WS-OUTPUT-STATUS TO OUTPUT-STATUS.
           WRITE OUTPUT-RECORD.