IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.

FD INPUT-FILE.
01 INPUT-RECORD.
    05 NAME PIC X(30).
    05 DATE-OF-BIRTH PIC 9(8).
    05 ADDRESS.
        10 STREET PIC X(20).
        10 CITY PIC X(15).
        10 STATE PIC XX.
        10 ZIP-CODE PIC 9(5).

FD OUTPUT-FILE.
01 OUTPUT-RECORD.
    05 NAME PIC X(30).
    05 AGE PIC 99.
    05 CITY PIC X(15).
    05 STATE PIC XX.

WORKING-STORAGE SECTION.
01 CURRENT-DATE.
    05 CURR-MM      PIC 99.      # CURRENT MONTH
    05 CURR-DD      PIC 99.      # CURRENT DAY
    05 CURR-YY      PIC 9999.    # CURRENT YEAR
    05 CURR-AGE     PIC 99.      # CURRENT AGE CALCULATED
01 BIRTH-MM        PIC 99.      # BIRTH MONTH FROM INPUT
01 BIRTH-DD        PIC 99.      # BIRTH DAY FROM INPUT
01 BIRTH-YY        PIC 9999.    # BIRTH YEAR FROM INPUT
01 BIRTH-AGE       PIC 99.      # AGE CALCULATED FROM INPUT

PROCEDURE DIVISION.
MAIN-PARAGRAPH.

OPEN INPUT INPUT-FILE
OUTPUT-FILE "example_output.txt".   # OPEN INPUT AND OUTPUT FILES

PERFORM UNTIL END-OF-FILE = 'Y'.    # PERFORM UNTIL END OF FILE REACHED
    READ INPUT-FILE INTO INPUT-RECORD.
    IF INPUT-RECORD = 'CANCEL'.
        MOVE 'Y' TO END-OF-FILE.
    ELSE
        MOVE NAME TO OUTPUT-RECORD-N
        MOVE CITY TO OUTPUT-RECORD-C
        MOVE STATE TO OUTPUT-RECORD-S
        # GET CURRENT DATE
        MOVE FUNCTION CURRENT-DATE (1:2) TO CURR-MM
        MOVE FUNCTION CURRENT-DATE (4:2) TO CURR-DD
        MOVE FUNCTION CURRENT-DATE (7:4) TO CURR-YY
        # GET BIRTH DATE
        MOVE DATE-OF-BIRTH (1:2) TO BIRTH-MM
        MOVE DATE-OF-BIRTH (3:2) TO BIRTH-DD
        MOVE DATE-OF-BIRTH (5:4) TO BIRTH-YY
        # CALCULATE AGE
        SUBTRACT BIRTH-YY FROM CURR-YY GIVING CURR-AGE
        IF BIRTH-MM > CURR-MM OR (BIRTH-MM = CURR-MM AND BIRTH-DD > CURR-DD)
            SUBTRACT 1 FROM CURR-AGE
        MOVE CURR-AGE TO OUTPUT-RECORD-A
        WRITE OUTPUT-RECORD.        # WRITE OUTPUT RECORD
    END-IF.
END-PERFORM.

CLOSE INPUT-FILE OUTPUT-FILE.       # CLOSE INPUT AND OUTPUT FILES
STOP RUN.