IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROG.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "INFILE"

           SELECT OUTPUT-FILE ASSIGN TO "OUTFILE".

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD.
           05 INPUT-NAME PIC X(20).
           05 INPUT-AGE PIC 9(3).

       FD OUTPUT-FILE.
       01 OUTPUT-RECORD.
           05 OUTPUT-NAME PIC X(20).
           05 OUTPUT-AGE PIC 9(3).
       
       WORKING-STORAGE SECTION.
       01 WS-COUNT PIC 9(3).
       01 WS-TOTAL-AGE PIC 9(4) VALUE 0.

       PROCEDURE DIVISION.
       000-MAIN.
           OPEN INPUT INPUT-FILE
               OUTPUT OUTPUT-FILE.

           PERFORM 100-PROCESS-RECORDS
               UNTIL 100-RECORDS-DONE.

           DISPLAY "Average age: " WS-TOTAL-AGE / WS-COUNT.

           CLOSE INPUT-FILE
               OUTPUT-FILE.

           STOP RUN.

       100-PROCESS-RECORDS.
           READ INPUT-FILE
               AT END
                   MOVE "YES" TO 100-RECORDS-DONE
               NOT AT END
                   ADD 1 TO WS-COUNT
                   ADD INPUT-AGE TO WS-TOTAL-AGE
                   MOVE INPUT-NAME TO OUTPUT-NAME
                   MOVE INPUT-AGE TO OUTPUT-AGE
                   WRITE OUTPUT-RECORD.

           DISPLAY "Processed record: " INPUT-NAME ", " INPUT-AGE.

       100-RECORDS-DONE PIC X(3) VALUE "NO".