IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

DATA DIVISION.
FILE SECTION.

FD INPUT-FILE.
01 NUMBER-RECORD.
    05 NUMBERS OCCURS 10 TIMES PIC 9(3).

WORKING-STORAGE SECTION.

01 SUM PIC 9(4).
01 CTR PIC 9(2) VALUE 10.
01 I PIC 9(2) VALUE 1.

PROCEDURE DIVISION.

MAIN-PARA.
    OPEN INPUT INPUT-FILE
    PERFORM UNTIL CTR <= 0
        READ INPUT-FILE
            AT END SET CTR TO ZERO
            WHEN NUMBERS(I) > 50
                ADD NUMBERS(I) TO SUM
            ADD 1 TO I
            SUBTRACT 1 FROM CTR
        END-READ
    END-PERFORM
    CLOSE INPUT-FILE
    DISPLAY "The sum of numbers greater than 50 is " SUM
    STOP RUN.