IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "input.txt".
           SELECT OUTPUT-FILE ASSIGN TO "output.txt".

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
          RECORDING MODE IS F.
       01 INPUT-RECORD.
           05 INPUT-NAME      PIC X(50).
           05 INPUT-AGE       PIC 99.
           05 INPUT-ADDRESS.
               10 INPUT-STREET  PIC X(50).
               10 INPUT-CITY    PIC X(50).
               10 INPUT-STATE   PIC X(2).
       FD OUTPUT-FILE 
          RECORDING MODE IS V.
       01 OUTPUT-RECORD.
           05 OUTPUT-NAME     PIC X(50).
           05 OUTPUT-AGE      PIC 99.
           05 OUTPUT-ADDRESS.
               10 OUTPUT-STREET PIC X(50).
               10 OUTPUT-CITY   PIC X(50).
               10 OUTPUT-STATE  PIC X(2).

       WORKING-STORAGE SECTION.
       01 WS-COUNTER            PIC 99.
       01 WS-TOTAL-AGE          PIC 999.
       01 WS-TOTAL-RECORDS      PIC 9(8).

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE, OUTPUT OUTPUT-FILE.
       PERFORM READ-RECORD UNTIL EOF-FLAG = 1.
       COMPUTE WS-COUNTER = WS-COUNTER + 1.
       ADD INPUT-AGE TO WS-TOTAL-AGE.
       MOVE INPUT-NAME TO OUTPUT-NAME.
       MOVE INPUT-AGE TO OUTPUT-AGE.
       MOVE INPUT-ADDRESS TO OUTPUT-ADDRESS.
       WRITE OUTPUT-RECORD.
       PERFORM READ-RECORD UNTIL EOF-FLAG = 1.
       CLOSE INPUT-FILE, OUTPUT-FILE.
       STOP RUN.

       READ-RECORD.
       READ INPUT-FILE AT END
           MOVE 1 TO EOF-FLAG
       NOT AT END
           ADD INPUT-AGE TO WS-TOTAL-AGE.
           ADD 1 TO WS-TOTAL-RECORDS.
       END-READ.