IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-AREA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LENGTH PIC 9(3).
       01 WIDTH PIC 9(3).
       01 AREA PIC 9(5).
       PROCEDURE DIVISION.
       INPUT-PARAMETERS.
          DISPLAY "PLEASE ENTER LENGTH: ".
          ACCEPT LENGTH.
          DISPLAY "PLEASE ENTER WIDTH: ".
          ACCEPT WIDTH.
       CALCULATE-AREA.
          MULTIPLY LENGTH BY WIDTH GIVING AREA.
       OUTPUT-RESULT.
          DISPLAY "THE AREA IS: " AREA.
       EXIT PROGRAM.