---- Illustrating different forms of MOVE Statement
 
       WORKING-STORAGE SECTION. 
       01 MONTH-ABBREVIATIONS. 
           05 MONTH-ABBRV-VALUES PIC X(72) VALUE 'JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC'.
           05 MONTH-VALUES       PIC X(84) VALUE 'JANUARYFEBRUARYMARCHAPRILMAYJUNEJULYAUGUSTSEPTEMBEROCTOBERNOVEMBERDECEMBER'.
       01 MONTH PIC 9(2). 
       01 YEAR PIC 9(4). 
       01 MONTH-NAME PIC X(9). 
       01 JSX-DATE. 
           05 MONTH-JSX PIC X(2). 
           05 FILLER    PIC X VALUE '/'. 
           05 YEAR-JSX  PIC X(4). 
       01 DXS-DATE. 
           05 FILLER    PIC X(3). 
           05 MONTH-DXS PIC X(2). 
           05 FILLER    PIC X VALUE '/'. 
           05 YEAR-DXS  PIC X(4). 
 
       COMPUTE MONTH-ABBREVIATIONS = MONTH-VALUES
       INITIALIZE MONTH
       MOVE DATE TO MONTH-NAME           
       IF MONTH = 1                       
           MOVE "JAN" TO MONTH-NAME        
       END-IF 
 
       MOVE YEAR TO YEAR-JSX             
       MOVE MONTH TO MONTH-JSX           
       MOVE YEAR TO YEAR-DXS
       MOVE MONTH TO MONTH-DXS