IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO-WORLD.

      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 WS-COUNTER PIC 99 VALUE 0.
      01 WS-NAME PIC X(10) VALUE 'JOHN SMITH'.

      PROCEDURE DIVISION.
      PERFORM 5 TIMES
         DISPLAY 'HELLO ' WS-NAME
         ADD 1 TO WS-COUNTER
      END-PERFORM.
      DISPLAY 'NUMBER OF GREETINGS: ' WS-COUNTER

      STOP RUN.