IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMERIC-VARIABLE PIC 9(4)V9(2).
       01 STRING-VARIABLE PIC X(10).
       01 ARRAY-VARIABLE.
          05 VALUE-ONE PIC X(3) VALUE "ABC".
          05 VALUE-TWO PIC X(3) VALUE "DEF".
          05 VALUE-THREE PIC X(3) VALUE "GHI".
          05 VALUE-FOUR PIC X(3) VALUE "JKL".
       PROCEDURE DIVISION.
       DISPLAY "Enter a numeric value followed by a string value."
       ACCEPT NUMERIC-VARIABLE, STRING-VARIABLE.
       ADD 10 TO NUMERIC-VARIABLE.
       STRING "Input values were: ", NUMERIC-VARIABLE, ", ", STRING-VARIABLE DELIMITED BY SIZE INTO STRING-VARIABLE.
       DISPLAY STRING-VARIABLE.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 4
           DISPLAY "Array value at index ", I, " is ", ARRAY-VARIABLE(I)
       END-PERFORM.
       STOP RUN.