IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLEPROG.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO "INPUTFILE"
               ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INREC.
           05 EMPLOYEE-ID PIC 9(6).
           05 EMPLOYEE-NAME PIC A(20).
           05 EMPLOYEE-DEPT PIC 9(2).
           05 EMPLOYEE-SALARY PIC 9(9)V99.

       WORKING-STORAGE SECTION.
       01 EMP-COUNT PIC 9(3) VALUE 0.
       01 TOTAL-SALARY PIC 9(11)V99 VALUE 0.

       PROCEDURE DIVISION.
       000-MAIN.
           OPEN INPUT INFILE.
           MOVE 1 TO EMP-COUNT.

       100-READ.
           READ INFILE INTO INREC.
           AT END MOVE 'Y' TO EOF-SWITCH.

       200-CALC-TOTAL.
           MULTIPLY EMPLOYEE-SALARY BY 100 GIVING TEMP-SALARY.
           ADD TEMP-SALARY TO TOTAL-SALARY.
           ADD 1 TO EMP-COUNT.

           PERFORM 100-READ UNTIL EOF-SWITCH = 'Y'.

       300-DISPLAY-TOTAL.
           DISPLAY "Total number of employees: " EMP-COUNT.
           DISPLAY "Total salary of all employees: " TOTAL-SALARY.

       400-CLOSE.
           CLOSE INFILE.

       END PROGRAM SAMPLEPROG.