IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALES-TAX.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 SALE-AMOUNT PIC 9(7)V99.
01 SALES-TAX PIC 9(6)V99.

PROCEDURE DIVISION.
    A000-MAIN.
    DISPLAY "Enter the amount of sale:".
    ACCEPT SALE-AMOUNT.

    IF SALE-AMOUNT > 1000 THEN
        COMPUTE SALES-TAX = SALE-AMOUNT * .07
    ELSE IF SALE-AMOUNT > 500 THEN
        COMPUTE SALES-TAX = SALE-AMOUNT * .05
    ELSE
        COMPUTE SALES-TAX = SALE-AMOUNT * .03

    DISPLAY "The sales tax is:" SALES-TAX.
    STOP RUN.
    
    END PROGRAM CALCULATE-SALES-TAX.