IDENTIFICATION DIVISION.      //DIVISION declaration
      PROGRAM-ID. MAIN.              //PROGRAM ID declaration
      ENVIRONMENT DIVISION.          //ENVIRONMENT declaration
      DATA DIVISION.                 //DATA declaration
      WORKING-STORAGE SECTION.       //WORKING STORAGE SECTION declaration
      01 NUMBER-OF-STUDENTS PIC 9(3). //Variable declaration with data type
      01 STUDENT-RECORD.             //Student record declaration
          05 STUDENT-ID PIC X(10).   //Student ID field in record with data type
          05 STUDENT-NAME PIC X(20). //Student name field in record with data type
          05 STUDENT-GRADE PIC X(2). //Student grade field in record with data type
      PROCEDURE DIVISION.            //PROCEDURE declaration
      MAIN-PROCEDURE.                //Main procedure declaration
          DISPLAY "ENTER NUMBER OF STUDENTS: ". //Output to prompt user
          ACCEPT NUMBER-OF-STUDENTS FROM CONSOLE. //Input from user
          PERFORM READ-STUDENT-RECORD UNTIL NUMBER-OF-STUDENTS = 0 //Loop until all records have been read
          STOP RUN.                  //End of program
      READ-STUDENT-RECORD.           //Read student record procedure
          DISPLAY "ENTER STUDENT ID: ". //Output to prompt user for student ID
          ACCEPT STUDENT-ID FROM CONSOLE. //Input for student ID
          DISPLAY "ENTER STUDENT NAME: ". //Output to prompt user for student name
          ACCEPT STUDENT-NAME FROM CONSOLE. //Input for student name
          DISPLAY "ENTER STUDENT GRADE: ". //Output to prompt user for student grade
          ACCEPT STUDENT-GRADE FROM CONSOLE. //Input for student grade
          WRITE STUDENT-RECORD. //Write student record to file
          DISPLAY "STUDENT RECORD WRITTEN SUCCESSFULLY!". //Output success message
          ADD -1 TO NUMBER-OF-STUDENTS. //Subtract 1 from number of students to track progress