000100 IDENTIFICATION DIVISION.                         //* Annotated markdown COBOL code snippet
000200 PROGRAM-ID. MYPROGRAM.                           //* This is the program identification division
000300 DATA DIVISION.                                   //* This is the data division
000400 WORKING-STORAGE SECTION.                         //* This is the working storage section
000500 01 NUM1 PIC 9(5) VALUE 12345.                     //* This is a variable declaration with initial value
000600 01 NUM2 PIC 9(5) VALUE 67890.                     //* This is another variable declaration with initial value
000700 01 RESULT PIC 9(7).                               //* This is a variable declaration without initial value 
000800 PROCEDURE DIVISION.                               //* This is the procedure division
000900     COMPUTE RESULT = NUM1 + NUM2.                  //* This is a computation using the values of NUM1 and NUM2 
001000     DISPLAY "The sum of NUM1 and NUM2 is: " RESULT.//* This displays the result in the output
001100     STOP RUN.                                     //* This statement ends the execution of the program