IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 0.
01 NUM2 PIC 9(3) VALUE 0.
01 TEMP PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY "Welcome to the Calculator Program."

    ACCEPT NUM1.
    ACCEPT NUM2.

    MULTIPLY NUM1 BY NUM2 GIVING TEMP.
    DIVIDE TEMP BY 5 GIVING TEMP.

    ADD TEMP TO NUM2.

    IF NUM1 > NUM2
        DISPLAY "The result is greater than the second number."
    ELSE IF NUM1 < NUM2
        DISPLAY "The result is less than the second number."
    ELSE
        DISPLAY "The result is equal to the second number."
    END-IF.

STOP RUN.