IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MY-VARIABLE PIC 9(3) VALUE 100.
       01 MY-STRING PIC X(10) VALUE 'HELLO'.
       01 MY-ARRAY.
           05 MY-ARRAY-ELEMENTS OCCURS 10 TIMES.
               10 MY-ARRAY-ELEMENT PIC X(5) VALUE 'WORLD'.
           05 FILLER PIC X(5) VALUE SPACES.

       PROCEDURE DIVISION.
           PERFORM VARYING MY-VARIABLE FROM 1 BY 1 UNTIL MY-VARIABLE > 10
               DISPLAY MY-STRING,
                       ' ',
                       MY-ARRAY(MY-VARIABLE),
                       ' ',
                       'MY-VARIABLE VALUE:',
                       MY-VARIABLE
           END-PERFORM.

       END PROGRAM EXAMPLE.