******------------------------------------* START PROGRAM
IDENTIFICATION DIVISION.                    * IDENTIFICATION DIVISION OF COBOL PROGRAM
PROGRAM-ID. PROG.                           * PROGRAM NAME
AUTHOR. JOHN DOE.                           * AUTHOR NAME
ENVIRONMENT DIVISION.                       * ENVIRONMENT DIVISION OF COBOL PROGRAM
INPUT-OUTPUT SECTION.                       * INPUT-OUTPUT SECTION FOR FILE IO
FILE-CONTROL.                               * FILE-CONTROL FOR DEFINING FILES USED
SELECT INPUT-FILE ASSIGN TO DISK            * SELECTS INPUT FILE AND ASSIGN IT TO DISK
SELECT OUTPUT-FILE ASSIGN TO DISK           * SELECTS OUTPUT FILE AND ASSIGN IT TO DISK
DATA DIVISION.                              * DATA DIVISION FOR DECLARING VARIABLES
FILE SECTION.                               * FILE SECTION FOR VARIABLES USED IN FILE IO
FD INPUT-FILE.                              * FILE DESCRIPTION FOR INPUT FILE
01 IN-RECORD.                               * RECORD DESCRIPTION FOR INPUT FILE
05 EMPLOYEE-ID PIC X(5).                    * EMPLOYEE ID OF TYPE ALPHANUMERIC WITH LENGTH OF 5 CHARACTERS
05 EMPLOYEE-NAME PIC X(30).                 * EMPLOYEE NAME OF TYPE ALPHANUMERIC WITH LENGTH OF 30 CHARACTERS
05 EMPLOYEE-SALARY PIC 9(6).                * EMPLOYEE SALARY OF TYPE NUMERIC WITH LENGTH OF 6 DIGITS
FD OUTPUT-FILE.                             * FILE DESCRIPTION FOR OUTPUT FILE
01 OUT-RECORD.                              * RECORD DESCRIPTION FOR OUTPUT FILE
05 EMPLOYEE-ID OUT PIC X(5).                * EMPLOYEE ID OF TYPE ALPHANUMERIC WITH LENGTH OF 5 CHARACTERS FOR OUTPUT
05 EMPLOYEE-NAME OUT PIC X(30).             * EMPLOYEE NAME OF TYPE ALPHANUMERIC WITH LENGTH OF 30 CHARACTERS FOR OUTPUT
05 EMPLOYEE-SALARY OUT PIC 9(6).            * EMPLOYEE SALARY OF TYPE NUMERIC WITH LENGTH OF 6 DIGITS FOR OUTPUT
WORKING-STORAGE SECTION.                    * WORKING-STORAGE SECTION FOR DECLARING VARIABLES
01 COUNT PIC 9(3) VALUE 0.                   * VARIABLE COUNT OF TYPE NUMERIC WITH INITIAL VALUE OF 0
01 EMPLOYEE-COUNTER PIC 9(3) VALUE 0.        * VARIABLE EMPLOYEE-COUNTER OF TYPE NUMERIC WITH INITIAL VALUE OF 0
PROCEDURE DIVISION.                         * PROCEDURE DIVISION FOR CODING THE LOGIC
READ INPUT-FILE                             * READS INPUT FILE AND MOVES DATA INTO CORRESPONDING VARIABLES
    AT END                                   * IF END OF FILE, PROCEED TO DISPLAY OUTPUT
        GO TO DISPLAY-OUTPUT                            
    NOT AT END                               * IF NOT END OF FILE, INCREASE EMPLOYEE-COUNTER AND PROCEED TO NEXT LINE IN FILE
        ADD 1 TO EMPLOYEE-COUNTER
        GO TO READ INPUT-FILE
DISPLAY-OUTPUT.                             * DISPLAYS OUTPUT
    PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > EMPLOYEE-COUNTER   * LOOP TO DISPLAY OUTPUT LINE BY LINE
        DISPLAY "EMPLOYEE ID: " EMPLOYEE-ID(COUNT) * DISPLAY EMPLOYEE ID FOR CURRENT LINE
        DISPLAY "EMPLOYEE NAME: " EMPLOYEE-NAME(COUNT) * DISPLAY EMPLOYEE NAME FOR CURRENT LINE
        DISPLAY "EMPLOYEE SALARY: " EMPLOYEE-SALARY(COUNT) * DISPLAY EMPLOYEE SALARY FOR CURRENT LINE
END PROGRAM.                                * END OF PROGRAM
******------------------------------------*