IDENTIFICATION DIVISION.
       PROGRAM-ID. Program1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-NUMBER    PIC 9(3).
       01 B-NUMBER    PIC 9(3).
       01 RESULT      PIC 9(5).

       PROCEDURE DIVISION.
       BEGIN PROGRAM1.

       DISPLAY "Enter the first number:".
       ACCEPT A-NUMBER.
       DISPLAY "Enter the second number:".
       ACCEPT B-NUMBER.
       COMPUTE RESULT = A-NUMBER + B-NUMBER.

       IF RESULT > 999 THEN
           DISPLAY "The result is too large.".
       ELSE
           DISPLAY "The result is:" RESULT.

       END PROGRAM1.