IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-PRODUCTS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BEGIN-PRODUCT PIC 9(5).
01 END-PRODUCT PIC 9(5).
01 PRODUCT-TOTAL PIC 9(6).

PROCEDURE DIVISION.
MAIN-PROCESS.

MOVE 500 TO BEGIN-PRODUCT.
MOVE 1000 TO END-PRODUCT.

MULTIPLY BEGIN-PRODUCT BY END-PRODUCT GIVING PRODUCT-TOTAL.

DISPLAY "The total of products is :" PRODUCT-TOTAL.

STOP RUN.