ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO 'STUDLIST.DAT'
               ORGANIZATION IS LINE SEQUENTIAL.
 
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE.
       01 STUDENT-RECORD.
           05 STU-ID                      PIC X(8).
           05 STU-NAME                    PIC X(20).
 
       WORKING-STORAGE SECTION.
       01 OUTPUT-LINE                      PIC X(50).
       01 TOTAL-STU-COUNT                  PIC 9(3) VALUE 0.
       01 AVERAGE-SCORE                    PIC 999.99 VALUE 0.
       01 HIGHEST-SCORE                    PIC 999.99 VALUE 0.
       01 LOWEST-SCORE                     PIC 999.99 VALUE 0.
       01 SCORE-TOTAL                      PIC 999.99 VALUE 0.
       
       PROCEDURE DIVISION.
       BEGIN.
       OPEN INPUT STUDENT-FILE.
       PERFORM READ-STUDENT-RECORD UNTIL END-OF-FILE.
       CLOSE STUDENT-FILE.
       PERFORM CALCULATE-AVERAGE.
       PERFORM CALCULATE-HIGHEST.
       PERFORM CALCULATE-LOWEST.
       PERFORM DISPLAY-STATISTICS.
       STOP RUN.
       
       READ-STUDENT-RECORD.
       READ STUDENT-FILE
           AT END SET END-OF-FILE TO TRUE
       END-READ.
       IF END-OF-FILE NOT= TRUE
           ADD 1 TO TOTAL-STU-COUNT.
           ADD SCORE TO SCORE-TOTAL.
       END-IF.
       
       CALCULATE-AVERAGE.
       COMPUTE AVERAGE-SCORE = SCORE-TOTAL / TOTAL-STU-COUNT.
       
       CALCULATE-HIGHEST.
       IF SCORE > HIGHEST-SCORE
           MOVE SCORE TO HIGHEST-SCORE.
       END-IF.
       
       CALCULATE-LOWEST.
       IF SCORE < LOWEST-SCORE
           MOVE SCORE TO LOWEST-SCORE.
       END-IF.
       
       DISPLAY-STATISTICS.
       MOVE "Average score: " TO OUTPUT-LINE
           DISPLAY OUTPUT-LINE, AVERAGE-SCORE.
       MOVE "Highest score: " TO OUTPUT-LINE
           DISPLAY OUTPUT-LINE, HIGHEST-SCORE.
       MOVE "Lowest score: " TO OUTPUT-LINE
           DISPLAY OUTPUT-LINE, LOWEST-SCORE.
       MOVE "Total number of students: " TO OUTPUT-LINE
           DISPLAY OUTPUT-LINE, TOTAL-STU-COUNT.