Identification Division.
Program-ID. Complex-Code-Snippet.

Data Division.
Working-Storage Section.
77 Num-A Number Value 100.
77 Num-B Number Value 50.
77 Num-C Number Value 30.
77 Result Number.

Procedure Division.
Compute Result = Num-A + Num-B - Num-C.
Display "The result is " Result.