IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
*
* This program multiplies two numbers and displays the result
*
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-NUMBER PIC 9(2).
01 SECOND-NUMBER PIC 9(2).
01 MULTIPLY-RESULT PIC 9(4).
01 MULTIPLY-FORMULA.
   02 MULTIPLY-FORMULA1 PIC 9(2).
   02 MULTIPLY-FORMULA2 PIC 9(2).
*
PROCEDURE DIVISION.
MAIN-PROCEDURE.
   DISPLAY "Enter the first number: ".
   ACCEPT FIRST-NUMBER.
   DISPLAY "Enter the second number: ".
   ACCEPT SECOND-NUMBER.
   MULTIPLY FIRST-NUMBER BY SECOND-NUMBER GIVING MULTIPLY-RESULT.
   DISPLAY "The result is: ", MULTIPLY-RESULT.
   STOP RUN.