IDENTIFICATION DIVISION.                        // Indicates start of identification division
 
      PROGRAM-ID. HELLO-WORLD-EXAMPLE.                 // Program name
 
      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      SOURCE-COMPUTER. IBM-PC.
      OBJECT-COMPUTER. IBM-PC.
 
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 HELLO-MESSAGE PIC X(40) VALUE 'Hello, world!'. // Declares variable storing the hello message
 
      PROCEDURE DIVISION.
      DISPLAY HELLO-MESSAGE.                           // Displays the hello message on the screen
      STOP RUN.                                        // Ends the program execution