IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
      *
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INFILE1 ASSIGN TO "INPUT1.DAT".
       SELECT INFILE2 ASSIGN TO "INPUT2.DAT".
       SELECT OUTFILE ASSIGN TO "OUTPUT.DAT".
      *
       DATA DIVISION.
       FILE SECTION.
       FD INFILE1.
       01 IN-RECORD.
          02 IN-NAME PIC A(20).
          02 IN-AGE PIC 99.
          02 IN-SALARY PIC 9(6)V99.
       FD INFILE2.
       01 IN-RECORD.
          02 IN-NAME PIC A(20).
          02 IN-AGE PIC 99.
          02 IN-SALARY PIC 9(6)V99.
       FD OUTFILE.
       01 OUT-RECORD.
          02 OUT-NAME PIC A(20).
          02 OUT-AGE PIC 99.
          02 OUT-SALARY PIC 9(6)V99.
       WORKING-STORAGE SECTION.
       01 TEMP-RECORD.
          02 TEMP-NAME PIC A(20).
          02 TEMP-AGE PIC 99.
          02 TEMP-SALARY PIC 9(6)V99.
       01 TOTAL-SALARY PIC 9(8)V99.
       01 NUM-RECORDS PIC 9(4).
      *
       PROCEDURE DIVISION.
       0000-START.
           OPEN INFILE1.
           OPEN INFILE2.
           OPEN OUTFILE.
           READ INFILE1 INTO IN-RECORD.
           READ INFILE2 INTO IN-RECORD.
       0100-LOOP.
           PERFORM 1000-CALCULATE-SALARY UNTIL IN-RECORD NOT = "EOF".
       9000-STOP.
           DISPLAY "TOTAL SALARY: " TOTAL-SALARY.
           STOP RUN.
       1000-CALCULATE-SALARY.
           MOVE IN-SALARY TO TEMP-SALARY.
           ADD TEMP-SALARY TO TOTAL-SALARY.
           MOVE IN-AGE TO TEMP-AGE.
           ADD 1 TO NUM-RECORDS.
           WRITE TEMP-RECORD TO OUTFILE.
           READ INFILE1 INTO IN-RECORD.
           READ INFILE2 INTO IN-RECORD.
       1000-EXIT.
           EXIT.
       END PROGRAM EXAMPLE.