IDENTIFICATION DIVISION.
       PROGRAM-ID. CODE_SNIPPET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  COBOL-VARIABLE PIC 9(5).
       01  COBOL-ARRAY PIC X(10) OCCURS 5 TIMES.
       01  COBOL-STRING PIC X(10) VALUE "HELLO".
       PROCEDURE DIVISION.
       PERFORM VARYING I FROM 1 BY 1
       UNTIL I > 5
           ADD I TO COBOL-VARIABLE
           MOVE COBOL-STRING TO COBOL-ARRAY(I)
       END-PERFORM.
       DISPLAY "Final value of COBOL-VARIABLE: " COBOL-VARIABLE.
       DISPLAY "Contents of COBOL-ARRAY: " COBOL-ARRAY.
       STOP RUN.