IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WKS-DS.
           05  WKS-VAR1             PIC X(10) VALUE 'HELLO WORLD'.
           05  WKS-VAR2             PIC 99.99  VALUE 100.00.
           05  WKS-VAR3 OCCURS 10   PIC X(5).
       PROCEDURE DIVISION.
           DISPLAY 'Greetings from COBOL, ' WKS-VAR1.
           COMPUTE WKS-VAR2 = WKS-VAR2 - 5.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
               COMPUTE WKS-VAR3(I) = WKS-VAR3(I) + I.
           END-PERFORM.
           DISPLAY 'The final result is ' WKS-VAR2.
           DISPLAY 'The array values are '.
           DISPLAY WKS-VAR3.
       STOP RUN.