IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-CODE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-VARIABLE PIC X(10) VALUE 'HELLO'.
PROCEDURE DIVISION.
MOVE 'WORLD' TO MY-VARIABLE.
DISPLAY 'Greetings from ' MY-VARIABLE.
STOP RUN.