IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 VAR1 PIC S9(4) VALUE 100.
01 VAR2 PIC S9(4) VALUE 200.
01 RESULT PIC S9(4) VALUE 0.

PROCEDURE DIVISION.
MAIN-SECTION.
PERFORM MULTIPLY-VARIABLES.

DISPLAY "Result is: " RESULT.

STOP-RUN.

MULTIPLY-VARIABLES.
MULTIPLY VAR1 BY VAR2 GIVING RESULT.