IDENTIFICATION DIVISION.
 PROGRAM-ID. SampleProgram.

 PROCEDURE DIVISION.
    PERFORM INITIALIZE-VARIABLES.
    IF SAMPLE-FLAG = "Y"
        PERFORM PROCESS-SAMPLE-INPUT
    ELSE
        PERFORM PROCESS-OTHER-INPUT.
    
 INITIALIZE-VARIABLES.
    INITIALIZE SAMPLE-FLAG.
    INITIALIZE NUMBER-OF-SAMPLES TO 0.
    INITIALIZE TOTAL-SAMPLE-AMOUNT TO 0.
    INITIALIZE AVERAGE-SAMPLE-AMOUNT TO 0.
 
 PROCESS-SAMPLE-INPUT.
    DISPLAY "Please enter sample amount: "
    ACCEPT SAMPLE-INPUT
    COMPUTE TOTAL-SAMPLE-AMOUNT = TOTAL-SAMPLE-AMOUNT + SAMPLE-INPUT
    COMPUTE NUMBER-OF-SAMPLES = NUMBER-OF-SAMPLES + 1
    COMPUTE AVERAGE-SAMPLE-AMOUNT = TOTAL-SAMPLE-AMOUNT / NUMBER-OF-SAMPLES
    DISPLAY "Total sample amount: " TOTAL-SAMPLE-AMOUNT
    DISPLAY "Number of samples: " NUMBER-OF-SAMPLES
    DISPLAY "Average sample amount: " AVERAGE-SAMPLE-AMOUNT
 
 PROCESS-OTHER-INPUT.
    DISPLAY "Please enter other input: "
    ACCEPT OTHER-INPUT
    COMPUTE OTHER-PROCESSING-RESULT = OTHER-INPUT * 2
    DISPLAY "Result of other processing: " OTHER-PROCESSING-RESULT.
    
 STOP RUN.