IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNT       PIC S9(9) VALUE 0.
01 WS-MESSAGE     PIC X(40) VALUE 'HELLO, WORLD!'.
01 WS-CONTROL     PIC X(1) VALUE 'Y'.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY WS-MESSAGE.
    PERFORM WHILE WS-CONTROL = 'Y'
        ADD 1 TO WS-COUNT
        DISPLAY WS-COUNT WS-MESSAGE
        ACCEPT WS-CONTROL
    END-PERFORM.
    STOP RUN.
END MAIN-PROCEDURE.