IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE-PROGRAM.
AUTHOR. JOHN DOE.
DATE-WRITTEN. 01/01/2020.
DATE-COMPILED.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.
SPECIAL-NAMES.
    DECIMAL-POINT IS COMMA.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'MYDATA.TXT'.
    SELECT OUTPUT-FILE ASSIGN TO 'RESULT.TXT'.
DATA DIVISION.
FILE SECTION.
FD INPUT-FILE
    RECORDING MODE IS F.
01 INPUT-RECORD.
    05 ID       PIC X(10).
    05 NAME     PIC X(20).
    05 ADDRESS  PIC X(30).
    05 SALARY   PIC 9(6)V99.
    05 AGE      PIC 99.
FD OUTPUT-FILE
    RECORDING MODE IS F.
01 OUTPUT-RECORD.
    05 ID      PIC X(10).
    05 NAME    PIC X(20).
    05 ADDRESS PIC X(30).
    05 RANK    PIC X(6).
WORKING-STORAGE SECTION.
01 TOTAL-SALARY         PIC 9(8)V99.
   88 NO-SALARY              VALUE ZERO.
   88 MAX-SALARY             VALUE 100000.
01 COUNT                PIC 99.
01 SALARY-TABLE.
    05 SALARY-LIMIT       PIC 9(6) OCCURS 3 TIMES INDEXED BY X.
01 AVG-SALARY           PIC 9(6).
PROCEDURE DIVISION.
0000-MAIN.
   OPEN INPUT INPUT-FILE
        OUTPUT OUTPUT-FILE.
   PERFORM UNTIL NO-SALARY
    
       PERFORM 1000-READ-RECORD
       PERFORM 2000-CHECK-SALARY
       PERFORM 3000-WRITE-RECORD       

       END-PERFORM

   CLOSE INPUT-FILE
         OUTPUT-FILE.
   STOP RUN.
 1000-READ-RECORD.
    READ INPUT-FILE
        AT END SET NO-SALARY TO TRUE
    END-READ.
2000-CHECK-SALARY.
    IF SALARY > MAX-SALARY
    PERFORM 4000-UPDATE-SALARY-TABLE
       ADD SALARY TO TOTAL-SALARY
       ADD 1 TO COUNT
       COMPUTE AVG-SALARY = TOTAL-SALARY / COUNT.
4000-UPDATE-SALARY-TABLE.
    PERFORM VARYING X FROM 1 BY 1
       UNTIL X > 3
        IF SALARY > SALARY-LIMIT(X)
        MOVE SALARY TO SALARY-LIMIT(X)
        GO TO 4000-EXIT.
       END-IF
    END-PERFORM
4000-EXIT.
    EXIT.
 3000-WRITE-RECORD.
    MOVE ID TO OUTPUT-RECORD.ID
    MOVE NAME TO OUTPUT-RECORD.NAME
    MOVE ADDRESS TO OUTPUT-RECORD.ADDRESS
    IF SALARY > MAX-SALARY
    MOVE 'HIGH' TO OUTPUT-RECORD.RANK
    ELSE
    MOVE 'LOW' TO OUTPUT-RECORD.RANK
    MOVE OUTPUT-RECORD TO OUTPUT-FILE.