IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-COMPLEX-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MY-NUMBER PIC 9(5).
       01 MY-NUMBER-SQUARED PIC 9(10).
       01 MY-RESULT PIC 9(10).
       PROCEDURE DIVISION.
       PERFORM SQUARE-NUMBER.
       PERFORM DISPLAY-RESULT.
       STOP RUN.

       SQUARE-NUMBER.
          COMPUTE MY-NUMBER-SQUARED = MY-NUMBER ** 2.

       DISPLAY-RESULT.
          ADD MY-NUMBER-SQUARED TO MY-NUMBER GIVING MY-RESULT.
          DISPLAY "The square of " MY-NUMBER " is " MY-NUMBER-SQUARED.
          DISPLAY "The sum of " MY-NUMBER-SQUARED " and " MY-NUMBER " is " MY-RESULT.