IDENTIFICATION DIVISION.
       PROGRAM-ID. ComplexSnippet.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT InputFile1 ASSIGN TO "InputFile1.txt".
           SELECT InputFile2 ASSIGN TO "InputFile2.txt".
           SELECT OutputFile ASSIGN TO "OutputFile.txt".
       DATA DIVISION.
       FILE SECTION.
       FD InputFile1.
       01 InputFile1-Record.
           05 IF1-Field1 PIC X(10).
           05 IF1-Field2 PIC X(10).
           05 IF1-Field3 PIC X(10).
       FD InputFile2.
       01 InputFile2-Record.
           05 IF2-Field1 PIC 9(3).
           05 IF2-Field2 PIC 9(5).
           05 IF2-Field3 PIC X(20).
       FD OutputFile.
       01 OutputFile-Record.
           05 OF-Field1 PIC X(20).
           05 OF-Field2 PIC 9(5).
           05 OF-Field3 PIC X(15).
           05 OF-Field4 PIC X(10).
       WORKING-STORAGE SECTION.
       01 File1-EndOfFile PIC X VALUE "N".
       01 File2-EndOfFile PIC X VALUE "N".
       PROCEDURE DIVISION.
       000-MAIN.
           OPEN INPUT InputFile1, InputFile2
           OUTPUT OutputFile
           PERFORM UNTIL File1-EndOfFile = "Y" AND File2-EndOfFile = "Y"
               READ InputFile1
                   AT END MOVE "Y" TO File1-EndOfFile
               END-READ
               PERFORM UNTIL File2-EndOfFile = "Y"
                   READ InputFile2
                       AT END MOVE "Y" TO File2-EndOfFile
                   END-READ
                   IF IF1-Field1 = IF2-Field1
                       MOVE OF-Field2 TO IF1-Field2
                       MOVE OF-Field3 TO IF1-Field3
                       MOVE OF-Field4 TO OF-Field1
                       MOVE OF-Field1 TO OF-Field3
                       MOVE OF-Field2 TO OF-Field4
                       WRITE OutputFile-Record
                   END-IF
               END-PERFORM.
           END-PERFORM.
           CLOSE InputFile1, InputFile2, OutputFile.
           STOP RUN.