IDENTIFICATION DIVISION.
PROGRAM-ID. ACCOUNTING-RPT.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT SAMPLE-INPUT-FILE
       ASSIGN TO 'INPUT.TXT'
       ORGANIZATION IS LINE SEQUENTIAL.

   SELECT ACCT-RPT-OUTPUT-FILE
       ASSIGN TO 'REPORT.TXT'
       ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD SAMPLE-INPUT-FILE.
01 SAMPLE-INPUT-REC.
   05 SAMPLE-ACCT-NUMBER PIC X(10).
   05 SAMPLE-ACCT-NAME PIC X(20).
   05 SAMPLE-ACCT-BALANCE PIC 9(10).

SD ACCT-RPT-OUTPUT-FILE.
01 ACCT-RPT-OUTPUT-REC.
   05 ACCT-NUMBER PIC X(10).
   05 ACCT-NAME PIC X(20).
   05 ACCT-BALANCE PIC 9(10).

WORKING-STORAGE SECTION.
77 INPUT-EOF PIC X VALUE 'NO'.
77 TOTAL-DEPOSITS PIC 9(10) VALUE 0.
77 TOTAL-WITHDRAWALS PIC 9(10) VALUE 0.
77 TOTAL-INTEREST PIC 9(10) VALUE 0.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
   OPEN INPUT SAMPLE-INPUT-FILE
        OUTPUT ACCT-RPT-OUTPUT-FILE.
   PERFORM READ-INPUT-RECORD UNTIL INPUT-EOF = 'YES'.
   PERFORM WRITE-REPORT-HEADING.
   PERFORM PROCESS-ACCOUNTS.
   PERFORM WRITE-REPORT-TOTALS.
   CLOSE SAMPLE-INPUT-FILE, ACCT-RPT-OUTPUT-FILE.
   STOP RUN.

READ-INPUT-RECORD.
   READ SAMPLE-INPUT-FILE
       AT END MOVE 'YES' TO INPUT-EOF.
   
PROCESS-ACCOUNTS.
   IF SAMPLE-ACCT-BALANCE < 0
       MOVE SAMPLE-ACCT-BALANCE TO TOTAL-WITHDRAWALS
   ELSE
       MOVE SAMPLE-ACCT-BALANCE TO TOTAL-DEPOSITS.
   COMPUTE TOTAL-INTEREST = TOTAL-INTEREST + (SAMPLE-ACCT-BALANCE * 0.05).
   MOVE SAMPLE-ACCT-NUMBER TO ACCT-NUMBER.
   MOVE SAMPLE-ACCT-NAME TO ACCT-NAME.
   WRITE ACCT-RPT-OUTPUT-REC.

WRITE-REPORT-HEADING.
   MOVE 'ACCT #      ACCT NAME               BALANCE' TO ACCT-RPT-OUTPUT-REC.
   WRITE ACCT-RPT-OUTPUT-REC.

WRITE-REPORT-TOTALS.
   MOVE 'TOTAL DEPOSITS: ' TO ACCT-RPT-OUTPUT-REC.
   MOVE TOTAL-DEPOSITS TO ACCT-BALANCE.
   WRITE ACCT-RPT-OUTPUT-REC.
   MOVE 'TOTAL WITHDRAWALS: ' TO ACCT-RPT-OUTPUT-REC.
   MOVE TOTAL-WITHDRAWALS TO ACCT-BALANCE.
   WRITE ACCT-RPT-OUTPUT-REC.
   MOVE 'TOTAL INTEREST EARNED: ' TO ACCT-RPT-OUTPUT-REC.
   MOVE TOTAL-INTEREST TO ACCT-BALANCE.
   WRITE ACCT-RPT-OUTPUT-REC.

END PROGRAM ACCOUNTING-RPT.