IDENTIFICATION DIVISION.						// Start of the program division
PROGRAM-ID. CALCULATOR.							// Name of the program
AUTHOR. JOHN DOE.								// Author of the program
DATA DIVISION.									// Start of the data division
WORKING-STORAGE SECTION.						// Defines variables to be used in the program
01 FIRST-NUMBER PIC 9(3).						// Defines a variable for the first number input
01 SECOND-NUMBER PIC 9(3).						// Defines a variable for the second number input
01 OPERATOR PIC X.								// Defines a variable for the operator input
01 RESULT PIC 9(4).								// Defines a variable for the output result
PROCEDURE DIVISION.								// Start of the procedure division
MAIN-ROUTINE.									// Main routine of the program
DISPLAY "Please enter the first number: ".		// Prompts the user to enter the first number
ACCEPT FIRST-NUMBER.							// Accepts the user's input and stores it in the first-number variable
DISPLAY "Please enter the second number: ".		// Prompts the user to enter the second number
ACCEPT SECOND-NUMBER.							// Accepts the user's input and stores it in the second-number variable
DISPLAY "Please enter the operator (+,-,*,/): ".	// Prompts the user to enter the operator
ACCEPT OPERATOR.								// Accepts the user's input and stores it in the operator variable
EVALUATE TRUE									// Evaluates the following condition
WHEN OPERATOR = "+"								// Checks if the operator is +
COMPUTE RESULT = FIRST-NUMBER + SECOND-NUMBER	// Adds the two numbers and stores the result in the result variable
END-EVALUATE.									// Ends the evaluate statement
DISPLAY "The result is: ", RESULT.				// Displays the result to the user
STOP RUN.										// Stops the program execution