IDENTIFICATION DIVISION.
PROGRAM-ID. myprogram.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
FD myinputfile
RECORD CONTAINS 80 CHARACTERS
BLOCK CONTAINS 0 RECORDS
LABEL RECORD IS OMITTED.
01 MY-INPUT-RECORD.
05 MY-NAME PIC X(20).
05 MY-AGE PIC 99.
05 MY-SALARY PIC 9(5)V99.
WORKING-STORAGE SECTION.
01 WS-TOTAL-SALARY PIC 9(7)V99.
PROCEDURE DIVISION.
OPEN INPUT myinputfile.
READ myinputfile INTO MY-INPUT-RECORD.
IF MY-AGE >= 18
    ADD MY-SALARY TO WS-TOTAL-SALARY
ELSE
    MULTIPLY MY-SALARY BY 2 GIVING WS-TOTAL-SALARY.
CLOSE myinputfile.
DISPLAY "Total Salary: " WS-TOTAL-SALARY.
STOP RUN.