IDENTIFICATION-DIVISION.
PROGRAM-ID. ComplexCode.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 first-number PIC 9(3) VALUE 123.
01 second-number PIC 9(3) VALUE 456.
01 third-number PIC 9(3) VALUE 789.
01 result PIC 9(6).
01 counter PIC 99.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM MULTIPLY-TWO-NUBMBERS
    PERFORM ADD-THREE-NUMBERS
    DISPLAY "The result of the complex code is " result
    STOP RUN.

MULTIPLY-TWO-NUMBERS.
    COMPUTE result = first-number * second-number.
    ADD 1 TO counter.
    PERFORM VARYING counter FROM 1 BY 1 UNTIL counter = 10
        COMPUTE result = result * second-number.
END-PERFORM.

ADD-THREE-NUMBERS.
    COMPUTE result = result + third-number.