IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INPUT-FILE ASSIGN TO 'input.txt'.
SELECT OUTPUT-FILE ASSIGN TO 'output.txt'.
DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
   02 NUMB PIC 99.
SD OUTPUT-FILE.
01 OUTPUT-RECORD.
   02 RESULT PIC X(16).
WORKING-STORAGE SECTION.
01 DIV3 PIC 99.
01 DIV5 PIC 99.
PROCEDURE DIVISION.
MAIN-LOGIC.
    OPEN INPUT INPUT-FILE
         OUTPUT OUTPUT-FILE.
    PERFORM READ-PARA UNTIL (NUMB = 0).
    CLOSE INPUT-FILE OUTPUT-FILE.
    STOP RUN.
READ-PARA.
    READ INPUT-FILE
        AT END DISPLAY 'END OF FILE'
               GO TO END-PARA.
    IF NUMB / 3 = 0
        MOVE 'FIZZ' TO RESULT.
    ELSE IF NUMB / 5 = 0
        MOVE 'BUZZ' TO RESULT.
    ELSE IF NUMB / 15 = 0
        MOVE 'FIZZBUZZ' TO RESULT.
    ELSE
        MOVE NUMB TO RESULT.
    WRITE OUTPUT-RECORD.
END-PARA.
    EXIT.