IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-SUM.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 NUM-1 PIC 9(4).
  01 NUM-2 PIC 9(4).
  01 RESULT PIC 9(4).
  01 SUM PIC 9(4).

PROCEDURE DIVISION.
  DISPLAY "Enter first number:".
  ACCEPT NUM-1.
  DISPLAY "Enter second number:".
  ACCEPT NUM-2.

  PERFORM CALC-SUM.

  DISPLAY "The sum of " NUM-1 " and " NUM-2 " is " RESULT ".".

CALC-SUM.
  COMPUTE SUM = NUM-1 + NUM-2.
  MOVE SUM TO RESULT.