*= Main program to calculate total price of items 

IDENTIFICATION DIVISION.
PROGRAM-ID. PRICE-CALCULATION.
AUTHOR. MALIK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INPUT-FILE ASSIGN TO "ITEMS-FILE.TXT".
SELECT OUTPUT-FILE ASSIGN TO "TOTAL-PRICE.TXT".

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 ITEM-DATA.
02 ITEM-CODE PIC 999.
02 ITEM-NAME PIC X(20).
02 ITEM-PRICE PIC 9(3)V99.

WORKING-STORAGE SECTION.
01 TOTAL-PRICE PIC 9(5)V99.

PROCEDURE DIVISION.
MAIN-LOGIC.

OPEN INPUT INPUT-FILE
OUTPUT OUTPUT-FILE.

PERFORM READ-ITEM
UNTIL ITEM-CODE = 999.

WRITE OUTPUT-RECORD FROM ITEM-DATA.

READ-ITEM.
READ INPUT-FILE 
AT END SET ITEM-CODE TO 999.

COMPUTE TOTAL-PRICE = TOTAL-PRICE + ITEM-PRICE.

WRITE OUTPUT-RECORD FROM ITEM-DATA.

STOP RUN.