IDENTIFICATION DIVISION.                                                    /* start of identification division */
PROGRAM-ID. SIMPLE-PROGRAM.                                                  /* name of the program */
AUTHOR. JOHN SMITH.                                                          /* author of the program */

ENVIRONMENT DIVISION.                                                        /* start of environment division */
CONFIGURATION SECTION.                                                       /* start of configuration section */
SOURCE-COMPUTER. IBM-390.                                                    /* specify the type of computer */
OBJECT-COMPUTER. IBM-3090.                                                   /* specify the type of computer that will run the program */

DATA DIVISION.                                                               /* start of data division */
FILE SECTION.                                                                /* start of file section */
FD IN-FILE.                                                                  /* declare file descriptor for input file */
01 IN-FILE-RECORD.                                                           /* declare record in input file */
   05 EMPLOYEE-ID        PIC X(6).                                            /* employee ID field */
   05 EMPLOYEE-NAME      PIC X(20).                                           /* employee name field */
   05 HOURLY-WAGE        PIC 9(4)V99.                                         /* hourly wage field */
   05 HOURS-WORKED       PIC 9(3).                                            /* hours worked field */

FD OUT-FILE.                                                                 /* declare file descriptor for output file */
01 OUT-FILE-RECORD.                                                          /* declare record in output file */
   05 EMPLOYEE-ID        PIC X(6).                                            /* employee ID field */
   05 EMPLOYEE-NAME      PIC X(20).                                           /* employee name field */
   05 GROSS-PAY          PIC $9(5)V99.                                        /* gross pay field */
   05 DEDUCTIONS         PIC $9(5)V99.                                        /* deductions field */
   05 NET-PAY            PIC $9(5)V99.                                        /* net pay field */

WORKING-STORAGE SECTION.                                                     /* start of working-storage section */
01 NUM-EMPLOYEES        PIC 9(2).                                             /* number of employees variable */
01 TOTAL-GROSS-PAY      PIC $9(6)V99.                                         /* total gross pay variable */
01 TOTAL-DEDUCTIONS     PIC $9(6)V99.                                         /* total deductions variable */
01 TOTAL-NET-PAY        PIC $9(6)V99.                                         /* total net pay variable */
01 AVERAGE-HOURLY-WAGE  PIC $9(4)V99.                                         /* average hourly wage variable */

PROCEDURE DIVISION.                                                           /* start of procedure division */

MAIN-PARAGRAPH.                                                               /* main paragraph of the program */
   OPEN INPUT IN-FILE                                                        /* open input file */
   OPEN OUTPUT OUT-FILE                                                      /* open output file */

   PERFORM READ-PARAGRAPH THRU READ-PARAGRAPH-EXIT UNTIL IN-FILE-RECORD      /* loop through input file until end of file */
       NOT=E-O-F

   COMPUTE AVERAGE-HOURLY-WAGE = TOTAL-GROSS-PAY / HOURS-WORKED              /* calculate average hourly wage */

   WRITE OUT-FILE-RECORD                                                     /* write output record to file */
       INVALID KEY NEXT SENTENCE
   END-WRITE

   DISPLAY "TOTAL GROSS PAY: " TOTAL-GROSS-PAY                                /* display total gross pay */
   DISPLAY "TOTAL DEDUCTIONS: " TOTAL-DEDUCTIONS                              /* display total deductions */
   DISPLAY "TOTAL NET PAY: " TOTAL-NET-PAY                                    /* display total net pay */
   DISPLAY "AVERAGE HOURLY WAGE: " AVERAGE-HOURLY-WAGE                        /* display average hourly wage */

   CLOSE IN-FILE                                                             /* close input file */
   CLOSE OUT-FILE                                                            /* close output file */
   STOP RUN.                                                                 /* stop execution of program */

READ-PARAGRAPH.                                                               /* read paragraph of the program */
   READ IN-FILE INTO IN-FILE-RECORD                                          /* read input record into record variable */
       INVALID KEY                                                           
           MOVE E-O-F TO IN-FILE-RECORD                                      /* if end of file, set flag to true */
           GO TO READ-PARAGRAPH-EXIT.                                        /* exit loop */

   INSPECT IN-FILE-RECORD REPLACING ALL "/" BY " " IN EMPLOYEE-NAME           /* replace slashes with spaces in employee name */

   DISPLAY "EMPLOYEE ID: " EMPLOYEE-ID                                       /* display employee ID */
   DISPLAY "EMPLOYEE NAME: " EMPLOYEE-NAME                                   /* display employee name */
   COMPUTE GROSS-PAY = HOURLY-WAGE * HOURS-WORKED                             /* calculate gross pay */
   DISPLAY "GROSS PAY: " GROSS-PAY                                            /* display gross pay */
   COMPUTE DEDUCTIONS = GROSS-PAY * 0.2                                       /* calculate deductions */
   DISPLAY "DEDUCTIONS: " DEDUCTIONS                                          /* display deductions */
   COMPUTE NET-PAY = GROSS-PAY - DEDUCTIONS                                   /* calculate net pay */
   DISPLAY "NET PAY: " NET-PAY                                                /* display net pay */

   ADD GROSS-PAY TO TOTAL-GROSS-PAY                                           /* add gross pay to total gross pay variable */
   ADD DEDUCTIONS TO TOTAL-DEDUCTIONS                                         /* add deductions to total deductions variable */
   ADD NET-PAY TO TOTAL-NET-PAY                                               /* add net pay to total net pay variable */

READ-PARAGRAPH-EXIT.                                                          /* exit point for read paragraph */
   EXIT.