IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(4) VALUE 1234.
01 NUM2 PIC 9(4) VALUE 5678.
01 TOTAL PIC 9(5).
01 TEMP PIC X(10).
01 VAL-CHECK PIC X VALUE 'N'.
PROCEDURE DIVISION.
CALC.
MULTIPLY NUM1 BY NUM2 GIVING TEMP.
IF NUM1 = ZERO OR NUM2 = ZERO
    SET VAL-CHECK TO 'Y'.
COMPUTE TOTAL = NUM1 + NUM2.
DISPLAY 'THE TOTAL IS: ' TOTAL.
STOP RUN.