IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INCOMING-ARRAY.
05 INCOMING-VALUE PIC 9(4) OCCURS 5 TIMES.
05 INCOMING-TOTAL PIC 9(6) VALUE ZERO.
01 OUTGOING-ARRAY.
05 OUTGOING-VALUE PIC 9(4) OCCURS 5 TIMES.
05 OUTGOING-TOTAL PIC 9(6).
01 COUNTER PIC 99 VALUE 1.

PROCEDURE DIVISION.
PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER > 5
		ADD INCOMING-VALUE(COUNTER) TO INCOMING-TOTAL
		MULTIPLY INCOMING-VALUE(COUNTER) BY 2 GIVING OUTGOING-VALUE(COUNTER)
		DIVIDE OUTGOING-VALUE(COUNTER) BY 3 GIVING OUTGOING-TOTAL
END-PERFORM.

DISPLAY "Incoming total: " INCOMING-TOTAL.
DISPLAY "Outgoing total: " OUTGOING-TOTAL.

STOP RUN.