IDENTIFICATION DIVISION.
       PROGRAM-ID. sort-program.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARR-SIZE PIC 9(1) COMP S9(8) BINARY.
       01 I PIC 9(1) COMP VALUE 0.          
       01 J PIC 9(1) COMP VALUE 0.          
       01 TEMP PIC S9(8) BINARY.
       01 ARRAY.
            02 ARR-ELEM PIC S9(8) BINARY OCCURS 0
               TIMES VARYING I FROM 1 BY 1.               
       PROCEDURE DIVISION.
       MAIN-PROC.                                     
           DISPLAY "Enter the size of the array: ".
           ACCEPT ARR-SIZE.
           DISPLAY "Enter the elements of the array: ".
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARR-SIZE
               ACCEPT ARRAY(I).
           END-PERFORM.
           PERFORM VARYING I FROM 2 BY 1 UNTIL I > ARR-SIZE
               PERFORM VARYING J FROM 1 BY 1 UNTIL J > ARR-SIZE - I + 1
                   IF ARRAY(J) > ARRAY(J+1)                
                       MOVE ARRAY(J+1) TO TEMP                 
                       MOVE ARRAY(J) TO ARRAY(J+1)               
                       MOVE TEMP TO ARRAY(J).
           END-PERFORM.
           DISPLAY "The sorted array is: ".
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARR-SIZE        
               DISPLAY ARRAY(I).
           END-PERFORM.
       STOP RUN.