IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
        
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 NUM-A PIC 9(3) VALUE 123.
       01 NUM-B PIC 9(3) VALUE 456.
       01 RESULT PIC 9(4) VALUE ZERO.
       01 TEMP-A PIC 9(3).
       01 TEMP-B PIC 9(3).
       
       PROCEDURE DIVISION.
       MAIN-PARA.
       COMPUTE TEMP-A = NUM-A DIV 10.
       COMPUTE TEMP-B = NUM-B MOD 10.
       MULTIPLY TEMP-A BY TEMP-B GIVING RESULT.