01 RECORD-1.                       
          05 EMPLOYEE-ID PIC X(10).         
          05 NAME PIC X(30).               
          05 AGE PIC 99.                   
          05 SALARY PIC 9(7)V99.           
          05 DEPARTMENT.                    
             10 DEPT-ID PIC 99.             
             10 DEPT-NAME PIC X(20).       
          05 DEPENDENTS OCCURS 0 TO 5 TIMES.
             10 DEP-NAME PIC X(30).        
             10 DEP-AGE PIC 99.            
           
       01 TOTAL-SALARY PIC 9(10)V99.        
           
       PERFORM UNTIL RECORD-1 = 'END'       
           DISPLAY 'Employee ID:' EMPLOYEE-ID
           DISPLAY 'Name:' NAME             
           DISPLAY 'Age:' AGE               
           ADD SALARY TO TOTAL-SALARY       
           DISPLAY 'Department:' DEPT-NAME  
           PERFORM VARYING I FROM 1 TO 5     
           IF DEPENDENTS (I) = 0             
           EXIT PERFORM                      
           END-IF                             
           DISPLAY 'Dependent Name:' DEP-NAME
           DISPLAY 'Dependent Age:' DEP-AGE
           
       END-PERFORM                          
           
       DISPLAY 'Total Salary:' TOTAL-SALARY.