IDENTIFICATION DIVISION.                           
PROGRAM-ID. HELLO-WORLD.                           
DATA DIVISION.                                     
WORKING-STORAGE SECTION.                           
01 WS-NAME PIC X(10) VALUE "HELLO".                 
01 WS-OUTPUT PIC X(20).                             
PROCEDURE DIVISION.                                 
MAIN-PROCEDURE.                                     
DISPLAY WS-NAME " WORLD".                           
STOP RUN.