IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNTER PIC 9(3) VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM INIT-COUNTER.
           PERFORM UNTIL WS-COUNTER > 10
             DISPLAY "HELLO, WORLD!".
             ADD 1 TO WS-COUNTER.
           END-PERFORM.
           STOP RUN.
       INIT-COUNTER.
           MOVE 1 TO WS-COUNTER.