IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNTER-ONE      PIC S9(03)  COMP-3 VALUE 1.
       01 WS-COUNTER-TWO      PIC S9(03)  COMP-3 VALUE 2.
       01 WS-COUNTER-THREE    PIC S9(05)  COMP-3 VALUE 999.
       01 WS-STRING-LENGTH    PIC S9(04)  BINARY VALUE 20.
       01 WS-STRING           PIC X(20)  VALUE 'HELLO, WORLD!'.
       01 WS-OUTPUT           PIC X(20)  VALUE SPACES.
       01 WS-INDEX            PIC S9(03)  COMP-3 VALUE 1.
       01 WS-CHARACTER        PIC X(01).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

           PERFORM VARYING WS-COUNTER-ONE FROM 1 BY 1 UNTIL WS-COUNTER-ONE > 10
               PERFORM VARYING WS-COUNTER-TWO FROM 1 BY 1 UNTIL WS-COUNTER-TWO > 10
                   IF WS-COUNTER-ONE > WS-COUNTER-TWO
                       ADD 10 TO WS-INDEX
                   ELSE
                       SUBTRACT 10 FROM WS-INDEX
                   END-IF

                   IF WS-COUNTER-TWO > WS-COUNTER-THREE
                       SET WS-INDEX TO WS-CHARACTER NUMERIC
                   ELSE
                       SET WS-INDEX TO WS-CHARACTER ALPHANUMERIC
                   END-IF

                   STRING WS-STRING(WS-INDEX:WS-STRING-LENGTH) INTO WS-OUTPUT
                   DISPLAY WS-OUTPUT
               END-PERFORM
           END-PERFORM.

           STOP RUN.