IDENTIFICATION DIVISION.
       PROGRAM-ID. example.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 num RECORD.
          05 num1   PIC 9(5).
          05 num2   PIC 9(5).
       01 result   PIC 9(5).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

       DISPLAY "Enter num1: " WITH NO ADVANCING.
       ACCEPT num1.

       DISPLAY "Enter num2: " WITH NO ADVANCING.
       ACCEPT num2.

       PERFORM MULTIPLY-AND-DIVIDE
         VARYING num1 FROM 0
         BY 1
         UNTIL num1 = 10.

       DISPLAY "Result: " result.

       MULTIPLY-AND-DIVIDE.
           MULTIPLY num1 BY num2 GIVING result.
           DIVIDE result BY 2 GIVING result.

       END PROGRAM example.