IDENTIFICATION DIVISION.                     //Code division
      PROGRAM-ID. MyProgram.                       //Program ID
      DATA DIVISION.                               //Data division
      WORKING-STORAGE SECTION.                     //Working storage section
      77 my-numbers PIC 9(5) OCCURS 5 TIMES.       /Array to store 5 numbers
      01 sum-of-numbers PIC 9(5).                  // Variable to store sum of numbers
      01 average PIC 9(5).                         // Variable to store average of numbers
      PROCEDURE DIVISION.                          // Procedure division
          PERFORM VARYING i FROM 1 BY 1            // Loop to get inputs and calculate sum
                      UNTIL i>5                    // Runs 5 times
              DISPLAY "Please enter a number:". 
              ACCEPT my-numbers(i).
              ADD my-numbers(i) TO sum-of-numbers.
          END-PERFORM.
          COMPUTE average = sum-of-numbers / 5.    // Calculate average
          DISPLAY "The average of the numbers is:".
          DISPLAY average.
      STOP RUN.                                    // End of program