IDENTIFICATION DIVISION.
PROGRAM-ID. NEW-PROGRAM.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE
ASSIGN TO "INFILE.TXT"
ORGANIZATION IS LINE SEQUENTIAL.
SELECT OUT-FILE
ASSIGN TO "OUTFILE.TXT"
ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 IN-RECORD PIC X(100).
FD OUT-FILE.
01 OUT-RECORD PIC X(100).

WORKING-STORAGE SECTION.
01 TOTAL-AMOUNT COMP.
01 OUT-AMOUNT COMP.
01 IN-LOOP PIC 99 VALUE 1.
01 OUT-LOOP PIC 99 VALUE 1.

PROCEDURE DIVISION.
PERFORM UNTIL TOTAL-AMOUNT <= 0
    READ IN-FILE
    AT END DISPLAY "END OF FILE"
    NOT AT END
        PERFORM PROCESS-RECORD
    END-READ
END-PERFORM.

PROCESS-RECORD.
PERFORM UNTIL OUT-AMOUNT >= TOTAL-AMOUNT
    MOVE 0 TO OUT-AMOUNT
    IF IN-RECORD(IN-LOOP:5) = "SALES"
    ADD 1 TO OUT-AMOUNT
    MOVE IN-RECORD TO OUT-RECORD
    WRITE OUT-RECORD
    ADD 1 TO IN-LOOP
END-PERFORM.