IDENTIFICATION DIVISION.
PROGRAM-ID. COBOL-PROGRAM.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INPUT-FILE ASSIGN TO "input.txt".
SELECT OUTPUT-FILE ASSIGN TO "output.txt".

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
 05 STUDENT-ID PIC 9(5).
 05 STUDENT-NAME PIC X(20).
 05 MARKS.
 10 ENGLISH PIC 9(3).
 10 MATHS PIC 9(3).
 10 SCIENCE PIC 9(3).
01 OUTPUT-RECORD.
 05 STUDENT-ID PIC 9(5).
 05 STUDENT-NAME PIC X(20).
 05 TOTAL-MARKS PIC 9(3).

WORKING-STORAGE SECTION.
 01 TOTAL PIC 9(3) VALUE ZERO.

PROCEDURE DIVISION.
MAIN-PARA.
  OPEN INPUT INPUT-FILE
       OUTPUT OUTPUT-FILE.

  PERFORM READ-FILE UNTIL INPUT-RECORD = "99999".
  CLOSE INPUT-FILE.

READ-FILE.
  READ INPUT-FILE INTO INPUT-RECORD AT END SET INPUT-RECORD = "99999".
  IF INPUT-RECORD = "99999"
      CONTINUE
  END-IF.

  COMPUTE TOTAL = ENGLISH + MATHS + SCIENCE.
  MOVE INPUT-RECORD TO OUTPUT-RECORD.
  MOVE TOTAL TO TOTAL-MARKS.
  WRITE OUTPUT-RECORD.

  DISPLAY "Record written to output file.".

  PERFORM READ-FILE.

STOP-RUN.