IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "myinputfile.txt"
                  ORGANIZATION IS SEQUENTIAL.

           SELECT OUTPUT-FILE ASSIGN TO "myoutputfile.txt"
                  ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 ROW.
          05 ID          PIC 99.
          05 FIRST-NAME  PIC X(10).
          05 LAST-NAME   PIC X(10).
          05 SALARY      PIC 99V99.

       FD OUTPUT-FILE.
       01 RESULT-ROW.
          05 ID          PIC XX.
          05 FULL-NAME   PIC X(20).
          05 MONTHLY-SAL PIC $$.99.

       WORKING-STORAGE SECTION.
       01 TEMP-NAME PIC X(20).

       PROCEDURE DIVISION.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM READ-ROW UNTIL END-OF-FILE
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE
           STOP RUN.

       READ-ROW.
           READ INPUT-FILE
             AT END SET END-OF-FILE TO TRUE
           END-READ
           IF NOT END-OF-FILE
             MOVE FIRST-NAME TO TEMP-NAME
             STRING FIRST-NAME " " LAST-NAME DELIMITED BY " " INTO FULL-NAME
             MOVE FUNCTION SALARY / 12 TO MONTHLY-SAL
             MOVE MONTHLY-SAL TO TEMP-NAME
             WRITE RESULT-ROW
           END-IF.