IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-PRICES.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 PRICE-LIST.                               * Define variables to hold price list.
          05 ONE-LB-BEEF PIC 9(3)V99 VALUE 6.89.     * Price for one pound of beef.
          05 ONE-LB-CHICKEN PIC 9(3)V99 VALUE 4.99.  * Price for one pound of chicken.
          05 ONE-LB-PORK PIC 9(3)V99 VALUE 5.99.     * Price for one pound of pork.

       01 ORDER-AMOUNTS.                            * Define variables to hold order amounts.
          05 BEEF-AMOUNT PIC 9(3)V99 VALUE 0.        * Amount of beef ordered.
          05 CHICKEN-AMOUNT PIC 9(3)V99 VALUE 0.     * Amount of chicken ordered.
          05 PORK-AMOUNT PIC 9(3)V99 VALUE 0.        * Amount of pork ordered.

       01 TOTAL-PRICES.                             * Define variables to hold total prices.
          05 BEEF-TOTAL PIC 9(4)V99 VALUE 0.         * Total price for beef ordered.
          05 CHICKEN-TOTAL PIC 9(4)V99 VALUE 0.      * Total price for chicken ordered.
          05 PORK-TOTAL PIC 9(4)V99 VALUE 0.         * Total price for pork ordered.
          05 ORDER-TOTAL PIC 9(4)V99 VALUE 0.        * Total order price.

       PROCEDURE DIVISION.
       100-CALCULATE-PRICES.                        * Main procedure.
           DISPLAY "Welcome to the Price Calculator".
           ACCEPT BEEF-AMOUNT                        * Take user input for beef amount.
               DISPLAY "Enter amount of beef ordered (lbs): ".
           ACCEPT CHICKEN-AMOUNT                     * Take user input for chicken amount.
               DISPLAY "Enter amount of chicken ordered (lbs): ".
           ACCEPT PORK-AMOUNT                        * Take user input for pork amount.
               DISPLAY "Enter amount of pork ordered (lbs): ".
           MULTIPLY BEEF-AMOUNT BY ONE-LB-BEEF        * Calculate total price for beef ordered.
               GIVING BEEF-TOTAL.
           MULTIPLY CHICKEN-AMOUNT BY ONE-LB-CHICKEN  * Calculate total price for chicken ordered.
               GIVING CHICKEN-TOTAL.
           MULTIPLY PORK-AMOUNT BY ONE-LB-PORK        * Calculate total price for pork ordered.
               GIVING PORK-TOTAL.
           ADD BEEF-TOTAL CHICKEN-TOTAL PORK-TOTAL    * Calculate total order price.
               GIVING ORDER-TOTAL.
           DISPLAY "Total order price: " ORDER-TOTAL  * Display total order price.
           STOP RUN.