IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROG.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3) VALUE 123.
       01 NUM2 PIC 9(3) VALUE 456.
       01 RESULT PIC 9(4).

       PROCEDURE DIVISION.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.

       DISPLAY 'The product of ' NUM1 ' and ' NUM2 ' is ' RESULT.

       STOP RUN.