IDENTIFICATION DIVISION.
PROGRAM-ID. CalculateAverage.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT InputFile ASSIGN TO 'input.txt'.    // select input file

DATA DIVISION.
FILE SECTION.
FD InputFile.
01 InputRecord.
    05 NumberOfNumbers PIC 9(2). // define Number of numbers
    05 NumbersList.
        10 InputNumber PIC 9(3). // define each input number

WORKING-STORAGE SECTION.
01 TotalNumber PIC 9(3) VALUE 0. // define total number
01 Sum PIC 9(6)V9(2) VALUE 0.    // define sum variable
01 Average PIC 9(6)V9(2).        // define average variable

PROCEDURE DIVISION.
    PERFORM OPEN-INPUT.         // open input file
    PERFORM READ-FILE UNTIL EOF.// read input file until end of file
    PERFORM CALCULATE-AVERAGE.  // calculate average
    PERFORM DISPLAY-RESULT.     // display result
    PERFORM CLOSE-FILE.         // close input file
    STOP RUN.

OPEN-INPUT.
    OPEN INPUT InputFile.

READ-FILE.
    READ InputFile INTO InputRecord.             // read next record
    ADD InputNumber TO Sum                       // add input number to sum
    UNSTRING NumbersList DELIMITED BY SPACE      // unstring numbers from list
        INTO InputNumber                          // store into input number
        COUNT IN NumberOfNumbers.                 // count number of numbers
    IF NumberOfNumbers = 0                        // check if all numbers are read
        SET EOF TO TRUE                           // set end of file flag
    END-IF.

CALCULATE-AVERAGE.
    DIVIDE Sum BY NumberOfNumbers GIVING Average. // calculate average

DISPLAY-RESULT.
    DISPLAY "Input Numbers: " .                   // display number of numbers
    MOVE NumbersList TO InputNumber               // move unstrung number to input number
    DISPLAY "Sum: " Sum                           // display sum
    DISPLAY "Average: " Average                   // display average

CLOSE-FILE.
    CLOSE InputFile.