IDENTIFICATION DIVISION.

PROGRAM-ID. MYPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 200.
01 NUM2 PIC 9(3) VALUE 100.
01 RESULT PIC 9(5) VALUE ZERO.

PROCEDURE DIVISION.
ADD NUM1 TO RESULT GIVING RESULT.
MULTIPLY NUM2 BY RESULT GIVING RESULT.

DISPLAY "The final result is: " RESULT.
STOP RUN.