IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
*
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-VARIABLE PIC X(10) VALUE 'HELLO WORLD'.
01 MY-NUMBER PIC 9(5) VALUE 98765.
*
PROCEDURE DIVISION.
MAIN-PROCESS.
    DISPLAY 'Current variable: ' MY-VARIABLE.
    DISPLAY 'Current number: ' MY-NUMBER.
    PERFORM CALCULATE-MY-NUMBER.
    DISPLAY 'Updated number: ' MY-NUMBER.
    STOP RUN.
*
CALCULATE-MY-NUMBER.
    MULTIPLY MY-NUMBER BY 2 GIVING MY-NUMBER.
    DIVIDE MY-NUMBER BY 3 GIVING MY-NUMBER.
    ADD 100 TO MY-NUMBER.
    PERFORM CHECK-NUMBER.
*
CHECK-NUMBER.
    IF MY-NUMBER > 500
        DISPLAY 'The number is greater than 500.'
    ELSE IF MY-NUMBER < 500
        DISPLAY 'The number is less than 500.'
    ELSE
        DISPLAY 'The number is equal to 500.'
    END-IF.