IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  X PIC 9(02).
           88  X-GREATER-THAN-10 VALUE 11 THRU 99.
       01  Y PIC 9(02).
       01  RESULT PIC S9(04) COMP.
       01  ERROR-MSG PIC X(30).
           88  ERROR-NEGATIVE VALUE "Result is negative".
           88  ERROR-OVERFLOW VALUE "Result is too large".
       PROCEDURE DIVISION.
       DISPLAY "Enter value for X: ".
       ACCEPT X.
       DISPLAY "Enter value for Y: ".
       ACCEPT Y.
       COMPUTE RESULT = X + Y.
       IF RESULT < 0 THEN
           MOVE ERROR-NEGATIVE TO ERROR-MSG
       ELSE IF RESULT > 9999 THEN
           MOVE ERROR-OVERFLOW TO ERROR-MSG
       END-IF.
       IF NOT (X-GREATER-THAN-10 AND Y < 10) THEN
           ADD 1000 TO RESULT
       END-IF.
       DISPLAY "Result: " RESULT.
       STOP RUN.