Identification Division.                        * Identifies the program
Program-ID. Hello-World.                         * Specifies the program name

Data Division.                                  * Defines data items used in the program
Working-Storage Section.
01 NameValue.
   05 Name      Pic X(20).
   05 Value     Pic 9(3).

Procedure Division.                             * Contains the actual instructions and logic of the program
Begin.                                          * Designates the starting point of the program
   Move "John" to NameValue (1:Name).            * Assigns the value "John" to the Name variable
   Move 25 to ValueValue (1:Value).              * Assigns the value "25" to the Value variable
    
   Display "Hello " Name "!"                     * Displays the message "Hello John!" to the user
   If Value > 50                                * Checks if the value is greater than 50
      Display "You're over 50 years old!"        * Displays the message "You're over 50 years old!" to the user
   End-If.                                      * Ends the if statement
   Display "Have a nice day!"                    * Displays the message "Have a nice day!" to the user
   
   Stop.                                         * Terminates the program
End.                                            * Designates the end of the program