IDENTIFICATION DIVISION.                               * Start of program
       PROGRAM-ID. HELLO-WORLD.                                * Program name
       AUTHOR. YOUR-NAME.                                      * Author name
                                                                
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. MY-COMPUTER.
       OBJECT-COMPUTER. MY-COMPUTER.
                                                                
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME           PIC X(20) VALUE 'WORLD'.
       01 WS-OUTPUT         PIC X(30).
                                                                
       PROCEDURE DIVISION.
       DISPLAY 'HELLO ' WS-NAME.                               * Display 'HELLO WORLD'
       ADD 1 TO WS-OUTPUT.                                     * Add 1 to output variable
       DISPLAY WS-OUTPUT.                                      * Display output variable
                                                                
       STOP RUN.                                               * End of program
       END PROGRAM HELLO-WORLD.                                * End program name