IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATION-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE-NAME ASSIGN TO "input.txt".
           SELECT OUT-FILE-NAME ASSIGN TO "output.txt".

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE-NAME
           LABEL RECORDS ARE OMITTED.
       01 IN-RECORD.
           05 IN-ACC-NUMBER   PIC 9(5).
           05 IN-AMOUNT       PIC 9(11)V99.
           05 FILLER          PIC X(49).

       FD OUT-FILE-NAME
           LABEL RECORDS ARE OMITTED.
       01 OUT-RECORD.
           05 OUT-ACC-NUMBER PIC 9(5).
           05 OUT-INTEREST   PIC 9(11)V99.

       WORKING-STORAGE SECTION.
       01 TOTAL-INTEREST        PIC 9(11)V99.

       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT IN-FILE-NAME
           OPEN OUTPUT OUT-FILE-NAME

           PERFORM UNTIL IN-FILE-NAME AT END
               READ IN-FILE-NAME
                   AT END
                       EXIT.
               IF IN-AMOUNT > 5000
                   COMPUTE TOTAL-INTEREST = IN-AMOUNT * .05
               ELSE
                   COMPUTE TOTAL-INTEREST = IN-AMOUNT * .03
               END-IF
               MOVE IN-ACC-NUMBER TO OUT-ACC-NUMBER
               MOVE TOTAL-INTEREST TO OUT-INTEREST
               WRITE OUT-RECORD
           END-PERFORM

           CLOSE IN-FILE-NAME
           CLOSE OUT-FILE-NAME
           STOP RUN.