IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-A PIC 9(4) VALUE 1234.          *Declare variable NUM-A with 4 digits and initial value of 1234
01 NUM-B PIC 9(4) VALUE 4321.          *Declare variable NUM-B with 4 digits and initial value of 4321
01 RESULT PIC 9(8).                    *Declare variable RESULT with 8 digits for storing the result

PROCEDURE DIVISION.
    MULTIPLY NUM-A BY NUM-B GIVING RESULT.   *Multiply NUM-A and NUM-B, store the result in RESULT

    DISPLAY "The result is: " RESULT.        *Display the result to the user
    STOP.                                    *Stop the execution of the program