IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALES.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 SALES-TABLE.
05 SALES OCCURS 4 TIMES
      INDEXED BY WS-SALES-INDEX
      ASCENDING KEY IS WS-SALES-ID
      ASCENDING KEY IS WS-SALES-MONTH.
   10 WS-SALES-ID PIC 9(3).
   10 WS-SALES-MONTH PIC 9(2).
   10 WS-SALES-AMOUNT PIC 9(6).
   10 WS-SALES-COUNTRY PIC X(10).

01 TOTAL-SALES.
   05 SALES-TOTALS.
      10 SALES-TOTAL PIC 9(6).
      10 COUNTRY-TOTAL PIC 9(6).
   05 OFFICE-TOTALS.
      10 USA-TOTAL PIC 9(6).
      10 EUROPE-TOTAL PIC 9(6).

LINKAGE SECTION.
01 WS-MAX-LENGTH PIC 9(2).

PROCEDURE DIVISION USING WS-MAX-LENGTH.

MAIN-LOGIC-SECTION.
   PERFORM INITIALIZATION-ROUTINE THRU INITIALIZATION-RT-EXIT
   PERFORM PROCESS-SALES-ROUTINE THRU PROCESS-SALES-RT-EXIT
   PERFORM CALCULATE-TOTALS-ROUTINE THRU CALCULATE-TOTALS-RT-EXIT
   PERFORM PRINT-REPORT-ROUTINE THRU PRINT-REPORT-RT-EXIT.

INITIALIZATION-ROUTINE.
   INITIALIZE SALES-TABLE
      PERFORM VARYING WS-SALES-INDEX FROM 1 BY 1
        UNTIL WS-SALES-INDEX > WS-MAX-LENGTH
        MOVE WS-SALES-INDEX TO WS-SALES-ID (WS-SALES-INDEX)
        MOVE FUNCTION NUMVAL(WS-SALES-INDEX) TO WS-SALES-MONTH (WS-SALES-INDEX)
        MOVE FUNCTION NUMVAL(WS-SALES-INDEX * 100) TO WS-SALES-AMOUNT (WS-SALES-INDEX)
        MOVE FUNCTION NUMVAL(WS-SALES-INDEX + 1) TO WS-SALES-COUNTRY (WS-SALES-INDEX)
      END-PERFORM.

PROCESS-SALES-ROUTINE.
   PERFORM VARYING WS-SALES-INDEX FROM 1 BY 1
      UNTIL WS-SALES-INDEX > WS-MAX-LENGTH
      IF WS-SALES-MONTH (WS-SALES-INDEX) > 6
         ADD 10000 TO WS-SALES-AMOUNT (WS-SALES-INDEX)
      ELSE
         SUBTRACT 5000 FROM WS-SALES-AMOUNT (WS-SALES-INDEX)
      END-IF
   END-PERFORM.

CALCULATE-TOTALS-ROUTINE.
   PERFORM VARYING WS-SALES-INDEX FROM 1 BY 1
      UNTIL WS-SALES-INDEX > WS-MAX-LENGTH
      IF WS-SALES-COUNTRY (WS-SALES-INDEX) = 'USA'
         ADD WS-SALES-AMOUNT (WS-SALES-INDEX) TO USA-TOTAL
      ELSE
         ADD WS-SALES-AMOUNT (WS-SALES-INDEX) TO EUROPE-TOTAL
      END-IF
      ADD WS-SALES-AMOUNT (WS-SALES-INDEX) TO SALES-TOTAL
   END-PERFORM.

PRINT-REPORT-ROUTINE.
   DISPLAY "*** SALES REPORT ***"
   DISPLAY "TOTAL SALES:" SALES-TOTAL
   DISPLAY "TOTAL USA SALES:" USA-TOTAL
   DISPLAY "TOTAL EUROPE SALES:" EUROPE-TOTAL.

INITIALIZATION-RT-EXIT.
   EXIT.

PROCESS-SALES-RT-EXIT.
   EXIT.

CALCULATE-TOTALS-RT-EXIT.
   EXIT.

PRINT-REPORT-RT-EXIT.
   EXIT.

END PROGRAM CALCULATE-SALES.