IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VAR-A  PIC 9(3).
01 VAR-B  PIC 9(3).
01 VAR-C  PIC S9(4) COMP.
PROCEDURE DIVISION.
    PERFORM INITIALIZE-VARIABLES.
    PERFORM GET-VALUES.
    PERFORM CALCULATE-RESULT.
    DISPLAY "The calculated result is: " VAR-C.
    STOP RUN.
INITIALIZE-VARIABLES.
    MOVE 0 TO VAR-A.
    MOVE 0 TO VAR-B.
    MOVE 0 TO VAR-C.
GET-VALUES.
    DISPLAY "Enter value for VAR-A: ".
    ACCEPT VAR-A.
    DISPLAY "Enter value for VAR-B: ".
    ACCEPT VAR-B.
CALCULATE-RESULT.
    ADD VAR-A VAR-B GIVING VAR-C.
    IF VAR-C IS NEGATIVE
        MULTIPLY -1 BY VAR-C GIVING VAR-C
    END-IF.