IDENTIFICATION DIVISION.
      PROGRAM-ID. ADDEXAMPLE.
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      01 NUMBER-1 PIC 9(3).
      01 NUMBER-2 PIC 9(3).
      01 RESULT PIC 9(5).
      PROCEDURE DIVISION.
          DISPLAY "Enter first number: ".
          ACCEPT NUMBER-1.
          DISPLAY "Enter second number: ".
          ACCEPT NUMBER-2.
          COMPUTE RESULT = NUMBER-1 + NUMBER-2.
          DISPLAY "The sum is: " RESULT.
      STOP RUN.