IDENTIFICATION DIVISION.				*Start of the program identification division
PROGRAM-ID. SAMPLE-PROGRAM.			*Declaring the program name as "SAMPLE-PROGRAM"

DATA DIVISION.						*Start of the data division
WORKING-STORAGE SECTION.			*Defining working storage section where variables are declared
01 COUNT-VARIABLE PIC 99 VALUE ZEROS.	*Declaring a variable named COUNT-VARIABLE as a 2-digit numeric with an initial value of 0

PROCEDURE DIVISION.					*Start of the procedure division
DISPLAY 'This program will count from 1 to 10.'	*Displaying a message to the user
PERFORM VARYING COUNT-VARIABLE		*Start of a perform loop
	FROM 1 BY 1 UNTIL COUNT-VARIABLE > 10	*Loop will execute 10 times
	DISPLAY 'Current count is ' COUNT-VARIABLE	*Displaying the current count to the user
END-PERFORM.						*End of the perform loop

STOP RUN.							*End of the program