IDENTIFICATION DIVISION.
PROGRAM-ID. CALC_PROG.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1.
    05 NUM1A.
       10 NUM1AA PIC 9(5).
    05 NUM1B.
       10 NUM1BB PIC 9(5).
01 NUM2.
    05 NUM2A PIC 9(5).
    05 NUM2B PIC 9(5).
01 RESULT.
    05 RESA PIC 9(5).
    05 RESB PIC 9(5).
PROCEDURE DIVISION.
    DISPLAY "Enter first number: ".
    ACCEPT NUM1AA.
    DISPLAY "Enter second number: ".
    ACCEPT NUM1BB.
    MOVE NUM1 TO RESULT.
    MOVE NUM2 TO RESULT.
    ADD NUM2A, NUM1B GIVING RESB.
    ADD NUM2B, NUM1A GIVING RESA.
    DISPLAY "The result is: ".
    DISPLAY RESULT.
STOP RUN.