IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-FIRST-NUMBER PIC 9(2) VALUE 10.
01 WS-SECOND-NUMBER PIC 9(2) VALUE 20.
01 WS-THIRD-NUMBER PIC 9(2) VALUE 0.
01 WS-RESULT PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM MULTIPLY-VALUES VARYING WS-THIRD-NUMBER FROM 1 BY 1 UNTIL WS-THIRD-NUMBER > WS-FIRST-NUMBER
                            COMPUTE WS-RESULT = WS-RESULT + (WS-SECOND-NUMBER * WS-THIRD-NUMBER)
                    END-PERFORM.
    DISPLAY 'The final result is ' WS-RESULT.
MULTIPLY-VALUES.
    PERFORM MULTIPLY-TWICE VARYING WS-FIRST-NUMBER FROM 1 BY 1 UNTIL WS-FIRST-NUMBER > 5
                    END-PERFORM.
MULTIPLY-TWICE.
    MULTIPLY WS-FIRST-NUMBER BY WS-SECOND-NUMBER GIVING WS-RESULT.
    MULTIPLY WS-RESULT BY WS-THIRD-NUMBER.
    DISPLAY "The result after multiplying twice is " WS-RESULT.