IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-REVENUE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TOTAL-SALES       PIC 9(8)V99.
       01 EXPENSES          PIC 9(8)V99.
       01 TOTAL-REVENUE     PIC 9(8)V99.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           MOVE 500.00 TO TOTAL-SALES.
           MOVE 275.00 TO EXPENSES.
           SUBTRACT EXPENSES FROM TOTAL-SALES GIVING TOTAL-REVENUE.
           DISPLAY "Total revenue is " TOTAL-REVENUE.
           STOP RUN.