IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 GREETING PIC X(15) VALUE "HELLO, WORLD!".
PROCEDURE DIVISION.
DISPLAY GREETING.
STOP RUN.