IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-PARA.
    05 NUM-ONE PIC 9 VALUE 1.
    05 NUM-TWO PIC 9 VALUE 2.
    05 NUM-THREE PIC 9 VALUE 3.
01 TOTAL PIC 9(3).

PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM CALCULATE-VALUES
    DISPLAY "The total is: " TOTAL
    STOP RUN.
    
CALCULATE-VALUES.
    MULTIPLY NUM-ONE BY NUM-TWO GIVING TOTAL
    ADD NUM-THREE TO TOTAL.
    
END PROGRAM HELLO-WORLD.