IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'INPUT.TXT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
           01 INPUT-RECORD.
               05 FIRST-NUMBER PIC 9(3).
               05 SECOND-NUMBER PIC 9(3).
       FD OUTPUT-FILE.
           01 OUTPUT-RECORD.
              05 RESULT PIC 9(4).
       WORKING-STORAGE SECTION.
           01 FIRST-NUMBER-NUMERIC PIC 9(3).
           01 SECOND-NUMBER-NUMERIC PIC 9(3).
           01 RESULT-NUMERIC PIC 9(4).
           01 OUTPUT-STRING PIC X(20).
       PROCEDURE DIVISION.
       START.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.
           PERFORM UNTIL INPUT-FILE NOT AT END
               READ INPUT-FILE INTO INPUT-RECORD
               MOVE FIRST-NUMBER TO FIRST-NUMBER-NUMERIC
               MOVE SECOND-NUMBER TO SECOND-NUMBER-NUMERIC
               COMPUTE RESULT-NUMERIC = FIRST-NUMBER-NUMERIC + SECOND-NUMBER-NUMERIC
               MOVE RESULT-NUMERIC TO RESULT
               MOVE 'The result is: ' TO OUTPUT-STRING
               WRITE OUTPUT-RECORD FROM OUTPUT-STRING
           END-PERFORM.
           CLOSE INPUT-FILE.
           CLOSE OUTPUT-FILE.
           STOP RUN.