IDENTIFICATION DIVISION. 
       * This is a sample program in COBOL
 PROGRAM-ID. SAMPLE. 
       * This program reads two numbers and displays their sum 
 DATA DIVISION. 
       * Declaring variables
       WORKING-STORAGE SECTION. 
       01 NUM1 PIC 9(5). 
       01 NUM2 PIC 9(5). 
       01 SUM PIC 9(5). 
       * Declaring constants
       LOCAL-STORAGE SECTION.
       01 MAX-NUM PIC 9(5) VALUE 99999.
       01 MIN-NUM PIC 9(5) VALUE -99999.
       PROCEDURE DIVISION. 
 PROGRAM-BEGIN. 
       * Asking for user input
       DISPLAY "Enter first number:" 
       ACCEPT NUM1.
       DISPLAY "Enter second number:" 
       ACCEPT NUM2.
       * Checking if numbers are within range
       IF NUM1 > MAX-NUM
           DISPLAY "Error: First number must be less than " MAX-NUM "."
           GO TO PROGRAM-END.
       END-IF.
       IF NUM2 > MAX-NUM
           DISPLAY "Error: Second number must be less than " MAX-NUM "."
           GO TO PROGRAM-END.
       END-IF.
       IF NUM1 < MIN-NUM
           DISPLAY "Error: First number must be greater than " MIN-NUM "."
           GO TO PROGRAM-END.
       END-IF.
       IF NUM2 < MIN-NUM
           DISPLAY "Error: Second number must be greater than " MIN-NUM "."
           GO TO PROGRAM-END.
       END-IF.
       * Calculating sum
       COMPUTE SUM = NUM1 + NUM2. 
       * Displaying result
       DISPLAY "The sum of " NUM1 " and " NUM2 " is " SUM.
 PROGRAM-END. 
       STOP RUN.