IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       
       ENVIRONMENT DIVISION.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT FILE-INPUT ASSIGN TO 'input-file.txt'.
       SELECT FILE-OUTPUT ASSIGN TO 'output-file.txt'.

       DATA DIVISION.
       
       FILE SECTION.
       FD FILE-INPUT.
       01 INPUT-RECORD.
       05 IN-NAME         PIC X(20).
       05 IN-AGE          PIC 99.
       05 IN-GENDER       PIC X.
       05 IN-COUNTRY      PIC X(10).

       FD FILE-OUTPUT.
       01 OUTPUT-RECORD.
       05 OUT-NAME        PIC X(20).
       05 OUT-GREETING    PIC X(40).
       
       WORKING-STORAGE SECTION.
       01 COUNT            PIC 99.
       01 MESSAGE          PIC X(50) VALUE 'Welcome to COBOL, '.
       
       PROCEDURE DIVISION.
       OPEN INPUT FILE-INPUT
       OPEN OUTPUT FILE-OUTPUT
       READ FILE-INPUT
       PERFORM UNTIL EOF
            MOVE IN-NAME TO OUT-NAME
            COMPUTE OUT-GREETING = MESSAGE + IN-COUNTRY
            DISPLAY OUT-GREETING
            WRITE OUTPUT-RECORD 
            READ FILE-INPUT
       END-PERFORM.
       
       CLOSE FILE-INPUT
       CLOSE FILE-OUTPUT
       STOP RUN.