IDENTIFICATION DIVISION.
PROGRAM-ID. PROG-1.
AUTHOR. JOHN DOE.
DATE-WRITTEN. '12-AUG-2020'.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-STR PIC X(50) VALUE 'Hello World!'.
01 OUTPUT-STR PIC X(50).

PROCEDURE DIVISION.
    PERFORM UPPERCASE-CONVERT.
    DISPLAY 'Converted String: ' OUTPUT-STR.
    STOP RUN.

UPPERCASE-CONVERT.
    MOVE FUNCTION UPPER(INPUT-STR) TO OUTPUT-STR.
    EXIT.