IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COUNT PIC 9(3) VALUE ZERO.
01 TOTAL PIC 9(6)V99 VALUE ZERO.
01 NUMBER-ARRAY.
    05 NUMBER-TABLE OCCURS 6 TIMES.
        10 NUMBER PIC 9(3).

PROCEDURE DIVISION.
MAIN-PARAGRAPH.

    PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 6
        COMPUTE TOTAL = TOTAL + NUMBER-ARRAY(COUNT)
    END-PERFORM.

    EVALUATE TRUE
        WHEN TOTAL > 1000
            DISPLAY "The total is greater than 1000."
        WHEN TOTAL < 1000
            DISPLAY "The total is less than 1000."
        WHEN OTHER
            DISPLAY "The total is equal to 1000."
    END-EVALUATE.

STOP RUN.