IDENTIFICATION DIVISION.
      PROGRAM-ID. SNIPPET.

      DATA DIVISION.
      WORKING-STORAGE SECTION.

      01 INPUT-DATA.
         05 INPUT-NUM  PIC 9(9).
         05 INPUT-NAME PIC X(20).

      01 RESULT-DATA.
         05 RESULT-NUM PIC 9(9).

      PROCEDURE DIVISION.

      PERFORM GET-INPUT.
      PERFORM CALCULATE-NUM USING INPUT-NUM
                                RESULT-NUM.
      PERFORM DISPLAY-RESULT.

      STOP RUN.

      GET-INPUT.
          DISPLAY "Please enter a number:".
          ACCEPT INPUT-NUM.

      CALCULATE-NUM USING VALUE IN NUM1.
          MULTIPLY INPUT-NUM BY 10
          GIVING RESULT-NUM.

      DISPLAY-RESULT.
          DISPLAY "The result of multiplying the input number by 10 is: "
          RESULT-NUM.