01  VARIABLE-LIST.
         05  FIRST-VAR         PICTURE IS X(10).
         05  SECOND-VAR        PICTURE IS 9(8)V99.
         05  THIRD-VAR         PICTURE IS S9(3).
         05  FOURTH-VAR        PICTURE IS 9(5).

     01  OUTPUT-LIST.
         05  OUTPUT-HEADER.
             10    HEADER1     PICTURE IS X(10)          VALUE "HEADER1".
             10    HEADER2     PICTURE IS X(20)          VALUE "HEADER2".
             10    HEADER3     PICTURE IS X(15)          VALUE "HEADER3".

         05  OUTPUT-DATA.
             10  DATA-LINE OCCURS 10 TIMES.
                 15    ALL-VARS    PICTURE IS X(30).
                 15    DISPLAY-VARS.
                     20    DISPLAY1    PICTURE IS X(6).
                     20    DISPLAY2    PICTURE IS X(10).
                     20    DISPLAY3    PICTURE IS X(8).
                     20    DISPLAY4    PICTURE IS X(5).

     01  PROCESS-DATA.
         PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
             COMPUTE THIRD-VAR = FIRST-VAR + I
             COMPUTE FOURTH-VAR = SECOND-VAR / THIRD-VAR
             STRING FIRST-VAR " " SECOND-VAR " " THIRD-VAR " " FOURTH-VAR
                 DELIMITED BY SIZE
                 INTO OUTPUT-LIST.OUTPUT-DATA.DATA-LINE(I).ALL-VARS

         DISPLAY HEADER1 HEADER2 HEADER3
         DISPLAY OUTPUT-LIST.OUTPUT-DATA