IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-TOTAL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TRANSACTION-FILE ASSIGN TO 'TRANSACTIONS.DAT'
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD TRANSACTION-FILE.
01 TRANSACTION-RECORD.
    05 TRANSACTION-ID PIC X(6).
    05 TRANSACTION-DATE PIC 9(8).
    05 TRANSACTION-AMOUNT PIC S9(7). 

WORKING-STORAGE SECTION.
01 COUNT PIC 9(3) VALUE 0.
01 TOTAL-AMOUNT PIC S9(9)V99 VALUE 0.

PROCEDURE DIVISION.
OPEN INPUT TRANSACTION-FILE
PERFORM UNTIL EOF = 'Y'
    READ TRANSACTION-FILE
    AT END
        MOVE 'Y' TO EOF
    NOT AT END
        ADD 1 TO COUNT
        COMPUTE TOTAL-AMOUNT = TOTAL-AMOUNT + TRANSACTION-AMOUNT
        DISPLAY TRANSACTION-ID 'has a transaction amount of ' TRANSACTION-AMOUNT
END-PERFORM
CLOSE TRANSACTION-FILE

DISPLAY 'The total number of transactions is ' COUNT
DISPLAY 'The total amount of all transactions is ' TOTAL-AMOUNT.

STOP RUN.