*> This is a program to calculate payroll for employees of a company

IDENTIFICATION DIVISION.
PROGRAM-ID. PAYROLL.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO DISK
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO DISK
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 EMPLOYEE-RECORD.
    05 EMPLOYEE-ID                PIC 9(6).
    05 EMPLOYEE-NAME              PIC X(20).
    05 EMPLOYEE-DEPARTMENT        PIC 9.
    05 EMPLOYEE-HOURS-WORKED      PIC 9(2).
    05 EMPLOYEE-PAY-RATE          PIC 9(4)V99.
FD OUTPUT-FILE.
01 PAYROLL-RECORD.
    05 EMPLOYEE-ID                PIC 9(6).
    05 EMPLOYEE-NAME              PIC X(20).
    05 EMPLOYEE-PAY               PIC 9(4)V99.

WORKING-STORAGE SECTION.
01 TOTAL-PAY                     PIC 9(5)V99.
01 TOTAL-HOURS-WORKED            PIC 9(3).
01 TOTAL-EMPLOYEES               PIC 9(3).
01 COUNTER                       PIC 9(3).

PROCEDURE DIVISION.
    OPEN INPUT INPUT-FILE
        OUTPUT OUTPUT-FILE.

    PERFORM UNTIL EOF
        READ INPUT-FILE
            AT END SET EOF TO TRUE
        END-READ
        IF NOT EOF
        THEN
            PERFORM CALCULATE-PAY
            PERFORM WRITE-RECORD
        END-IF
    END-PERFORM.

CLOSE INPUT-FILE
    OUTPUT-FILE.

STOP RUN.

CALCULATE-PAY SECTION.
    MULTIPLY EMPLOYEE-HOURS-WORKED BY EMPLOYEE-PAY-RATE
    GIVING EMPLOYEE-PAY.
    ADD EMPLOYEE-PAY TO TOTAL-PAY.
    ADD EMPLOYEE-HOURS-WORKED TO TOTAL-HOURS-WORKED.
    ADD 1 TO TOTAL-EMPLOYEES.

WRITE-RECORD SECTION.
    MOVE EMPLOYEE-ID TO PAYROLL-RECORD.EMPLOYEE-ID.
    MOVE EMPLOYEE-NAME TO PAYROLL-RECORD.EMPLOYEE-NAME.
    MOVE EMPLOYEE-PAY TO PAYROLL-RECORD.EMPLOYEE-PAY.
    WRITE PAYROLL-RECORD.

EOF SECTION.
    DISPLAY "Total pay for all employees: " TOTAL-PAY.
    DISPLAY "Total hours worked for all employees: " TOTAL-HOURS-WORKED.
    DISPLAY "Total number of employees: " TOTAL-EMPLOYEES.

END PROGRAM PAYROLL.