IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INFILE ASSIGN TO 'INPUT.TXT'.
       SELECT OUTFILE ASSIGN TO 'OUTPUT.TXT'.

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INPUT-LINE PIC X(20).
       FD OUTFILE.
       01 OUTPUT-LINE PIC X(20).

       PROCEDURE DIVISION.
       OPEN INPUT INFILE
       OPEN OUTPUT OUTFILE

       READ INFILE
           AT END
               MOVE 'END OF FILE' TO OUTPUT-LINE
               WRITE OUTPUT-LINE
               GO TO CLOSE-FILES
           NOT AT END
	           DISPLAY INPUT-LINE
               MOVE INPUT-LINE TO OUTPUT-LINE
               WRITE OUTPUT-LINE
               GO TO READ-INFILE
       CLOSE-FILES.
       CLOSE INFILE
       CLOSE OUTFILE.

       STOP RUN.