WORKING-STORAGE SECTION.
       01 SALES-INFO-ITEMS.
          03 SALES-DATE-ITEM PIC 9(8).
          03 SALES-AMOUNT-ITEM PIC $999,999.99.
       01 PENDING-SALES-ITEMS.
          03 PENDING-DATE-ITEM PIC 9(8).
          03 PENDING-AMOUNT-ITEM PIC $999,999.99.
       01 TOTAL-SALES-INFO.
          03 CURRENT-YEAR PIC 9(4).
          03 SALES-INFO-ARRAY.
             05 SALES-INFO OCCURS 12 TIMES
                INDEXED BY MONTH-INDEX.
                07 SALES-MONTH-NAME PIC X(10).
                07 SALES-INFO-TOTAL.
                   09 SALES-AMOUNT-TOTAL PIC $999,999.99.
                   09 PENDING-AMOUNT-TOTAL PIC $999,999.99.
       PROCEDURE DIVISION.
           PERFORM INITIALIZE-VARIABLES.
           PERFORM GET-SALES-INFO FOR MONTH-INDEX FROM 1 TO 12.
           PERFORM CALCULATE-TOTAL-SALES FOR MONTH-INDEX FROM 1 TO 12.
           PERFORM OUTPUT-SALES-INFO FOR MONTH-INDEX FROM 1 TO 12.
           INITIALIZATION SECTION.
               MOVE FUNCTION CURRENT_DATE (1:4) TO CURRENT-YEAR.
           GET-SALES-INFO SECTION.
               ACCEPT SALES-DATE-ITEM FROM CURRENT_DATE (5:4).
               DISPLAY "Enter sales amount for month " MONTH-INDEX ": "
               ACCEPT SALES-AMOUNT-ITEM.
               MOVE SALES-AMOUNT-ITEM TO SALES-INFO (MONTH-INDEX).
           CALCULATE-TOTAL-SALES SECTION.
               ADD SALES-AMOUNT-TOTAL OF SALES-INFO (MONTH-INDEX) TO SALES-INFO-TOTAL.
               ADD PENDING-AMOUNT-TOTAL OF SALES-INFO (MONTH-INDEX) TO PENDING-AMOUNT.
           OUTPUT-SALES-INFO SECTION.
               DISPLAY "Total sales for month " MONTH-INDEX ": " SALES-INFO-TOTAL.
               DISPLAY "Total pending sales for month " MONTH-INDEX ": " PENDING-AMOUNT-TOTAL.