IDENTIFICATION DIVISION.
       PROGRAM-ID. CPROG.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ONE        PIC S9(6)V99 VALUE 1234.56.
       01 NUM-TWO        PIC S9(6)V99 VALUE 7890.12.
       01 NUM-RESULT     PIC S9(6)V99 VALUE ZERO.
       PROCEDURE DIVISION.
       PERFORM MULTIPLY-TWO-NUMBERS.
       DISPLAY 'The result of multiplying ' NUM-ONE ' and ' NUM-TWO ' is ' NUM-RESULT.
       MULTIPLY-TWO-NUMBERS.
       MULTIPLY NUM-ONE BY NUM-TWO GIVING NUM-RESULT.
       EXIT