IDENTIFICATION DIVISION. 
PROGRAM-ID. MultipyNumbers.
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01 NumA PIC 9(3). 
01 NumB PIC 9(3). 
01 Result PIC 9(6). 

PROCEDURE DIVISION. 
MULTIPLY NumA BY NumB GIVING Result. 

STOP RUN.