EVALUATE TRUE
          WHEN (CONDITION-1)
              PERFORM FIRST-PERFORM-ROUTINE
          WHEN (CONDITION-2)
              PERFORM SECOND-PERFORM-ROUTINE
          WHEN (CONDITION-3)
              PERFORM THIRD-PERFORM-ROUTINE
          WHEN (CONDITION-4)
              PERFORM FOURTH-PERFORM-ROUTINE
          WHEN (CONDITION-5)
              PERFORM FIFTH-PERFORM-ROUTINE
          WHEN OTHER
              PERFORM DEFAULT-PERFORM-ROUTINE
      END-EVALUATE