IDENTIFICATION DIVISION.                            * This line identifies the program division
       PROGRAM-ID. CALCULATE-AREA.                          * The program name is 'CALCULATE-AREA'
       AUTHOR. JOHN SMITH.                                  * The name of the programmer
       DATE-WRITTEN. 10/10/2021.                            * The date the program was written

       ENVIRONMENT DIVISION.                                * Defines the environment for the program
       CONFIGURATION SECTION.                               * This section initializes the environment
       SOURCE-COMPUTER. IBM-PC.                             * The name of the computer system
       OBJECT-COMPUTER. IBM-PC.                             * The name of the computer system for generating object code

       DATA DIVISION.                                       * Defines the data used in the program
       WORKING-STORAGE SECTION.                             * Variables declared in this section are used throughout the program
       01 LENGTH-IN-INCHES PIC 9(3).                         * Variable to hold the length in inches
       01 WIDTH-IN-INCHES PIC 9(3).                          * Variable to hold the width in inches
       01 AREA-IN-SQUARE-INCHES PIC 9(5).                    * Variable to hold the calculated area in square inches

       PROCEDURE DIVISION.                                   * Contains the instructions and logic for the program
       MAIN-LOGIC SECTION.                                   * Main logic of the program
       DISPLAY "Please enter the length in inches:"          * Prompt user for input
       ACCEPT LENGTH-IN-INCHES.                              * Get user input for length
       DISPLAY "Please enter the width in inches:"           * Prompt user for input
       ACCEPT WIDTH-IN-INCHES.                               * Get user input for width
       COMPUTE AREA-IN-SQUARE-INCHES =                         * Calculate the area 
           LENGTH-IN-INCHES * WIDTH-IN-INCHES.               * Multiplication operation
       DISPLAY "The calculated area in square inches is:"    * Output the result
       DISPLAY AREA-IN-SQUARE-INCHES.                        * Display the calculated area
       STOP RUN.                                             * End the program