IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT INPUT-FILE ASSIGN TO "INPUT.DAT"
             ORGANIZATION IS LINE SEQUENTIAL.
          SELECT OUTPUT-FILE ASSIGN TO "OUTPUT.DAT"
             ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD.
          05 INPUT-NUM1         PIC 9(3).
          05 INPUT-NUM2         PIC 9(3).
       FD OUTPUT-FILE.
       01 OUTPUT-RECORD            PIC 9(5).
       WORKING-STORAGE SECTION.
       01 NUM1                     PIC 9(3).
       01 NUM2                     PIC 9(3).
       01 SUM                      PIC 9(4).
       01 END-OF-FILE              PIC X(3) VALUE 'NO '.
       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
           OUTPUT OUTPUT-FILE.
       PERFORM UNTIL END-OF-FILE = 'YES'
          READ INPUT-FILE INTO INPUT-RECORD
          AT END MOVE 'YES' TO END-OF-FILE
          NOT AT END
             MOVE INPUT-NUM1 TO NUM1
             MOVE INPUT-NUM2 TO NUM2
             ADD NUM1, NUM2 GIVING SUM
             MOVE SUM TO OUTPUT-RECORD
             WRITE OUTPUT-RECORD
       END-PERFORM.
       CLOSE INPUT-FILE
             OUTPUT-FILE.
       STOP RUN.