PROGRAM-ID. ComplexProgram.                       // Program Name
       AUTHOR. Jane Doe.                                 // Author Name
       ENVIRONMENT DIVISION.                             // Contains info about system
       INPUT-OUTPUT SECTION.                             // Declaration of input/output files
       FILE-CONTROL.                                     // Controls data flow between program and files
       SELECT InputFile ASSIGN TO "InputFile.dat".        // Selects input file to be read
       SELECT OutputFile ASSIGN TO "OutputFile.dat".      // Selects output file to be written to
       DATA DIVISION.                                     // Contains declaration of data variables
       FILE SECTION.                                      // Declaration of files used in program
       FD InputFile.                                      // File Descriptor for input file
       01 InputData.                                      // Data structure for input data
           03 InputVar1     PIC X(10).                    // Variable for first input value
           03 InputVar2     PIC 9(5).                     // Variable for second input value
           03 InputVar3     PIC 9(5) COMP-3.              // Variable for third input value
       FD OutputFile.                                     // File Descriptor for output file
       01 OutputData.                                     // Data structure for output data
           03 OutputVar1     PIC X(10).                   // Variable for first output value
           03 OutputVar2     PIC 9(5).                    // Variable for second output value
           03 OutputVar3     PIC 9(5) COMP-3.             // Variable for third output value
       WORKING-STORAGE SECTION.                           // Contains temporary variables used in program
       01 TempData.                                        // Data structure for temporary data
           03 TempVar1      PIC X(10).                    // Variable for temporary string value
           03 TempVar2      PIC 9(5).                     // Variable for temporary integer value
           03 TempVar3      PIC 9(5) COMP-3.              // Variable for temporary packed decimal value
       PROCEDURE DIVISION.                                // Main logic of the program
       OPEN INPUT InputFile.                              // Opens input file for reading
       OPEN OUTPUT OutputFile.                            // Opens output file for writing
       PERFORM UNTIL InputFile NOT AT END                  // Loop until end of input file is reached
           READ InputFile INTO InputData.                 // Read one record from input file
           IF InputVar1 = 'STRING1' THEN                  // Check condition for first input variable
               MOVE 'New String' TO OutputVar1.           // Change value of first output variable
           ELSE                                            // If condition is not met
               MOVE InputVar1 TO OutputVar1.              // Keep original value for first output variable
           END-IF.
           DIVIDE InputVar2 BY 3 GIVING TempVar2.          // Perform calculation and store in temporary variable
           MOVE TempVar2 TO OutputVar2.                    // Move temporary variable value to second output variable
           MOVE InputVar3 TO TempVar3.                     // Move third input variable to temporary variable
           IF TempVar3 < 1000 THEN                         // Check condition for temporary variable
               ADD 1000 TO TempVar3.                       // Perform operation on temporary variable
           ELSE                                            // If condition is not met
               SUBTRACT 1000 FROM TempVar3.                // Perform different operation on temporary variable
           END-IF.
           MOVE TempVar3 TO OutputVar3.                    // Move temporary variable value to third output variable
           WRITE OutputData.                              // Write output data to output file
       END-PERFORM.
       CLOSE InputFile.                                   // Close input file
       CLOSE OutputFile.                                  // Close output file
       STOP RUN.                                          // End of program execution