IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY-ARRAY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ELEMENTS PIC 9(4).
       01 INPUT-ARRAY OCCURS 0 TO 999 TIMES 
          DEPENDING ON NUM-ELEMENTS 
          INDEXED BY INDEX.
          05 INPUT-NUMBER PIC 9(4).

       PROCEDURE DIVISION.
       MULTIPLY-ARRAY.
          COMPUTE INDEX = 1
          PERFORM UNTIL INDEX > NUM-ELEMENTS
             MULTIPLY INPUT-NUMBER (INDEX) BY 2
             ADD 1 TO INDEX
          END-PERFORM.

       STOP RUN.