IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DATA-FILE ASSIGN TO "INPUT.DAT"
               FILE STATUS IS WS-STATUS.
           SELECT REPORT-FILE ASSIGN TO "OUTPUT.RPT".
       DATA DIVISION.
       FILE SECTION.
       FD DATA-FILE.
       01 DATA-RECORD.
           05 DATA-ID PIC X(10).
           05 DATA-NAME PIC X(20).
           05 DATA-AGE PIC 99.
       SD REPORT-FILE.
       01 REPORT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-STATUS PIC 9.
       88 VALID-STATUS VALUE ZERO.
       88 INVALID-STATUS VALUE 1.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           OPEN INPUT DATA-FILE
           OPEN OUTPUT REPORT-FILE
           PERFORM READ-FILE UNTIL INVALID-STATUS
           CLOSE DATA-FILE
           CLOSE REPORT-FILE
           STOP RUN.
       READ-FILE.
           READ DATA-FILE
               AT END SET INVALID-STATUS TO TRUE
           IF VALID-STATUS
               MOVE DATA-RECORD TO REPORT-RECORD
               WRITE REPORT-RECORD
           END-IF.
       END PROGRAM SAMPLE-PROGRAM.