IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX-COBOL
DATA DIVISION.
WORKING-STORAGE SECTION.
07 NUM1 PIC 9 VALUE 50.
07 NUM2 PIC 9 VALUE 25.
07 RESULT PIC 9(3).

PROCEDURE DIVISION.
MULTIPLY NUM1 BY NUM2 GIVING RESULT.
ADD 10 TO RESULT GIVING RESULT.
IF RESULT GREATER THAN 100
    DISPLAY 'The result is greater than 100'
ELSE
    DISPLAY 'The result is less than 100'
END-IF.

STOP RUN.