IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRAY-LENGTH PIC S9(6) COMP.
       01 NUMARRAY-REC.
           05 NUMARR OCCURRED PIC 9(6) COMP
              INDEXED BY SUBSCR.
              05 NUMARR-ENTRY PIC 9(6) COMP.
       PROCEDURE DIVISION.
       PERFORM 100-INITIALIZATION.
       PERFORM 200-SORTNUMARRAY.
       PERFORM 300-PRINTNUMARRAY.
       STOP RUN.
       100-INITIALIZATION.
           MOVE 20 TO ARRAY-LENGTH.
           SET SUBSCR TO 1.
           DISPLAY "INPUT NUMBERS TO BE SORTED:".
           PERFORM UNTIL SUBSCR > ARRAY-LENGTH
               ACCEPT NUMARR-ENTRY(SUBSCR)
               ADD 1 TO SUBSCR
           END-PERFORM.
       200-SORTNUMARRAY.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I = ARRAY-LENGTH
               PERFORM VARYING J FROM 1 BY 1 UNTIL J = ARRAY-LENGTH
                   IF NUMARR-ENTRY(J) > NUMARR-ENTRY(J+1)
                       COMPUTE TEMP = NUMARR-ENTRY(J)
                       MOVE NUMARR-ENTRY(J+1) TO NUMARR-ENTRY(J)
                       MOVE TEMP TO NUMARR-ENTRY(J+1)
                   END-IF
               END-PERFORM
           END-PERFORM.
       300-PRINTNUMARRAY.
           PERFORM VARYING K FROM 1 BY 1 UNTIL K = ARRAY-LENGTH
               DISPLAY "SORTED NUMBERS:" NUMARR(K)
           END-PERFORM.