IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PRINT-MESSAGE   PIC X(23) VALUE "HELLO, WORLD FROM COBOL!".
       PROCEDURE DIVISION.
       DISPLAY PRINT-MESSAGE.
       STOP RUN.