identification division.
       program-id. exampleProgram.
       environment division.
       input-output section.
       file-control.
         select exampleFile assign to "examplefile.txt".
         01 InputRecord.
             02 RecordNumber        pic 999.
             02 RecordData.
                03 Name             pic x(20).
                03 Age              pic 99.
       data division.
       file section.
       fd exampleFile.
          01 InputRecord1 pic x(30).
       working-storage section.
       01 CurrentName          pic x(20).
       01 CurrentAge           pic 99.
       01 NameIndex            pic 9(5) comp value 0.
       01 AgeIndex             pic 9(5) comp value 0.
       procedure division.
       open input exampleFile.
       perform until eof.
          read exampleFile into InputRecord1
             at end set eof to true
          end-read
          add 1 to RecordNumber
          move Name to CurrentName(NameIndex)
          move Age to CurrentAge(AgeIndex)
          add 1 to NameIndex
          add 1 to AgeIndex
       end-perform.
       close exampleFile.
       stop run.
       
       eof: display "End of File reached".