IDENTIFICATION DIVISION.
      PROGRAM-ID. PROG.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 WS-FIRST-NUMBER PIC 9(3).
      01 WS-SECOND-NUMBER PIC 9(3).
      01 WS-RESULT PIC 9(4).
      PROCEDURE DIVISION.
      BEGIN.
           DISPLAY "Please enter the first number:".
           ACCEPT WS-FIRST-NUMBER.
           DISPLAY "Please enter the second number:".
           ACCEPT WS-SECOND-NUMBER.
           COMPUTE WS-RESULT = WS-FIRST-NUMBER * WS-SECOND-NUMBER.
           DISPLAY "The result of multiplying " WS-FIRST-NUMBER " and " WS-SECOND-NUMBER " is " WS-RESULT.
           STOP RUN.
      END PROGRAM PROG.