* This program calculates the sum of 2 numbers
IDENTIFICATION DIVISION.
PROGRAM-ID. ADDITION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(4) VALUE 1234.
01 NUM2 PIC 9(4) VALUE 5678.
01 SUM PIC 9(5).
PROCEDURE DIVISION.
ADD NUM1, NUM2 GIVING SUM.
DISPLAY 'The sum of ' NUM1 'and ' NUM2 'is ' SUM.
STOP RUN.