IDENTIFICATION DIVISION.
PROGRAM-ID. complex-calc.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 number1 PIC 9(10)V99.
01 number2 PIC 9(10)V99.
01 result PIC 9(10)V99.

PROCEDURE DIVISION.
COMPUTE result = (number1 * 5 / 2) + (number2 * 3 - 7 * 4).
DISPLAY "The result is: " result.

END PROGRAM complex-calc.