IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAME-ARRAY OCCURS 10 TIMES.
          02 NAME PIC X(20).
       PROCEDURE DIVISION.
       PERFORM ADD-NAMES.
       DISPLAY "All names added successfully.".
       STOP RUN.
       ADD-NAMES.
           ADD 1 TO COUNTER.
           MOVE "John" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Sarah" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Michael" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Emily" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "David" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Jessica" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Alexander" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Elizabeth" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Matthew" TO NAME-ARRAY(COUNTER).
           ADD 1 TO COUNTER.
           MOVE "Olivia" TO NAME-ARRAY(COUNTER).