01  INPUT-RECORD.
                    03  STUDENT-ID          PIC 9(9).
                    03  STUDENT-NAME        PIC X(20).
                    03  STUDENT-GRADES.
                        05  MATH-GRADE      PIC 9(3).
                        05  ENGLISH-GRADE   PIC 9(3).
                        05  SCIENCE-GRADE   PIC 9(3).

                01  OUTPUT-RECORD.
                    03  STUDENT-ID          PIC 9(9).
                    03  STUDENT-NAME        PIC X(20).
                    03  TOTAL-GRADE         PIC 9(3).

                01  TEMP-TOTAL             PIC 9(3).

                01  STUDENT-ARRAY REDEFINES OUTPUT-RECORD.
                    03  STUDENT-ARRAY OCCURS 10 TIMES.
                        05  STUDENT-ID      PIC 9(9).
                        05  STUDENT-NAME    PIC X(20).
                        05  TOTAL-GRADE     PIC 9(3).

                01  COUNT                   PIC 99.

                01  PROG-BEGIN.
                    PERFORM PROG-INIT.
                    PERFORM PROC-INPUT.
                    PERFORM PROC-CALC.
                    PERFORM PROC-OUTPUT.
                    STOP RUN.

                PROC-INPUT.
                    PERFORM UNTIL STUDENT-ID = 0.
                        DISPLAY 'Enter student ID (or 0 to end):'.
                        ACCEPT STUDENT-ID.
                        IF STUDENT-ID = 0
                            GO TO END-PARA.
                        END IF.
                        DISPLAY 'Enter student name:'.
                        ACCEPT STUDENT-NAME.
                        DISPLAY 'Enter grades for math, english, and science:'.
                        ACCEPT MATH-GRADE, ENGLISH-GRADE, SCIENCE-GRADE.
                        PERFORM PROC-ADD-TOTAL.
                        PERFORM PROC-ADD-ARRAY.
                    END-PERFORM.
                END-PARA.

                PROC-ADD-TOTAL.
                    ADD MATH-GRADE, ENGLISH-GRADE, SCIENCE-GRADE
                        GIVING TEMP-TOTAL.
                    MOVE TEMP-TOTAL TO TOTAL-GRADE.

                PROC-ADD-ARRAY.
                    ADD 1 TO COUNT.
                    MOVE STUDENT-ID TO STUDENT-ARRAY(COUNT).
                    MOVE STUDENT-NAME TO STUDENT-ARRAY(COUNT).
                    MOVE TOTAL-GRADE TO STUDENT-ARRAY(COUNT).

                PROC-CALC.
                    MULTIPLY 10 BY COUNT GIVING COUNT.
                    DIVIDE TOTAL-GRADE BY COUNT GIVING TOTAL-GRADE.

                PROC-OUTPUT.
                    DISPLAY 'The results are:'.
                    DISPLAY 'Student ID       Student Name                Total Grade'.
                    PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 10
                        DISPLAY STUDENT-ARRAY(COUNT).
                    END-PERFORM.


                PROG-INIT.
                    MOVE 0 TO STUDENT-ID, COUNT.
                    INITIALIZE STUDENT-ARRAY.