IDENTIFICATION DIVISION.                       * This is the identification division.

PROGRAM-ID. SAMPLEPROG123.                      * This is the program id declaration.

ENVIRONMENT DIVISION.                          * This is the environment division.
INPUT-OUTPUT SECTION.                          * This is the input-output section.
FILE-CONTROL.                                  * File control section.

SELECT INPUT-FILE1                            * This is the select statement to select the input file.
  ASSIGN TO "INPUT1.TXT".                        * This assigns the file name to the input file.
                                                * Note: "TXT" is the file extension.
                                                
SELECT INPUT-FILE2                            * This is the select statement to select the input file.
  ASSIGN TO "INPUT2.TXT".                        * This assigns the file name to the input file.
                                                * Note: "TXT" is the file extension.

DATA DIVISION.                                 * This is the data division.
FILE SECTION.                                  * This is the file section.

FD INPUT-FILE1.                                * This is the file description for input file 1.
01 INPUT-REC1.                                 * This is the record description for input record 1.
   05 INPUT-FIELD1 PIC X(10).                   * This is a 10 character alphanumeric field.

FD INPUT-FILE2.                                * This is the file description for input file 2.
01 INPUT-REC2.                                 * This is the record description for input record 2.
   05 INPUT-FIELD2 PIC 9(5)V99.                 * This is a 5 digit numeric field with 2 decimal places.

PROCEDURE DIVISION.                             * This is the procedure division.

PARAGRAPH1.                                     * This is a paragraph name.
   OPEN INPUT INPUT-FILE1                       * This opens the first input file.
   OPEN INPUT INPUT-FILE2                       * This opens the second input file.
   
   PERFORM UNTIL (INPUT-REC1 = 'END')            * This is a perform loop that continues until the record equals "END".
     READ INPUT-FILE1                           * This reads the next record from input file 1.
     AT END                                     * Checks if at the end of file.
       PERFORM PARAGRAPH3                       * If at the end, go to paragraph 3.
     NOT AT END                                 * If not at the end, continue with program.
       READ INPUT-FILE2                         * This reads the next record from input file 2.
     AT END
       PERFORM PARAGRAPH3
     NOT AT END
       PERFORM PARAGRAPH2                       * If not at the end, perform paragraph 2.
     END-READ.
   END-PERFORM.
   
PARAGRAPH2.                                     * This is a paragraph name.
   ADD INPUT-FIELD2 TO INPUT-FIELD1.             * This adds the values in the two input fields.
   DISPLAY "Total: " INPUT-FIELD1.
   GO TO PARAGRAPH1.                             * Returns to paragraph 1 to continue looping.
   
PARAGRAPH3.                                     * This is a paragraph name.
   CLOSE INPUT-FILE1                            * This closes the first input file.
   CLOSE INPUT-FILE2                            * This closes the second input file.
   STOP RUN.                                     * Ends the program.
   
END PROGRAM SAMPLEPROG123.                      * Ends the program.