IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-ONE PIC 9(5) VALUE 100.
01 NUM-TWO PIC 9(5) VALUE 50.
01 RESULT PIC 9(6) VALUE 0.
01 OUTPUT PIC X(6).

PROCEDURE DIVISION.
    MULTIPLY NUM-ONE BY NUM-TWO GIVING RESULT.
    IF RESULT < 50000
        MOVE "TOO LOW" TO OUTPUT
    ELSE IF RESULT > 75000
        MOVE "TOO HIGH" TO OUTPUT
    ELSE
        MOVE "IN RANGE" TO OUTPUT
    END-IF.

    DISPLAY "The result is " OUTPUT ".".

STOP RUN.