01 WS-COMPANY-RECORD.                        *\n
           10 WS-COMPANY-NAME         PIC X(20).     *\n     
           10 WS-COMPANY-ADDRESS      PIC X(50).     *\n
           10 WS-COMPANY-EMPLOYEES    OCCURS 50 TIMES *\n
               DEPENDING ON WS-COMPANY-COUNT.        *\n
               15 WS-EMPLOYEE-NAME    PIC X(20).     *\n
               15 WS-EMPLOYEE-AGE     PIC 9(3).      *\n
               15 WS-EMPLOYEE-SALARY  PIC 9(9).      *\n   
       01 WS-COMPANY-COUNT    PIC 9(2).               *