* This is a COBOL program that sorts a table using bubble sort algorithm
       * Input:
       * an array named TABLE with unsorted values
       * Output:
       * an array named TABLE with sorted values

       IDENTIFICATION DIVISION.
       PROGRAM-ID. Bubble-Sort.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE.
           05 TABLE-LENGTH      PIC 9(3) VALUE 10.
           05 TABLE-ELEM.
               10 NUM             PIC 9(3)
               10 FILLER          PIC XX.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Unsorted Table: ".
           PERFORM DISPLAY-TABLE.
           PERFORM SORT-TABLE.
           DISPLAY "Sorted Table: ".
           PERFORM DISPLAY-TABLE.
           STOP RUN.
              
       * This subroutine displays the values of the TABLE array
       
       SORT-TABLE.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TABLE-LENGTH
               PERFORM VARYING J FROM I  BY 1 UNTIL J > TABLE-LENGTH-1
                   IF TABLE-ELEM(J).NUM > TABLE-ELEM(J+1).NUM
                       MOVE TABLE-ELEM(J+1) TO TEMP
                       MOVE TABLE-ELEM(J)   TO TABLE-ELEM(J+1)
                       MOVE TEMP            TO TABLE-ELEM(J)
                   END-IF
               END-PERFORM
           END-PERFORM.
       
       * This subroutine sorts the TABLE array using bubble sort algorithm
       
       DISPLAY-TABLE.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TABLE-LENGTH
               DISPLAY "Element " I " is: " TABLE-ELEM(I).NUM
           END-PERFORM. 
       
       END PROGRAM Bubble-Sort.