IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 COUNT PIC 9(3) VALUE 0.
       01 NUMBERS PIC 9(3) OCCURS 100 TIMES.
       01 SUM PIC 9(5) VALUE 0.

       PROCEDURE DIVISION.
       START.
           DISPLAY "Enter count of numbers: ".
           ACCEPT COUNT.
       INITIALIZE NUMBERS.
       PERFORM READ-ADD VARYING I FROM 1 BY 1
           UNTIL I > COUNT
       STOP RUN.

       READ-ADD.
           DISPLAY "Enter number ", I, ": ".
           ACCEPT NUMBERS(I).
           COMPUTE SUM = SUM + NUMBERS(I).