IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX-CODE.
DATA DIVISION.
WORKING-STORAGE SECTION.

01 PROD-NUMBER PIC 9(4).
01 PRICE PIC 9(5)V99.

PROCEDURE DIVISION.
PERFORM VARYING PROD-NUMBER FROM 1000 BY 1 UNTIL PROD-NUMBER = 2000
    DISPLAY "Product number: " PROD-NUMBER
    MULTIPLY PROD-NUMBER BY 2 GIVING PRICE
    DISPLAY "Price: " PRICE
END-PERFORM.

STOP RUN.