IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-COMPLEX-CODE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1 PIC 9(5) VALUE 12345.
       01  NUM2 PIC S9(5) COMP VALUE -24680.
       01  NUM3 PIC 9(5)V99 VALUE 123.45.
       01  STRING1 PIC X(10) VALUE 'Hello World'.
       01  STRING2 PIC X(10) VALUE 'Goodbye'.

       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
       BEGIN.
           IF NUM1 > NUM2                 *> Checking if NUM1 is greater than NUM2
               AND NUM3 > 100              *> Checking if NUM3 is greater than 100
               AND STRING1(6:5) = 'World'  *> Checking if substring 'World' is present in STRING1
               AND STRING2 CONTAINS 'bye'   *> Checking if STRING2 contains the substring 'bye'
           THEN
               ADD NUM1, NUM2 GIVING NUM3   *> Adding NUM1 and NUM2 and storing result in NUM3
               STRING1(7:5) = 'There'       *> Replacing substring 'World' with 'There' in STRING1
           END-IF.

           DISPLAY 'Result: ' STRING1(1:11) STRING2            *> Displaying result string

           IF NUM3 > 200                                      *> Checking if NUM3 is greater than 200
               DISPLAY 'Code output successful!'               *> Displaying success message
           END-IF.

       END PROGRAM GENERATE-COMPLEX-CODE.