IDENTIFICATION DIVISION.                            *> start of identification division
            PROGRAM-ID. SAMPLE-CODE.                             *> defines program name
            AUTHOR. YOUR-NAME.                                   *> defines author name
            DATE-WRITTEN. 20/10/2021.                            *> defines date written

            ENVIRONMENT DIVISION.                                *> start of environment division
            CONFIGURATION SECTION.                               *> defines configuration section
            SOURCE-COMPUTER. IBM-370.                             *> defines source computer
            OBJECT-COMPUTER. IBM-370.                             *> defines object computer

            DATA DIVISION.                                       *> start of data division
            FILE SECTION.                                        *> defines file section
            FD INPUT-FILE.                                        *> defines file descriptor
            01 INPUT-RECORD.
               02 FIELD-1 PIC X(5).                               *> defines field 1 with alphanumeric data type
               02 FIELD-2 PIC S9(5)V99.                            *> defines field 2 with signed numeric data type
               02 FIELD-3 PIC 9(5)V99.                             *> defines field 3 with unsigned numeric data type
               02 FIELD-4 PIC X(30).                               *> defines field 4 with alphanumeric data type

            WORKING-STORAGE SECTION.                              *> defines working-storage section
            01 COUNTER PIC 99 VALUE 0.                            *> defines counter variable with initial value of 0
            01 TOTAL PIC S9(5)V99 VALUE 0.                        *> defines total variable with initial value of 0
            01 TEMP PIC X(30).                                    *> defines temporary variable with alphanumeric data type

            PROCEDURE DIVISION.                                   *> start of procedure division
            MAIN.                                                 *> defines main procedure
                OPEN INPUT INPUT-FILE.                            *> opens input file
                PERFORM UNTIL EOF                                  *> loop until end of file is reached
                READ INPUT-FILE INTO INPUT-RECORD                 *> reads data from input file into record
                    ADD 1 TO COUNTER                               *> increments counter by 1
                    MOVE FIELD-2 TO TEMP                           *> moves value of field 2 into temporary variable
                    ADD TEMP TO TOTAL                              *> adds value of temporary variable to total
                END-READ.
                CLOSE INPUT-FILE.                                 *> closes input file
                DISPLAY "Total records read: " COUNTER.
                DISPLAY "Total value of field 2: " TOTAL.
                STOP RUN.                                         *> stops program execution

            END PROGRAM SAMPLE-CODE.                              *> end of program