Identification Division.
Program-ID. HelloWorld.

Environment Division.
Configuration Section.
Input-Output Section.

Data Division.
Working-Storage Section.
01 WS-NAME                 PIC X(20) VALUE "HELLO, WORLD".

Procedure Division.
Main-Procedure.
    Display WS-NAME       *> Output "HELLO, WORLD"
    Stop Run.