IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-COBOL-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'INPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO 'OUTPUT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD PIC X(100).

       SD OUTPUT-FILE.
       01 OUTPUT-RECORD PIC X(100).

       WORKING-STORAGE SECTION.
       01 CURRENT-ROW PIC X(100).
       01 TOTAL-LENGTH PIC 9(3).

       PROCEDURE DIVISION.
       OPEN INPUT INPUT-FILE
       OPEN OUTPUT OUTPUT-FILE

       PERFORM UNTIL CURRENT-ROW = 'END'
           READ INPUT-FILE
           AT END MOVE 'END' TO CURRENT-ROW
           NOT AT END
                MOVE INPUT-RECORD TO CURRENT-ROW
                PERFORM PROCESS-ROW
           END-READ
       END-PERFORM

       CLOSE INPUT-FILE
       CLOSE OUTPUT-FILE
       STOP RUN.

       PROCESS-ROW.
           INITIALIZE TOTAL-LENGTH
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
               IF CURRENT-ROW(I:1) = 'a'
                   ADD 1 TO TOTAL-LENGTH
               ELSE
                   MOVE CURRENT-ROW(I:1) TO OUTPUT-RECORD(TOTAL-LENGTH:1)
                   ADD 1 TO TOTAL-LENGTH
               END-IF
           END-PERFORM
           WRITE OUTPUT-RECORD
           INITIALIZE OUTPUT-RECORD