IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-NAME PIC X(10) VALUE 'JOHN'.
PROCEDURE DIVISION.
DISPLAY "HELLO, " MY-NAME.
STOP RUN.