Identification Division.
 Program-ID. MY-PROGRAM.

 Data Division.
 Working-Storage Section.
 01 NUM-A PIC 9(6).
 01 NUM-B PIC 9(6).
 Procedure Division.
 Begin.
     DISPLAY "Enter a number: ".
     ACCEPT NUM-A.
     DISPLAY "Enter another number: ".
     ACCEPT NUM-B.

 Compute-Sum.
     MULTIPLY NUM-A BY 10.
     ADD NUM-B TO NUM-A.

 Compute-Difference.
     SUBTRACT NUM-A FROM NUM-B.

 Compute-Product.
     MULTIPLY NUM-A BY NUM-B.

 Compute-Quotient.
     DIVIDE NUM-A INTO NUM-B.

 Display-Results.
     DISPLAY "The sum of the two numbers is: " NUM-A.
     DISPLAY "The difference of the two numbers is: " NUM-B.
     DISPLAY "The product of the two numbers is: " NUM-A.
     DISPLAY "The quotient of the two numbers is: " NUM-B.

 STOP RUN.
 End Program MY-PROGRAM.