IDENTIFICATION DIVISION.
       PROGRAM-ID. ExampleProgram.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 numA PIC S9(3) COMP.
       01 numB PIC S9(3) COMP.
       01 result PIC S9(4) COMP.
       01 temp PIC S9(5) COMP.

       PROCEDURE DIVISION.
       BEGIN.
            DISPLAY "Please enter a value for numA:".
            ACCEPT numA.

            DISPLAY "Please enter a value for numB:".
            ACCEPT numB.

            ADD numA, numB GIVING result.
            IF result < 0 THEN
                DISPLAY "The sum of numA and numB is negative."
            ELSE
                MOVE result TO temp
                PERFORM divideResults
            END-IF

            DISPLAY "The final result is " temp.

       divideResults.
            IF temp = 0 THEN
                DISPLAY "Cannot divide by zero."
            ELSE
                DISPLAY "The quotient is " result / temp.
            END-IF.
       
       STOP RUN.