IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * This is a multiline comment
       01 NUM-VAL PIC 9(2).
       01 ANOTHER-NUM PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           COMPUTE NUM-VAL = 10 + 5 * 2. * Perform basic arithmetic operations
           DISPLAY "The result of 10 + 5 * 2 is: " NUM-VAL. * Display result
           IF NUM-VAL < ANOTHER-NUM THEN * Compare values
               DISPLAY "NUM-VAL is less than ANOTHER-NUM". * Output message
           ELSE
               DISPLAY "NUM-VAL is greater than or equal to ANOTHER-NUM". * Output message
           END-IF.
       STOP RUN.
       END PROGRAM MY-PROGRAM.