IDENTIFICATION DIVISION.
PROGRAM-ID. process-bank-transactions.

DATA DIVISION.

WORKING-STORAGE SECTION.
01 transaction-type PIC X(5).
01 account-number PIC 9(10) VALUE ZERO.
01 transaction-amount PIC 9(9)V99 VALUE ZERO.
01 error-message PIC X(30) VALUE SPACES.

PROCEDURE DIVISION.
000-INITIALIZE.
    MOVE "WITHD" TO transaction-type.
    MOVE 1234567890 TO account-number.
    MOVE 100.56 TO transaction-amount.

000-VALIDATE-TRANSACTION.
    EVALUATE transaction-type
        WHEN "WITHD" 
            IF transaction-amount > 1000
                SET error-message TO "Transaction amount exceeds limit"
            END-IF
        WHEN "DEPST" 
            SET account-number TO 9876543210
        WHEN OTHER 
            SET error-message TO "Transaction type not valid"
    END-EVALUATE.

000-PROCESS-TRANSACTION.
    IF account-number = 9876543210
        ADD transaction-amount TO account-number
    ELSE
        SUBTRACT transaction-amount FROM account-number
    END-IF.

000-DISPLAY-TRANSACTION.
    DISPLAY "Account Number: " account-number.
    DISPLAY "Transaction Type: " transaction-type.
    DISPLAY "Transaction Amount: " transaction-amount.
    DISPLAY "Error Message: " error-message.
    
STOP RUN.