IDENTIFICATION DIVISION. 
      PROGRAM-ID. example.
      ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      SOURCE-COMPUTER. IBM-370.
      OBJECT-COMPUTER. IBM-370.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 NUM1 PIC 99.
      01 NUM2 PIC 99.
      01 RESULT PIC 99.
      PROCEDURE DIVISION.
      MAIN-PROCEDURE.
          ACCEPT NUM1 FROM CONSOLE.
          ACCEPT NUM2 FROM CONSOLE.
          ADD NUM1 NUM2 GIVING RESULT.
          DISPLAY "The sum is: " RESULT.
          STOP RUN.
      END PROGRAM example.