IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CUSTOMER-DATA.
  05 CUSTOMER-NAME PIC X(30).
  05 CUSTOMER-AGE PIC 99.
  05 CUSTOMER-ADDRESS PIC X(50).

01 ACCOUNT-DATA.
  05 ACCOUNT-NUMBER PIC X(10).
  05 ACCOUNT-BALANCE PIC 9(7)V99 VALUE 0.
  05 INTEREST-RATE PIC 9(3)V99 VALUE 0.

01 ERROR-NUMBER PIC 9 VALUE 0.

PROCEDURE DIVISION.

MAIN-PROCEDURE SECTION.

  OPEN INPUT "CUSTOMER.TXT"
  OPEN INPUT "ACCOUNT.TXT"

  PERFORM READ-CUSTOMER-FILE
  PERFORM READ-ACCOUNT-FILE

  IF CUSTOMER-AGE > 60
     MOVE CUSTOMER-AGE TO ERROR-NUMBER
     DISPLAY "CUSTOMER" CUSTOMER-NAME "IS TOO OLD" ERROR-NUMBER
     GO TO END-PROGRAM
  END-IF

  IF ACCOUNT-BALANCE < 0
     MOVE 1 TO ERROR-NUMBER
     DISPLAY "ACCOUNT" ACCOUNT-NUMBER "HAS A NEGATIVE BALANCE" ERROR-NUMBER
     GO TO END-PROGRAM
  END-IF

  MOVE INTEREST-RATE TO ACCOUNT-BALANCE
  DISPLAY "ACCOUNT" ACCOUNT-NUMBER "HAS A NEW BALANCE" ACCOUNT-BALANCE

READ-CUSTOMER-FILE.
  READ CUSTOMER-RECORD
  AT END GO TO END-READ-CUSTOMER-FILE
  MOVE CUSTOMER-NAME TO CUSTOMER-NAME
  MOVE CUSTOMER-AGE TO CUSTOMER-AGE
  MOVE CUSTOMER-ADDRESS TO CUSTOMER-ADDRESS
  GO TO READ-CUSTOMER-FILE.

READ-ACCOUNT-FILE.
  READ ACCOUNT-RECORD
  AT END GO TO END-READ-ACCOUNT-FILE
  MOVE ACCOUNT-NUMBER TO ACCOUNT-NUMBER
  MOVE ACCOUNT-BALANCE TO ACCOUNT-BALANCE
  MOVE INTEREST-RATE TO INTEREST-RATE
  GO TO READ-ACCOUNT-FILE.

END-READ-CUSTOMER-FILE.
  CLOSE CUSTOMER-FILE.

END-READ-ACCOUNT-FILE.
  CLOSE ACCOUNT-FILE.

END-PROGRAM.
  STOP RUN.