IDENTIFICATION DIVISION.                                             //start of program identification division

      PROGRAM-ID. ADDITION.                                                  //program name is ADDITION

       ENVIRONMENT DIVISION.                                                 //start of environment division

       INPUT-OUTPUT SECTION.                                                 //indicate inputs and outputs

        DATA DIVISION.                                                       //start of data division

       WORKING-STORAGE SECTION.                                              //declare variables

       01  NUMBER-1       PIC 9(3).                                           //variable to store first number
       01  NUMBER-2       PIC 9(3).                                           //variable to store second number
       01  RESULT         PIC 9(4).                                           //variable to store final result

       PROCEDURE DIVISION.                                                   //start of main procedure

       DISPLAY "Enter first number: ".                                        //display prompt for first number
       ACCEPT NUMBER-1.                                                       //accept input for first number

       DISPLAY "Enter second number: ".                                       //display prompt for second number
       ACCEPT NUMBER-2.                                                       //accept input for second number

       COMPUTE RESULT = NUMBER-1 + NUMBER-2.                                  //perform addition and store in RESULT variable

       DISPLAY "The result is: " RESULT.                                      //display final result

       STOP RUN.                                                              //end of program