IDENTIFICATION DIVISION.                         * Start of identification division
       PROGRAM-ID. COMPLEX-CALC.                        * Program name
       AUTHOR. YOUR NAME.                               * Author of the program
       ENVIRONMENT DIVISION.                            * Start of environment division
       INPUT-OUTPUT SECTION.                            * Input output section
       FILE-CONTROL.                                    * Handling of files
           SELECT INPUT-FILE ASSIGN TO "INFILE".        * Input file name
           SELECT OUTPUT-FILE ASSIGN TO "OUTFILE".      * Output file name
       DATA DIVISION.                                   * Start of data division
       FILE SECTION.                                    * Data files section
       FD INPUT-FILE.                                   * File description for input file
       01 INPUT-RECORD.                                 * Structure of input record
           05 INPUT-FIELD-1 PIC X(10).                  * First input field
           05 INPUT-FIELD-2 PIC X(10).                  * Second input field
       FD OUTPUT-FILE.                                  * File description for output file
       01 OUTPUT-RECORD.                                * Structure of output record
           05 OUTPUT-FIELD-1 PIC X(10).                 * First output field
           05 OUTPUT-FIELD-2 PIC X(10).                 * Second output field
           05 OUTPUT-FIELD-3 PIC X(10).                 * Third output field
       WORKING-STORAGE SECTION.                         * Working storage section
           01 INPUT-VAR-1 PIC X(10).                    * First input variable
           01 INPUT-VAR-2 PIC X(10).                    * Second input variable
           01 OUTPUT-VAR-1 PIC X(10).                   * First output variable
           01 OUTPUT-VAR-2 PIC X(10).                   * Second output variable
           01 CALC-VAR PIC 9(8)V9(2).                   * Calculation variable
       PROCEDURE DIVISION.                              * Start of procedure division
       MAIN-PROCEDURE.                                  * Main procedure
           OPEN INPUT INPUT-FILE.                       * Open input file for reading
           OPEN OUTPUT OUTPUT-FILE.                     * Open output file for writing
           PERFORM READ-INPUT UNTIL INPUT-RECORD = "ZZ".* Loop until end of input file
           CLOSE INPUT-FILE.                            * Close input file
           CLOSE OUTPUT-FILE.                           * Close output file
           STOP RUN.                                    * Stop the program
       READ-INPUT.                                      * Read input procedure
           READ INPUT-FILE INTO INPUT-RECORD.           * Read input record
           IF INPUT-RECORD = "ZZ"                       * Check for end of file marker
               GO TO END-PROCEDURE.                     * Go to end of procedure
           END-IF.
           MOVE INPUT-FIELD-1 TO INPUT-VAR-1.           * Move input fields to variables
           MOVE INPUT-FIELD-2 TO INPUT-VAR-2.
           PERFORM CALCULATION.                         * Perform calculation procedure
           MOVE OUTPUT-VAR-1 TO OUTPUT-FIELD-1.         * Move calculated values to output fields
           MOVE OUTPUT-VAR-2 TO OUTPUT-FIELD-2.
           MOVE CALC-VAR TO OUTPUT-FIELD-3.
           WRITE OUTPUT-RECORD FROM OUTPUT-FIELD-1.     * Write output record to output file
           WRITE OUTPUT-RECORD FROM OUTPUT-FIELD-2.
           WRITE OUTPUT-RECORD FROM OUTPUT-FIELD-3.
       END-PROCEDURE.                                   * End of read input procedure
       CALCULATION.                                     * Calculation procedure
           COMPUTE CALC-VAR = INPUT-VAR-1 + INPUT-VAR-2.* Add input variables and store in calculation variable
           MOVE INPUT-VAR-1 TO OUTPUT-VAR-1.            * Store first input variable in output variable
           MOVE INPUT-VAR-2 TO OUTPUT-VAR-2.            * Store second input variable in output variable
           ADD INPUT-VAR-1 TO OUTPUT-VAR-1.             * Add first input variable to output variable
           MULTIPLY INPUT-VAR-2 BY 2.                   * Multiply second input variable by 2
           DIVIDE OUTPUT-VAR-2 BY 2 GIVING OUTPUT-VAR-2.* Divide second output variable by 2
           ADD INPUT-VAR-2 TO OUTPUT-VAR-2.             * Add second input variable to second output variable
           MULTIPLY CALC-VAR BY 2 GIVING CALC-VAR.       * Multiply calculation variable by 2
           EXIT.                                         * Exit calculation procedure
           END MAIN-PROCEDURE.                          * End of main procedure