Identification Division.
Program-ID. Convert-String.

Environment Division.
Data Division.
Working-Storage Section.
77 input-string PIC X(20) VALUE "Hello, world!". # defining working variable for input string
77 output-string PIC X(20) VALUE SPACES. # defining working variable for output string
77 index PIC 9(2) VALUE 1. # defining a counter for loop

Procedure Division.
Display "Input String: " input-string. # displaying input string
Compute index = LENGTH(input-string). # setting index as length of input string
PERFORM VARYING index FROM LENGTH(input-string) BY -1 UNTIL index = 0 # start loop
    STRING SUBSTRING(input-string, index, 1) DELIMITED BY SIZE # adding each character to output string
        INTO output-string # storing character in output string
    END-STRING
END-PERFORM.

Display "Output String: " output-string. # displaying converted string

Stop Run.