IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5) VALUE 10000.
01 NUM2 PIC 9(5) VALUE 20000.
01 SUM PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
CALC-START.
    DISPLAY "The numbers are: " NUM1 ", " NUM2
    COMPUTE SUM = NUM1 + NUM2
    DISPLAY "The sum is: " SUM.
CALC-END.
STOP RUN.