ENVIRONMENT DIVISION.
      CONFIGURATION SECTION.
      SOURCE-COMPUTER. IBM.
      OBJECT-COMPUTER. IBM.
     
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT IN-FILE ASSIGN TO "INPUT-DATA.TXT"
              ORGANIZATION IS LINE SEQUENTIAL.
          SELECT OUT-FILE ASSIGN TO "OUTPUT-DATA.TXT"
              ORGANIZATION IS LINE SEQUENTIAL.
     
      DATA DIVISION.
      FILE SECTION.
     
      FD IN-FILE
      01 RECORD-IN-FILE.
       02 GROUP-IN PIC X(10).
       02 VALUE-IN PIC X(10).
     
      FD OUT-FILE
      01 RECORD-OUT-FILE.
       02 GROUP-OUT PIC X(10).
       02 VALUE-OUT PIC X(10).
     
      WORKING-STORAGE SECTION.
      01 NUMBER-IN PIC 9(3).
      01 TOTAL PIC 9(5)V99.
      01 HIGHEST-IN PIC S9(5)V99.
      01 SMALLEST-IN PIC S9(5)V99.
     
      PROCEDURE DIVISION.
      000-BEGIN.
          OPEN INPUT IN-FILE
              OUTPUT OUT-FILE
     
      100-READ-IN.
          READ IN-FILE
               AT END MOVE "Y" TO END-OF-FILE
     
      200-PROCESS.
          COMPUTE TOTAL = TOTAL + VALUE-IN
          IF VALUE-IN > HIGHEST-IN
               MOVE VALUE-IN TO HIGHEST-IN
          IF VALUE-IN < SMALLEST-IN
               MOVE VALUE-IN TO SMALLEST-IN
     
      300-WRITE-OUT.
          MOVE GROUP-IN TO GROUP-OUT
          MOVE VALUE-IN TO VALUE-OUT
          WRITE RECORD-OUT-FILE
     
      400-CHECK-END.
          IF END-OF-FILE = "Y"
               GO TO 500-END
          ELSE
               GO TO 100-READ-IN
     
      500-END.
          CLOSE IN-FILE
              OUT-FILE
          DISPLAY "TOTAL:" TOTAL
          DISPLAY "HIGHEST:" HIGHEST-IN
          DISPLAY "SMALLEST:" SMALLEST-IN
          STOP RUN.