01  GROUP-TABLE.
        05  WEEKDAYS-A.
            10  MONDAY                PIC 9(8).
            10  TUESDAY               PIC 9(8).
            10  WEDNESDAY             PIC 9(8).
            10  THURSDAY              PIC 9(8).
            10  FRIDAY                PIC 9(8).
            10  SATURDAY              PIC 9(8).
            10  SUNDAY                PIC 9(8).
        05  WEEKDAYS-B.
            10  SUNDAY-NUMBER         PIC 9(3).
            10  MONDAY-NUMBER         PIC 9(3).
            10  TUESDAY-NUMBER        PIC 9(3).
            10  WEDNESDAY-NUMBER      PIC 9(3).
            10  THURSDAY-NUMBER       PIC 9(3).
            10  FRIDAY-NUMBER         PIC 9(3).
            10  SATURDAY-NUMBER       PIC 9(3).
        05  GROUP-FLAG                PIC X(2).
        05  WEEKDAYS-C OCCURS 7 TIMES.
            10  DAY-NUMBER OCCURS 3 TIMES PIC 9(3).
            10  DAY-FLAG                 PIC X(2).

        01  PROCEDURE DIVISION.
        02  INITIALIZATION.
            MOVE '00' TO GROUP-FLAG.
        02  LOOP.
            PERFORM VARYING I FROM 1 BY 1
                         UNTIL I > 7
                PERFORM READ-DATA
                PERFORM PROCESS-DATA
                PERFORM WRITE-DATA
            END-PERFORM.

        01  READ-DATA.
            DISPLAY "Please enter the number of " WEEKDAYS-A(I) "."
            ACCEPT WEEKDAYS-B(I) FROM KEYBOARD.

        01 PROCESS-DATA.
            IF WEEKDAYS-B(I) NOT NUMERIC
                MOVE 'XX' TO DAY-FLAG(I)
                ADD 1 TO ERROR-COUNT
            ELSE
                MOVE 0 TO DAY-FLAG(I).
        
        01  WRITE-DATA.
            IF WEEKDAYS-B(I) > 0
                ADD 1 TO GROUP-FLAG
                MOVE WEEKDAYS-B(I) TO DAY-NUMBER(I).
            ELSE
                MOVE 0 TO DAY-NUMBER(I).
        
        01  END-PROGRAM.
            IF ERROR-COUNT > 0
                DISPLAY "Invalid input. Please try again."
                START PROGRAM AGAIN
            ELSE
                DISPLAY "The sum of numbers entered is: " GROUP-FLAG.