IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT PRINT-FILE ASSIGN TO DISK "HW.TXT".
DATA DIVISION.
FILE SECTION.
FD PRINT-FILE.
01 PRINT-LINE PIC X(72).

WORKING-STORAGE SECTION.
01 MSG-LINE PIC X(72) VALUE "HELLO, WORLD!".

PROCEDURE DIVISION.
PRG-BEGIN.
    OPEN OUTPUT PRINT-FILE.
    MOVE MSG-LINE TO PRINT-LINE.
    WRITE PRINT-LINE.
    CLOSE PRINT-FILE.
    STOP RUN.