IDENTIFICATION DIVISION.
       PROGRAM-ID. ANNUAL-BONUS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 SALARY PIC 9(7)V99.
       77 BONUS-RATE PIC 9(2).

       PROCEDURE DIVISION.
       GET-SALARY.
           DISPLAY "Enter salary: ".
           ACCEPT SALARY.
       CALCULATE-BONUS.
           IF SALARY > 100000
               MOVE 10 TO BONUS-RATE
           ELSE IF SALARY > 50000
               MOVE 7 TO BONUS-RATE
           ELSE
               MOVE 5 TO BONUS-RATE
.
       DISPLAY "Bonus rate is: " BONUS-RATE "%".
       COMPUTE BONUS-AMOUNT = (SALARY * BONUS-RATE)/100.
       DISPLAY "Annual bonus amount is: " BONUS-AMOUNT.

       STOP RUN.