IDENTIFICATION DIVISION.
       PROGRAM-ID. print-numbers.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 num-1 PIC 9(2) VALUE 25.
       01 num-2 PIC 9(2) VALUE 10.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY "Printing numbers from num-1 to num-2:"

           PERFORM VARYING i FROM num-1 BY -1 UNTIL i = num-2
               DISPLAY i
           END-PERFORM.

           DISPLAY "Numbers printed successfully."

           STOP RUN.