IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO 'INPUTFILE.TXT'.

DATA DIVISION.
FILE SECTION.
    FD INPUT-FILE
       RECORD CONTAINS 60 CHARACTERS
       BLOCK CONTAINS 20 RECORDS
       LABEL RECORDS ARE STANDARD
       DATA RECORD IS INPUT-RECORD.

01 INPUT-RECORD.
    05 NAME              PIC X(20).
    05 AGE               PIC 99.
    05 SALARY            PIC 999V99.
    05 STATUS            PIC X(10).

WORKING-STORAGE SECTION.
01 TOTAL-SALARY        PIC 9(8)V99 VALUE 0.
01 TOTAL-RECORDS       PIC 99 VALUE 0.

PROCEDURE DIVISION.
    OPEN INPUT INPUT-FILE
    PERFORM READ-FILE UNTIL EOF OR TOTAL-RECORDS EQUALS 20
    CLOSE INPUT-FILE
    DISPLAY "Total Salary: " TOTAL-SALARY
    DISPLAY "Total Records: " TOTAL-RECORDS.

READ-FILE.
    READ INPUT-FILE
    AT END SET EOF TO TRUE
    NOT AT END
        ADD SALARY TO TOTAL-SALARY
        ADD 1 TO TOTAL-RECORDS.