IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       DATA DIVISION.
       01 INPUT-NUM PIC 9(5) VALUE 10201.
       01 TABLE-DATA.
          05 TABLE OCCURS 10 TIMES.
             10 TABLE-VALUE PIC X(5).
       01 OUTPUT-DATA.
          05 RESULT-TABLE OCCURS 10 TIMES.
             10 RESULT-VALUE PIC X(5).
             10 RESULT-INDEX PIC 99.
       PROCEDURE DIVISION.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I=10
               IF INPUT-NUM MOD I=0
                   MOVE "Yes" TO RESULT-VALUE(I)
                   MOVE I TO RESULT-INDEX(I)
               ELSE
                   MOVE "No" TO RESULT-VALUE(I)
                   MOVE I TO RESULT-INDEX(I)
               END-IF
           END-PERFORM.
           DISPLAY "The result table is:".
           PERFORM VARYING J FROM 1 BY 1 UNTIL J=10
               DISPLAY RESULT-TABLE(J).
           END-PERFORM.
       STOP RUN.