IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(4).
       01 NUM2 PIC 9(4).
       01 SUM PIC 9(4).
       PROCEDURE DIVISION.
           MOVE 1234 TO NUM1.
           MOVE 5678 TO NUM2.
           COMPUTE SUM = NUM1 + NUM2.
           DISPLAY "The sum is: " SUM.
       STOP RUN.