IDENTIFICATION DIVISION.
PROGRAM-ID. PROG-NAME.
AUTHOR. FIRSTNAME LASTNAME.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS.
    05 NUM-A PIC S9(5) COMP.
    05 NUM-B PIC S9(5) COMP.
01 RESULT PIC S9(7) COMP.
01 ERROR-MESSAGE PIC X(50) VALUE "INVALID INPUT. PLEASE ENTER NUMBERS ONLY.".

PROCEDURE DIVISION.
    DISPLAY "PLEASE ENTER TWO NUMBERS (BETWEEN -99,999 AND 99,999): ".
    ACCEPT NUM-A.
    ACCEPT NUM-B.
    
    IF (NUM-A > 99999 OR NUM-A < -99999) OR (NUM-B > 99999 OR NUM-B < -99999)
        DISPLAY ERROR-MESSAGE
    ELSE
        ADD NUM-A, NUM-B GIVING RESULT.
        DISPLAY "THE RESULT IS: " RESULT.
    END-IF.

STOP RUN.