IDENTIFICATION DIVISION.
       PROGRAM-ID. LONG-COMPLEX.
       AUTHOR. Your Name.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT IN-FILE ASSIGN TO 'INPUT.TXT'

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 EMPLOYEE-INFO       PIC X(200)       VALUE SPACES.

       WORKING-STORAGE SECTION.
       01 EMPLOYEE-COUNT       PIC 9(3)          VALUE 0.
       01 CURRENT-EMPLOYEE     PIC X(50)         VALUE SPACES.
       01 EMPLOYEE-NAME        PIC X(20).
       01 EMPLOYEE-ID          PIC 9(6).

       PROCEDURE DIVISION.
       100-MAIN.

          PERFORM 200-OPEN-FILE.
          PERFORM 300-READ-FILE UNTIL EOF-FILE = "Y".
          PERFORM 400-CLOSE-FILE.
          PERFORM 500-DISPLAY-RESULTS.
          STOP RUN.

       200-OPEN-FILE.
          OPEN INPUT IN-FILE.

       300-READ-FILE.
          READ IN-FILE
             AT END
                MOVE "Y" TO EOF-FILE
             NOT AT END
                ADD 1 TO EMPLOYEE-COUNT
                MOVE EMPLOYEE-INFO TO CURRENT-EMPLOYEE
                UNSTRING CURRENT-EMPLOYEE DELIMITED BY "," INTO EMPLOYEE-NAME, EMPLOYEE-ID

       400-CLOSE-FILE.
          CLOSE INPUT IN-FILE.

       500-DISPLAY-RESULTS.
          DISPLAY "Total number of employees: " EMPLOYEE-COUNT
          DISPLAY "Employee name: " EMPLOYEE-NAME
          DISPLAY "Employee ID: " EMPLOYEE-ID.