IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT-REPORT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
      *DISPLAY MODE IS 'COLOR'.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRN-FILE ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD PRN-FILE
       LABEL RECORDS ARE OMITTED.
       01 EMP-RECORD.
           05 EMP-ID PIC X(10).
           05 EMP-NAME PIC X(20).
           05 EMP-AGE PIC 99.
           05 EMP-SALARY PIC 9(6)V99.
       WORKING-STORAGE SECTION.
       01 EMP-TOTAL PIC 9(6)V99.
       01 EMP-COUNT PIC 99.
       SCREEN SECTION.
      *SCREEN HEADER.
      01 PRINT-SCREEN.
          02 BLANK SCREEN.
          02 CENTER 'EMPLOYEE REPORT' CRLF.
          02 CENTER 'EMPLOYEE ID        EMPLOYEE NAME         EMPLOYEE AGE        EMPLOYEE SALARY' CRLF.
          02 CENTER '-----------        --------------         -------------       ---------------' CRLF.
          02 BLANK SCREEN.
      PROCEDURE DIVISION.
      100-INITIALIZE.
           DISPLAY PRINT-SCREEN.
      200-OPEN.
           OPEN OUTPUT PRN-FILE.
      300-READ.
           READ EMP-RECORD
               AT END
                   DISPLAY 'END OF FILE'
               NOT AT END
                   ADD EMP-SALARY TO EMP-TOTAL
                   ADD 1 TO EMP-COUNT.
      400-PRINT.
          WRITE EMP-RECORD.
      500-CLOSE.
           CLOSE PRN-FILE.
           DISPLAY 'TOTAL EMPLOYEE SALARY:' EMP-TOTAL.
           DISPLAY 'TOTAL NUMBER OF EMPLOYEES:' EMP-COUNT.
           STOP RUN.