IDENTIFICATION DIVISION.                             * This section identifies the program
       PROGRAM-ID. SampleProgram.                            * Name of the program
       DATA DIVISION.                                        * This section declares the data used in the program 
       WORKING-STORAGE SECTION.                              * This section declares working storage variables
       01 Student-data.                                      * Group data item for a student's information 
           05 Student-name      PIC X(20).                    * Variable for student's name 
           05 Student-ID        PIC 9(6).                    * Variable for student's ID number 
           05 Student-age       PIC 99.                      * Variable for student's age 
       01 Course-data.                                       * Group data item for a course's information 
           05 Course-name       PIC X(20).                   * Variable for course name 
           05 Course-code       PIC X(6).                    * Variable for course code 
           05 Course-grade      PIC XX.                      * Variable for student's grade in the course 
       PROCEDURE DIVISION.                                   * This section contains the instructions for the program 
           DISPLAY "Enter student's name: ". 
           ACCEPT Student-name.                              * User inputs student's name 
           DISPLAY "Enter student's ID number: ". 
           ACCEPT Student-ID.                                * User inputs student's ID number 
           DISPLAY "Enter student's age: " 
           ACCEPT Student-age.                               * User inputs student's age 
           DISPLAY "Enter course name: ". 
           ACCEPT Course-name.                               * User inputs course name 
           DISPLAY "Enter course code: ". 
           ACCEPT Course-code.                               * User inputs course code 
           DISPLAY "Enter student's grade: ". 
           ACCEPT Course-grade.                              * User inputs student's grade in course 
           DISPLAY "Student data: ". 
           DISPLAY "Name: " Student-name. 
           DISPLAY "ID Number: " Student-ID. 
           DISPLAY "Age: " Student-age. 
           DISPLAY "Course data: ". 
           DISPLAY "Course name: " Course-name. 
           DISPLAY "Course code: " Course-code. 
           DISPLAY "Grade: " Course-grade. 
       STOP RUN.                                             * End of program