IDENTIFICATION DIVISION.
      PROGRAM-ID. STACKOVERFLOW.
      AUTHOR. YOUR NAME.

      ENVIRONMENT DIVISION.
      DATA DIVISION.

      WORKING-STORAGE SECTION.
      01 NUMBER-OF-QUESTIONS PIC 999.
      01 QUESTIONS OCCURS 1 TO 10 TIMES
         DEPENDING ON NUMBER-OF-QUESTIONS.
         05 QUESTION-ID PIC X(10).
         05 QUESTION-TYPE PIC X(10).
         05 QUESTION-ANSWER PIC X(50).

      PROCEDURE DIVISION.
      100-MAIN.
          DISPLAY "Welcome to Stack Overflow!".
          ACCEPT NUMBER-OF-QUESTIONS.

          PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUMBER-OF-QUESTIONS.
               DISPLAY "Question " I ":".
               ACCEPT QUESTIONS(I).
          END-PERFORM.

          SET I TO 1.
          DISPLAY "Answers:".
          PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUMBER-OF-QUESTIONS.
               DISPLAY "Question " I " Answer:".
               SET QUESTION-ANSWER TO QUESTIONS(I).
               DISPLAY QUESTION-ANSWER.
          END-PERFORM.

          STOP RUN.