IDENTIFICATION DIVISION.                    * IDENTIFICATION DIVISION is used to identify the program.
       PROGRAM-ID. Hello.                           * PROGRAM-ID assigns a name to the program.

       DATA DIVISION.                               * DATA DIVISION is used to define data structures and variables.
       WORKING-STORAGE SECTION.                     * WORKING-STORAGE SECTION is used to define variables that are used in the program.
       01 NAME-IN.                                  * 01 is a level number, used to create a named data item.
           05 FIRST-NAME PIC X(10).                 * 05 is a subordinate level number, used for a subfield of NAME-IN.
           05 LAST-NAME PIC X(10).
       01 NAME-OUT.
           05 FIRST-NAME OUT PIC X(10).             * OUT keyword indicates that the value will be output to this field.
           05 LAST-NAME OUT PIC X(10).

       PROCEDURE DIVISION.                          * PROCEDURE DIVISION is used to write the actual program logic.
       ACCEPT NAME-IN.                              * ACCEPT is used to input data from the user into NAME-IN.
       MOVE NAME-IN TO NAME-OUT.                    * MOVE is used to copy data from one variable to another.
       DISPLAY "Hello, " FIRST-NAME OUT " " LAST-NAME OUT ".".  * DISPLAY is used to output data to the user.
       STOP RUN.                                    * STOP RUN is used to end the program.