IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATE-SALES.
      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
          SELECT IN-FILE ASSIGN TO DISK "SALES.DAT"
          ORGANIZATION IS LINE SEQUENTIAL.
          SELECT OUT-FILE ASSIGN TO DISK "SALES-REPORT.TXT"
          ORGANIZATION IS LINE SEQUENTIAL.
      DATA DIVISION.
      FILE SECTION.
      FD IN-FILE.
      01 SALES-RECORD.
          05 SALESDATE           PIC X(8).
          05 REGION              PIC X(2).
          05 SALES-AMOUNT        PIC 9(9)V99.
      FD OUT-FILE.
      01 REPORT-LINE             PIC X(80).
      WORKING-STORAGE SECTION.
      01 TOTAL-SALES-AMOUNT      PIC 9(9)V99 VALUE 0.
      01 REGION-SALES-TOTAL.
          05 REGION-CODE         PIC X(2).
          05 REGION-TOTAL        PIC 9(9)V99 VALUE 0.
      01 HEADER-LINE.
          05 HEADER-TEXT         PIC X(80) VALUE 'REGION         TOTAL SALES'.
      PROCEDURE DIVISION.
      10 PROCESS-RECORDS.
          OPEN INPUT IN-FILE
          OUTPUT OUT-FILE
          READ SALES-RECORD
          AT END GO TO END-OF-FILE
          PERFORM CALCULATE-TOTAL-REGION
          PERFORM WRITE-LINE
          END-PERFORM
          ADD TOTAL-SALES-AMOUNT TO REGION-TOTAL
          MOVE HEADER-TEXT TO REPORT-LINE
          WRITE REPORT-LINE
          CLOSE IN-FILE
          CLOSE OUT-FILE.
      10 CALCULATE-TOTAL-REGION.
          IF REGION = REGION-CODE THEN
              ADD SALES-AMOUNT TO REGION-TOTAL
          ELSE
              MOVE REGION TO REGION-CODE
              MOVE SALES-AMOUNT TO REGION-TOTAL
          END-IF.
      10 WRITE-LINE.
          MOVE REGION-CODE TO REPORT-LINE
          MOVE REGION-TOTAL TO REPORT-LINE (3:10)
          WRITE REPORT-LINE.
      10 END-OF-FILE.
      DISPLAY 'TOTAL SALES: ' TOTAL-SALES-AMOUNT.
      STOP RUN.