IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO "IN.FILE".
       SELECT OUTPUT-FILE ASSIGN TO "OUT.FILE".

       DATA DIVISION.
       FILE SECTION.
  *    DECLARING RECORD STRUCTURE FOR INPUT FILE
       FD INPUT-FILE RECORD CONTAINS 80 CHARACTERS
       01 INPUT-RECORD.
          05 INPUT-FIELD-1          PIC X OCCURS 1 TIMES.
          05 INPUT-FIELD-2          PIC X OCCURS 2 TIMES.
          05 INPUT-FIELD-3          PIC X OCCURS 3 TIMES.

  *    DECLARING RECORD STRUCTURE FOR OUTPUT FILE
       FD OUTPUT-FILE RECORD CONTAINS 80 CHARACTERS
       01 OUTPUT-RECORD.
          05 OUTPUT-FIELD-1         PIC X OCCURS 1 TIMES.
          05 OUTPUT-FIELD-2         PIC X OCCURS 3 TIMES.
          05 OUTPUT-FIELD-3         PIC X OCCURS 5 TIMES.

       WORKING-STORAGE SECTION.
       01 COUNTERS.
          05 INPUT-COUNTER          PIC 99 VALUE 0.
          05 OUTPUT-COUNTER         PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       000-MAIN-PARAGRAPH.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM UNTIL INPUT-COUNTER = 10
               READ INPUT-FILE
               AT END
                   MOVE "F" TO INPUT-FIELD-1
                   MOVE "OF" TO INPUT-FIELD-2
                   MOVE "IT" TO INPUT-FIELD-3
               END-READ
               ADD 1 TO INPUT-COUNTER
               IF OUTPUT-COUNTER < 5
                   MOVE INPUT-FIELD-1 TO OUTPUT-FIELD-1
                   MOVE INPUT-FIELD-2(1:2) TO OUTPUT-FIELD-2
                   MOVE INPUT-FIELD-3 TO OUTPUT-FIELD-3(1:5)
                   WRITE OUTPUT-RECORD
                   ADD 1 TO OUTPUT-COUNTER
               ELSE
                   CONTINUE
               END-IF
           END-PERFORM
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE
           STOP RUN.