IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOLCODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUM1        PIC 9(2) VALUE 10.
       01  NUM2        PIC 9(2) VALUE 20.
       01  RESULT      PIC 9(4).

       PROCEDURE DIVISION.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.

       DISPLAY "Result is: " RESULT.

       STOP RUN.