IDENTIFICATION DIVISION.
PROGRAM-ID. ARRAY-EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS OCCURS 5 TIMES PIC 9.
01 RESULT PIC 9.

PROCEDURE DIVISION.
MOVE 5 TO NUMBERS(1).
MOVE 8 TO NUMBERS(2).
MOVE 2 TO NUMBERS(3).
MOVE 11 TO NUMBERS(4).
MOVE 3 TO NUMBERS(5).

PERFORM VARYING I FROM 1 BY 1 
UNTIL I > 5 
DISPLAY "NUMBER " I ": " NUMBERS(I) 
ADD NUMBERS(I) TO RESULT 
END-PERFORM.

DISPLAY "RESULT: " RESULT.

STOP RUN.