IDENTIFICATION DIVISION.
   PROGRAM-ID. CALCULATION.
   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 NUM1 PIC 9(4) VALUE 1000.    *DEFINES NUM1 AS AN INTEGER VARIABLE WITH A VALUE OF 1000
   01 NUM2 PIC 9(4) VALUE 500.     *DEFINES NUM2 AS AN INTEGER VARIABLE WITH A VALUE OF 500
   01 RESULT PIC 9(5) VALUE 0.     *DEFINES RESULT AS AN INTEGER VARIABLE WITH A VALUE OF 0
   PROCEDURE DIVISION.
   PERFORM ACALC.                  *CALLS THE ACALC PROCEDURE
   DISPLAY "The result is " RESULT.*DISPLAYS THE RESULT TO THE USER
   ACALC.                          *CALCULATION PROCEDURE
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.
       ADD NUM1 TO NUM2 GIVING RESULT.
       DIVIDE RESULT BY 2 GIVING RESULT.
       EXIT.
   END PROGRAM CALCULATION.