IDENTIFICATION DIVISION.                           | Start of identification division
PROGRAM-ID. MYPROGRAM.                              | Program name
VERSION 01.                                         | Version number
AUTHOR "John Doe".                                  | Author's name
INSTALLATION. "MyOrganization".                     | Organization name

ENVIRONMENT DIVISION.                               | Start of environment division
INPUT-OUTPUT SECTION.                               | Input-Output section
FILE-CONTROL.                                       | File control section
    SELECT INPUT-FILE ASSIGN TO "input.txt".         | File handling, assigning input file
    SELECT OUTPUT-FILE ASSIGN TO "output.txt".       | File handling, assigning output file

DATA DIVISION.                                      | Start of data division
FILE SECTION.                                       | File section
FD INPUT-FILE.                                      | File description for input file
    01 INPUT-RECORD.                                 | Record description for input record
        05 INPUT-NAME     PIC X(20).                 | Field description for input field name
        05 INPUT-AGE      PIC 99.                    | Field description for input field age
        05 INPUT-SALARY   PIC 9(10)V99.              | Field description for input field salary

FD OUTPUT-FILE.                                     | File description for output file
    01 OUTPUT-RECORD.                                | Record description for output record
        05 OUTPUT-NAME    PIC X(20).                 | Field description for output field name
        05 OUTPUT-AGE     PIC 99.                    | Field description for output field age
        05 OUTPUT-SALARY  PIC 9(10)V99.              | Field description for output field salary

WORKING-STORAGE SECTION.                            | Working-storage section
01 WS-COUNTER     PIC 99.                            | Working-storage variable to count records
01 WS-TOTAL-SALARY PIC 9(10)V99.                     | Working-storage variable to hold total salary

PROCEDURE DIVISION.                                 | Start of procedure division
MAIN-PARAGRAPH.                                     | Main paragraph
    OPEN INPUT INPUT-FILE                           | Open input file for reading
    OPEN OUTPUT OUTPUT-FILE                         | Open output file for writing
    PERFORM READ-PARAGRAPH UNTIL WS-COUNTER = 10     | Perform read paragraph 10 times
    DISPLAY "Total salary is " WS-TOTAL-SALARY      | Display total salary
    CLOSE INPUT-FILE                                | Close input file
    CLOSE OUTPUT-FILE                               | Close output file
    STOP RUN.                                       | Stop execution of program

READ-PARAGRAPH.                                     | Read paragraph
    READ INPUT-FILE INTO INPUT-RECORD               | Read input record
    AT END                                          | When end of file is reached
        EXIT                                        | Exit out of paragraph
    END-READ.                                       | End Read statement
    MOVE INPUT-SALARY TO WS-TOTAL-SALARY            | Move salary to total salary variable
    ADD 1 TO WS-COUNTER                             | Add 1 to counter variable
    MOVE INPUT-NAME TO OUTPUT-NAME.                 | Move name to output record
    MOVE INPUT-AGE TO OUTPUT-AGE.                   | Move age to output record
    MOVE INPUT-SALARY TO OUTPUT-SALARY.             | Move salary to output record
    WRITE OUTPUT-RECORD.                            | Write output record
    END-PERFORM.                                    | End perform statement