identification division.
program-id. SAMPLE.
environment division.
data division.
working-storage section.
01 LIST-LENGTH PIC 99.
01 SALES-LIST.
05 PROD-ID PIC X(6) OCCURS 3 TIMES.
05 PROD-PRICE PIC S9(6)V99 OCCURS 3 TIMES.
05 PROD-TOTAL PIC S9(6)V99 OCCURS 3 TIMES.
procedure division.
perform 5 times.
open output file "SALES.TXT"
accept LIST-LENGTH from console.
If LIST-LENGTH is numeric and LIST-LENGTH is greater than 0
perform varying counter1 from 1 by 1 until counter1 > LIST-LENGTH 
open input file "PRODUCT.TXT" 
read input file at end
add 1 to counter1
if counter1 > LIST-LENGTH
continue
end-if
move PROD-ID (counter1) to PROD
modify PROD-PRICE (counter1) by 10
multiply PROD-PRICE (counter1) by 10 giving PROD-TOTAL (counter1)
write PROD, PROD-PRICE (counter1), PROD-TOTAL (counter1) from the input file to the SALES.TXT
end-read.
close input file.
close output file.
end-perform.
stop run.