IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-VALUE PIC 9(5).
01 RESULT-VALUE PIC 9(6).
PROCEDURE DIVISION.
  PERFORM READ-VALUE.
  PERFORM VALIDATE-VALUE.
  PERFORM CALCULATE-VALUE
  PERFORM WRITE-RESULT.
STOP RUN.

READ-VALUE.
  DISPLAY "ENTER A FIVE DIGIT NUMBER:"
  ACCEPT INPUT-VALUE.

VALIDATE-VALUE.
  IF INPUT-VALUE IS NOT NUMERIC THEN
    DISPLAY "PLEASE INPUT A NUMERIC VALUE."
    PERFORM READ-VALUE.
  END-IF.

CALCULATE-VALUE.
  COMPUTE RESULT-VALUE = FUNCTION REVERSE(INPUT-VALUE) + INPUT-VALUE.
  IF RESULT-VALUE > 999999 THEN
    COMPUTE RESULT-VALUE = RESULT-VALUE - 1000000.
  END-IF.

WRITE-RESULT.
  DISPLAY "THE RESULT IS:"
  DISPLAY RESULT-VALUE.