IDENTIFICATION DIVISION.                    * This is the identification division
      PROGRAM-ID. SNIPPET.                         * Name of the program
      *************************************************

       ENVIRONMENT DIVISION.                      * This is the environment division
      CONFIGURATION SECTION.                      * Configuration section begins
      SOURCE-COMPUTER. IBM-3278.                   * Specifies the source computer
      OBJECT-COMPUTER. IBM-370/158.                * Specifies the object computer

       DATA DIVISION.                              * This is the Data division
      WORKING-STORAGE SECTION.                    * Working storage section begins
      01 TOTAL-NUMBER-OF-STUDENTS PIC 9999.        * Specifies the maximum number of students
      01 STUDENT-TABLE.
          05 STUDENT-INFO OCCURS 0 TO 9999 TIMES.
             10 STUDENT-ID PIC 9(6).               * Specifies the student ID
             10 STUDENT-NAME PIC X(20).            * Specifies the student name
             10 STUDENT-AGE PIC 9(2).              * Specifies the student age
             10 STUDENT-GRADE PIC 9(3).            * Specifies the student grade

       PROCEDURE DIVISION.                         * This is the Procedure division
       MAIN-PARAGRAPH.                             * Main paragraph begins
           PERFORM INITIALIZATION-PARAGRAPH.       * Calls initialization paragraph
           PERFORM INPUT-PARAGRAPH.                * Calls input paragraph
           PERFORM PROCESSING-PARAGRAPH.           * Calls processing paragraph
           PERFORM OUTPUT-PARAGRAPH.               * Calls output paragraph
           STOP RUN.                               * Terminates the program

       INITIALIZATION-PARAGRAPH.                   * This is the initialization paragraph
           MOVE 0 TO TOTAL-NUMBER-OF-STUDENTS.     * Initializes total number of students to zero

       INPUT-PARAGRAPH.                            * This is the input paragraph
           ACCEPT STUDENT-INFO FROM USER.          * Prompts user to input student info

       PROCESSING-PARAGRAPH.                       * This is the processing paragraph
           PERFORM UNTIL TOTAL-NUMBER-OF-STUDENTS = 0.  * Loop performs until all students have been processed
             PERFORM CALCULATE-GRADE.              * Calls calculate grade paragraph
             SUBTRACT 1 FROM TOTAL-NUMBER-OF-STUDENTS. * Decrements total number of students
           END-PERFORM.

       CALCULATE-GRADE.                            * This is the calculate grade paragraph
           IF STUDENT-AGE >= 18                    * Checks if student is 18 or older
               ADD 10 TO STUDENT-GRADE.
           ELSE
               ADD 5 TO STUDENT-GRADE.             * If student is under 18, add 5 to grade
           END-IF.

       OUTPUT-PARAGRAPH.                           * This is the output paragraph
           DISPLAY 'Student ID: ' STUDENT-ID.      * Displays student ID
           DISPLAY 'Student Name: ' STUDENT-NAME.  * Displays student name
           DISPLAY 'Student Age: ' STUDENT-AGE.    * Displays student age
           DISPLAY 'Student Grade: ' STUDENT-GRADE.* Displays student grade
           DISPLAY ' '.                            * Displays blank line between each student