IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDITION.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBMOJT.
       OBJECT-COMPUTER. IBMOJT.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 INPUT1 PIC 9(3).
       01 INPUT2 PIC 9(3).
       01 RESULT PIC 9(4).
       PROCEDURE DIVISION.
       ADD INPUT1, INPUT2 GIVING RESULT.
       DISPLAY "Result: ", RESULT.
       STOP RUN.