IDENTIFICATION DIVISION.
       PROGRAM-ID. RANDOM-GENERATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMERIC-DISPLAY        PIC 9(4).
       01 RANDOM-NUMBER          PIC 9(4).
       01 UPPER-LIMIT            PIC 9(4) VALUE 1000.
       01 LOWER-LIMIT            PIC 9(4) VALUE 1.
       01 RANDOM-SEED            PIC 9(4) VALUE 1234. 
       PROCEDURE DIVISION.
       START-GENERATOR.
       * This program generates a random number between
       * the upper and lower limits, using a specified seed. 
           COMPUTE RANDOM-NUMBER = UPPER-LIMIT + 1	  
                    - (RANDOM-SEED * (UPPER-LIMIT - LOWER-LIMIT + 1)).
       DISPLAY "Random Number: " NUMERIC-DISPLAY.
       STOP RUN.