IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.


DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 WS-NAME PIC X(20) VALUE 'HELLO,WORLD'.

PROCEDURE DIVISION.
DISPLAY WS-NAME.
STOP RUN.