IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-CONNECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STRINGIPC PIC X(30) VALUE "localhost".
       01 STRINGPORT PIC 9(4) VALUE "3306".
       01 STRINGUNAME PIC X(10) VALUE "username".
       01 STRINGPSWD PIC X(10) VALUE "password".
       01 STRINGDBNAME PIC X(10) VALUE "database".
       01 WS-DATABASE-CONNECTION.
          05 DS-DB-INFO.
             10 DS-HOST PIC X(30).
             10 DS-PORT PIC 9(4).
             10 DS-UNAME PIC X(10).
             10 DS-PSWD PIC X(10).
             10 DS-DBNAME PIC X(10).
       PROCEDURE DIVISION.
       MOVE STRINGIPC TO DS-HOST
       MOVE STRINGPORT TO DS-PORT
       MOVE STRINGUNAME TO DS-UNAME
       MOVE STRINGPSWD TO DS-PSWD
       MOVE STRINGDBNAME TO DS-DBNAME
       CALL 'CONNECT-DB'
       USING DS-DB-INFO
       END-CALL
       IF RETURN-CODE = 0
          DISPLAY "Connected to database"
       ELSE
          DISPLAY "Error in connecting to database"
       END-IF.