IDENTIFICATION DIVISION.
       PROGRAM-ID. myprogram.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 my-numbers.
           05 my-number-1      PIC 9(5).
           05 my-number-2      PIC 9(5).
           05 result           PIC 9(6)   VALUE 0.
        01 my-names.
           05 my-first-name    PIC X(20).
           05 my-last-name     PIC X(20).
           05 full-name        PIC X(40).
       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
           MOVE 12345 TO my-number-1.
           MOVE 67890 TO my-number-2.
           ADD my-number-1 TO my-number-2 GIVING result.
           DISPLAY "The result is: " result.
           MOVE "John" TO my-first-name.
           MOVE "Smith" TO my-last-name.
           STRING my-first-name DELIMITED BY " "
                   my-last-name DELIMITED BY " "
                   INTO full-name.
       END PROGRAM myprogram.