OPTION SKIPPROCEDURE.
IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3270.
OBJECT-COMPUTER. IBM-370.
SPECIAL-NAMES.
    CONSOLE IS CRT.           * assign "Console" to "CRT"
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE       ASSIGN TO "INPUT.DAT".
    SELECT OUTFILE      ASSIGN TO "OUTPUT.DAT".
DATA DIVISION.
FILE SECTION.
    FD INFILE RECORDING MODE ON.
        01 RECORD-IN.
            02 ACCOUNT-NUMBER-IN     PIC 9(10).
            02 ACCOUNT-TYPE-IN       PIC X.
            02 ACCOUNT-BALANCE-IN    PIC S9(7)V99.
    FD OUTFILE RECORDING MODE ON.
        01 RECORD-OUT.
            02 ACCOUNT-NUMBER-OUT    PIC 9(10).
            02 ACCOUNT-TYPE-OUT      PIC X.
            02 ACCOUNT-BALANCE-OUT   PIC S9(7)V99.
WORKING-STORAGE SECTION.
    01 WS-COUNT                   PIC 9(2).
    01 WS-EOF                     PIC X.
    01 WS-AVERAGE                 PIC S9(7)V99.
    01 WS-ACCOUNT-TYPES.
        05 WS-CHECKING            PIC S9(7)V99.
        05 WS-SAVINGS             PIC S9(7)V99.
        05 WS-CREDIT-CARD         PIC S9(7)V99.
PROCEDURE DIVISION.
MAIN-PROGRAM.
    OPEN INPUT INFILE OUTPUT OUTFILE.
    PERFORM READ-RECORD UNTIL WS-EOF = "Y".
    CLOSE INFILE OUTFILE.
    DISPLAY "Total number of records: " WS-COUNT.
    DISPLAY "Average balance: " WS-AVERAGE.
    DISPLAY "Total checking account balance: " WS-CHECKING.
    DISPLAY "Total savings account balance: " WS-SAVINGS.
    DISPLAY "Total credit card account balance: " WS-CREDIT-CARD.
    STOP RUN.
READ-RECORD.
    READ INFILE INTO RECORD-IN AT END MOVE "Y" TO EOF.
    ADD 1 TO WS-COUNT.
    PERFORM PROCESS-RECORD.
PROCESS-RECORD.
    MOVE ACCOUNT-BALANCE-IN TO WS-AVERAGE.
    ADD WS-AVERAGE TO WS-ACCOUNT-TYPES(ACCOUNT-TYPE-IN).
    MOVE ACCOUNT-NUMBER-IN TO ACCOUNT-NUMBER-OUT.
    MOVE ACCOUNT-TYPE-IN TO ACCOUNT-TYPE-OUT.
    MOVE ACCOUNT-BALANCE-IN TO ACCOUNT-BALANCE-OUT.
    WRITE RECORD-OUT.