identification division.
program-id. AddTwoNumbers.
environment division.
input-output section.
file-control.
select inputfile assign to "input.txt".
select outputfile assign to "output.txt".

data division.
file section.
fd inputfile.
01 input-numbers.
   05 first-num pic 9.
   05 second-num pic 9.
fd outputfile.
01 result-num pic 9(3).

working-storage section.
01 temp-num pic 9.

procedure division.
open inputfile
open outputfile
read inputfile
end-read
add first-num, second-num giving temp-num
move temp-num to result-num
write result-num
close inputfile
close outputfile