DATA DIVISION.
       WORKING-STORAGE SECTION.
            77  AGE        PIC 9(3).
            77  GENDER     PIC X.
            77  SALARY     PIC 9(6)V99 VALUE 0.
            77  FRUIT      PIC X(15) VALUE 'APPLE'.
            77  NUMBER-OF-EYES PACKED-DECIMAL.
       PROCEDURE DIVISION.
       DISPLAY "Please enter your age: "
       ACCEPT AGE
       PERFORM CHECK-AGE.
       DISPLAY "Please enter your gender (M/F): "
       ACCEPT GENDER
       PERFORM CHECK-GENDER.
       DISPLAY "Please enter your salary: "
       ACCEPT SALARY
       PERFORM CHECK-SALARY.
       DISPLAY "You have " FRUIT " in your bag."
       PERFORM CHECK-FRUIT.
       DISPLAY "You have " NUMBER-OF-EYES " eyes."
       PERFORM CHECK-EYES.
       STOP RUN.
       
       CHECK-AGE.
            IF AGE NOT NUMERIC THEN
                  DISPLAY "Error: Age must be a number."
                  STOP RUN.
            END-IF.
       CHECK-GENDER.
            IF (GENDER NOT = 'F' AND GENDER NOT = 'M') THEN
                  DISPLAY "Error: Gender must be 'M' or 'F'."
                  STOP RUN.
            END-IF.
       CHECK-SALARY.
            IF SALARY < 0 THEN
                  DISPLAY "Error: Salary cannot be negative."
                  STOP RUN.
            END-IF.
       CHECK-FRUIT.
            IF FRUIT = 'APPLE' THEN
                  DISPLAY "You have an apple in your bag."
            ELSE
                  DISPLAY "You do not have an apple in your bag."
            END-IF.
       CHECK-EYES.
            MOVE 2 TO NUMBER-OF-EYES
            DISPLAY "You have " NUMBER-OF-EYES " eyes."
            IF NUMBER-OF-EYES < 2 THEN
                  DISPLAY "Error: Number of eyes cannot be less than 2."
                  STOP RUN.
            END-IF.