IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 100.
01 NUM2 PIC 9(3) VALUE 250.
01 SUM PIC 9(4).
PROCEDURE DIVISION.
    MOVE NUM1 TO SUM
    ADD NUM2 TO SUM
    DISPLAY "The sum of NUM1 and NUM2 is: " SUM
    STOP RUN.