IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 HW-MSG PIC X(46).
       01 HW-NAME PIC X(10) VALUE "WORLD".
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           MOVE "HELLO " TO HW-MSG.
           STRING HW-MSG DELIMITED BY SIZE
                  ",", HW-NAME DELIMITED BY SIZE
                  "!" INTO HW-MSG.
           DISPLAY HW-MSG.
           STOP RUN.