IDENTIFICATION DIVISION.
       PROGRAM-ID. Sort-Numbers.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMS.
          05 NUM-ARRAY OCCURS 10 TIMES
             ASCENDING KEY IS NUM1
             INDEXED BY I.
             10 NUM1 PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I=10
          DISPLAY "ENTER NUMBER " I ":".
          ACCEPT NUM-ARRAY (I).
       END-PERFORM.
       PERFORM 10 TIMES
          PERFORM VARYING I FROM 1 BY 1 UNTIL I=9
             IF NUM-ARRAY(I) > NUM-ARRAY(I+1)
             THEN
                MOVE NUM-ARRAY(I) TO TEMP.
                MOVE NUM-ARRAY(I+1) TO NUM-ARRAY(I).
                MOVE TEMP TO NUM-ARRAY(I+1).
             END-IF
          END-PERFORM
       END-PERFORM.
       DISPLAY "SORTED NUMBERS ARE: ".
       PERFORM VARYING I FROM 1 BY 1 UNTIL I=10
          DISPLAY NUM-ARRAY(I).
       END-PERFORM.
       STOP RUN.