IDENTIFICATION DIVISION.                                * Identifies the code as a COBOL program

       PROGRAM-ID. HELLO-WORLD.                                * Assigns a program name

       ENVIRONMENT DIVISION.                                  * Defines the environment for the program
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MY-FILE ASSIGN TO "HELLO.TXT".               * Assigns the output file name
       DATA DIVISION.                                         * Declares variables and data used in the program
       FILE SECTION.
       FD MY-FILE.                                            * Defines the output file
       01 OUTPUT-RECORD.
           05 MESSAGE PIC X(14) VALUE "Hello, World!".        * Defines the output message

       PROCEDURE DIVISION.                                    * Contains the actual program logic
       MAIN-LOGIC SECTION.
       OPEN OUTPUT MY-FILE.                                   * Opens the output file for writing
       WRITE OUTPUT-RECORD.                                   * Writes the output message to the file
       CLOSE MY-FILE.                                         * Closes the file
       STOP RUN.                                              * Terminates the program