IDENTIFICATION DIVISION.       //Header section
      PROGRAM-ID. MY-PROGRAM.        //Program name
      DATA DIVISION.                 //Data division
      WORKING-STORAGE SECTION.       //Variables declaration
      01  COUNTER  PIC 9(3) VALUE 0.  //Counter variable
      01  SCORE-ARRAY.               //Array for storing scores
          05  STUDENT-1   PIC 9(3) VALUE 0.
          05  STUDENT-2   PIC 9(3) VALUE 0.
          05  STUDENT-3   PIC 9(3) VALUE 0.
          05  STUDENT-4   PIC 9(3) VALUE 0.
          05  STUDENT-5   PIC 9(3) VALUE 0.
      PROCEDURE DIVISION.            //Main program section
      PERFORM 5 TIMES                //Loop to accept scores for all 5 students
           ACCEPT SCORE-ARRAY (COUNTER + 1)  //Accept score and store in array
           COMPUTE COUNTER = COUNTER + 1     //Increment counter
      END-PERFORM.                   //End loop
      PERFORM 5 TIMES                //Loop to display scores for all 5 students
           DISPLAY 'Student ' COUNTER ': ' SCORE-ARRAY (COUNTER)  //Display student number and score from array
           COMPUTE COUNTER = COUNTER + 1     //Increment counter
      END-PERFORM.                   //End loop
      STOP RUN.                      //End program execution