IDENTIFICATION DIVISION.                            * Start of identification division
PROGRAM-ID. complex-calculation-program.             * Program name
DATA DIVISION.                                      * Start of data division
WORKING-STORAGE SECTION.                            * Declare variables
1 INPUT-VALUE PIC 9(3).                              * Declare input variable with 3 digits
1 STRING-VALUE PIC X(10).                            * Declare string variable with 10 characters
1 RESULT PIC S9(6)V9(2).                             * Declare result variable with 6 digits in front and 2 decimal places
PROCEDURE DIVISION.                                  * Start of procedure division
MAIN-PROCEDURE.                                     * Main procedure
    DISPLAY "Please input a value:"                  * Display message to user
    ACCEPT INPUT-VALUE                               * Accept input from user
    PERFORM CALCULATE-STRING                         * Perform calculation using string variable
    PERFORM CALCULATE-RESULT                         * Perform calculation using result variable
    DISPLAY "The calculated result is:" STRING-VALUE * Display string value
    DISPLAY RESULT                                   * Display calculated result
STOP RUN.                                            * End program

CALCULATE-STRING.                                    * Calculation procedure using string variable
    COMPUTE STRING-VALUE = "Calculated " & INPUT-VALUE * Concatenate string with input variable
END-CALCULATE-STRING.                                * End of calculation procedure using string variable

CALCULATE-RESULT.                                    * Calculation procedure using result variable
    COMPUTE RESULT = INPUT-VALUE * 10.5               * Multiply input variable by 10.5
END-CALCULATE-RESULT.                                * End of calculation procedure using result variable