IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 MSG-LEN PIC S9(4) COMP.
       01 MSG PIC X(20) VALUE "Hello, World!".
       01 OUTPUT-MSG PIC X(30).

       PROCEDURE DIVISION.
       DISPLAY "Hello, World!".

       MAIN:
       OPEN OUTPUT FILE-NAME.
       
       MOVE LENGTH OF MSG TO MSG-LEN.
       WRITE FILE-RECORD FROM MSG BEFORE ADVANCING 1 LINE.
       CLOSE FILE-NAME.

       STOP RUN.