IDENTIFICATION DIVISION.                      * start of identification division
PROGRAM-ID. HELLO-WORLD.                       * program name
AUTHOR. YOUR NAME.                             * programmer name
ENVIRONMENT DIVISION.                          * start of environment division
INPUT-OUTPUT SECTION.                          * input-output section
FILE-CONTROL.                                  * file control section
SELECT IN-FILE ASSIGN TO "INFILE".              * input file name
SELECT OUT-FILE ASSIGN TO "OUTFILE".            * output file name
DATA DIVISION.                                 * start of data division
FILE SECTION.                                  * file section
FD IN-FILE.                                    * input file description
01 IN-REC.                                     * input record definition
  02 IN-FIELD-1    PIC X(10).                   * first field in input record
  02 IN-FIELD-2    PIC X(15).                   * second field in input record
  02 IN-FIELD-3    PIC X(20).                   * third field in input record
FD OUT-FILE.                                   * output file description
01 OUT-REC.                                    * output record definition
  02 OUT-FIELD-1   PIC X(20).                   * first field in output record
  02 OUT-FIELD-2   PIC X(25).                   * second field in output record
  02 OUT-FIELD-3   PIC X(30).                   * third field in output record
WORKING-STORAGE SECTION.                       * start of working-storage section
01 WS-COUNTER       PIC 9(3) VALUE 0.           * counter variable
01 WS-TEXT          PIC X(30) VALUE "HELLO WORLD". * text to be written to output file
PROCEDURE DIVISION.                            * start of procedure division
MAIN-PARAGRAPH.                                * main paragraph
OPEN INPUT IN-FILE.                            * open input file
OPEN OUTPUT OUT-FILE.                          * open output file
PERFORM READ-RECORD UNTIL END-OF-FILE.          * loop through input file until end-of-file
CLOSE IN-FILE.                                 * close input file
CLOSE OUT-FILE.                                * close output file
READ-RECORD.                                   * read record paragraph
READ IN-FILE INTO IN-REC.                      * read next record from input file
ADD 1 TO WS-COUNTER.                           * increment counter variable
MOVE WS-TEXT TO OUT-FIELD-1.                    * move text to first field in output record
MOVE WS-COUNTER TO OUT-FIELD-2.                 * move counter variable to second field in output record
MOVE IN-FIELD-1 TO OUT-FIELD-3.                 * move first field from input record to third field in output record
WRITE OUT-REC FROM OUT-FIELD-1.                * write output record to output file
END-OF-FILE.                                   * end of file paragraph
STOP RUN.                                      * end program execution