IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATOR.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 NUM1 PIC 9(5) VALUE 12345.  //defines NUM1 as a numeric data item with 5 digits and assigns it a value of 12345
      01 NUM2 PIC 9(5) VALUE 54321.  //defines NUM2 as a numeric data item with 5 digits and assigns it a value of 54321
      01 RESULT PIC 9(6) VALUE 0.    //defines RESULT as a numeric data item with 6 digits and assigns it a value of 0
      PROCEDURE DIVISION.
      DISPLAY "The numbers are " NUM1 "and" NUM2 "."  //displays the values of NUM1 and NUM2
      ADD NUM1 NUM2 GIVING RESULT.   //adds the values of NUM1 and NUM2 and stores the sum in RESULT
      DISPLAY "The sum is " RESULT "."  //displays the value of RESULT
      STOP.
      END PROGRAM CALCULATOR.   //marks the end of the program