DATA DIVISION.                                   * Data division
       WORKING-STORAGE SECTION.                         * Working storage section
       01 WS-NUMBER1 PIC 9(5).                           * Declare variable WS-NUMBER1 with max length of 5 digits
       01 WS-NUMBER2 PIC 9(5).                           * Declare variable WS-NUMBER2 with max length of 5 digits
       01 WS-RESULT PIC 9(5).                            * Declare variable WS-RESULT with max length of 5 digits
       PROCEDURE DIVISION.                               * Procedure division
       0000-MAIN.                                        * Main section
           ACCEPT WS-NUMBER1.                            * Accept input for WS-NUMBER1
           ACCEPT WS-NUMBER2.                            * Accept input for WS-NUMBER2
           PERFORM 1000-CALCULATE-ADDITION.              * Perform addition calculation
           DISPLAY "The result of adding WS-NUMBER1 and WS-NUMBER2 is ". * Display text
           DISPLAY WS-RESULT.                            * Display the result
       STOP RUN.                                         * Stop program from running
       1000-CALCULATE-ADDITION.                          * Addition calculation section
           COMPUTE WS-RESULT = WS-NUMBER1 + WS-NUMBER2.  * Add WS-NUMBER1 and WS-NUMBER2 and store in WS-RESULT variable
       END PERFORM.                                      * End perform loop