IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE-PROGRAM.
      ********************************
      * THIS PROGRAM ADDS TWO NUMBERS *
      * AND OUTPUTS THE RESULT        *
      ********************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "NUMBERS.IN"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO "RESULT.OUT"
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE
           RECORDING MODE IS F.
       01 INPUT-RECORD PIC X(20).
       FD OUTPUT-FILE
           RECORDING MODE IS F.
       01 OUTPUT-RECORD PIC X(20).
       WORKING-STORAGE SECTION.
       01 FIRST-NUMBER PIC 9(3) VALUE 0.
       01 SECOND-NUMBER PIC 9(3) VALUE 0.
       01 RESULT PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-ROUTINE.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM READ-AND-PROCESS
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE
           STOP RUN.
           
       READ-AND-PROCESS.
           READ INPUT-FILE
               AT END
                    MOVE "END OF FILE" TO OUTPUT-RECORD
                    DISPLAY "PROCESSING COMPLETE."
                    EXIT PERFORM.
               NOT AT END
                    MOVE INPUT-RECORD TO FIRST-NUMBER
                    MOVE INPUT-RECORD TO SECOND-NUMBER
                    ADD FIRST-NUMBER TO SECOND-NUMBER GIVING RESULT
                    MOVE RESULT TO OUTPUT-RECORD
                    DISPLAY "ADDED " FIRST-NUMBER " AND " SECOND-NUMBER
                    DISPLAY "RESULT IS " RESULT
                    WRITE OUTPUT-RECORD
                    PERFORM READ-AND-PROCESS.