IDENTIFICATION DIVISION.
       PROGRAM-ID. compute-costs.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-FILE ASSIGN TO "inventory.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE.
       01 INVENTORY-RECORD.
           05 PRODUCT-NUMBER   PIC 9(5).
           05 PRODUCT-NAME     PIC A(20).
           05 UNIT-PRICE       PIC 9(5)V99.
           05 QUANTITY-ON-HAND PIC 9(5).
       
       01 PRINT-LINE.
           05 FILLER PIC X(10) VALUE SPACES.
           05 PRODUCT-NAME-FORMATTED PIC X(20).
           05 FILLER PIC X(5) VALUE SPACES.
           05 TOTAL-COST-FORMATTED PIC X(9).
       
       WORKING-STORAGE SECTION.
       01 TOTAL-COST                 PIC 9(9)V99 VALUE 0.00.
       
       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT INVENTORY-FILE
           PERFORM UNTIL END-OF-FILE
              READ INVENTORY-FILE
                 AT END SET END-OF-FILE TO TRUE
              END-READ
              MULTIPLY UNIT-PRICE BY QUANTITY-ON-HAND GIVING TOTAL-COST
              MOVE PRODUCT-NAME TO PRODUCT-NAME-FORMATTED
              MOVE TOTAL-COST TO TOTAL-COST-FORMATTED
              DISPLAY PRINT-LINE
           END-PERFORM
           CLOSE INVENTORY-FILE.
       
       STOP RUN.