IDENTIFICATION DIVISION.
PROGRAM-ID. complex-program.
AUTHOR. John DOE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 num1 PIC 9(10) VALUE 123456.
01 num2 PIC 9(10) VALUE 789012.
01 result PIC S9(10)V99.

PROCEDURE DIVISION.
    PERFORM multiply-twice
    DISPLAY "Result is " num1
    STOP RUN.

multiply-twice.
    MULTIPLY num1 BY num2 GIVING result.
    MULTIPLY result BY num2 GIVING result.
    EXIT.
END PROGRAM complex-program.