IDENTIFICATION DIVISION.
PROGRAM-ID. SORT-ARRAY.
*******************************************************
* This program demonstrates sorting an array using    *
* bubble sort algorithm.                              *
*******************************************************
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(4) VALUE 10.
01 ARRAY-DATA.
   05 ARRAY-ELEMENT OCCURS ARRAY-SIZE TIMES
       PIC 9(4).

PROCEDURE DIVISION.
BEGIN.
    DISPLAY "Enter the size of the array (maximum 20):".
    ACCEPT ARRAY-SIZE.
    IF ARRAY-SIZE > 20
        DISPLAY "Invalid input. Maximum size is 20."
        STOP RUN
    END-IF.
    
    DISPLAY "Enter the array elements:".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
        ACCEPT ARRAY-ELEMENT(I)
    END-PERFORM.
    
    PERFORM SORT-ARRAY(ARRAY-SIZE).
    
    DISPLAY "Sorted array:".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
        DISPLAY ARRAY-ELEMENT(I)
    END-PERFORM.
    
    STOP RUN.
    

SORT-ARRAY SECTION.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE - 1
        PERFORM VARYING J FROM 1 BY 1 UNTIL J > ARRAY-SIZE - I
            IF ARRAY-ELEMENT(J) > ARRAY-ELEMENT(J+1)
                COMPUTE TEMP = ARRAY-ELEMENT(J)
                MOVE ARRAY-ELEMENT(J+1) TO ARRAY-ELEMENT(J)
                MOVE TEMP TO ARRAY-ELEMENT(J+1)
            END-IF
        END-PERFORM
    END-PERFORM.
    
END PROGRAM SORT-ARRAY.