IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-OF-ROWS PIC 9(2) VALUE 10.
01 NUM-OF-COLUMNS PIC 9(2) VALUE 10.
01 INPUT-TABLE.
    02 ROWS OCCURS 0 TO 10 TIMES      
        DEPENDING ON NUM-OF-ROWS.
        03 COLUMNS OCCURS 1 TO 10 TIMES
            DEPENDING ON NUM-OF-COLUMNS.
            04 VALUE PIC 9(3).
01 COLUMN-TOTALS.
    02 COLUMN-TOTAL OCCURS 1 TO 10 TIMES
        INDEXED BY COL-INDEX.
        03 TOTAL PIC 9(4).
01 ROW-TOTALS.
    02 ROW-TOTAL OCCURS 1 TO 10 TIMES
        INDEXED BY ROW-INDEX.
        03 TOTAL PIC 9(4).
PROCEDURE DIVISION.
MAIN-LOGIC SECTION.
    PERFORM VARYING ROW-INDEX FROM 1 BY 1
        UNTIL ROW-INDEX > NUM-OF-ROWS
            PERFORM VARYING COL-INDEX FROM 1 BY 1
                UNTIL COL-INDEX > NUM-OF-COLUMNS
                    ACCEPT INPUT-TABLE(ROW-INDEX, COL-INDEX)
                        FROM CONSOLE.
                    ADD INPUT-TABLE(ROW-INDEX, COL-INDEX)
                        TO ROW-TOTAL(ROW-INDEX)
                        COLUMN-TOTAL(COL-INDEX).
    DISPLAY "INPUT TABLE:".
    PERFORM VARYING ROW-INDEX FROM 1 BY 1
        UNTIL ROW-INDEX > NUM-OF-ROWS
            DISPLAY "ROW:", ROW-INDEX.
            PERFORM VARYING COL-INDEX FROM 1 BY 1
                UNTIL COL-INDEX > NUM-OF-COLUMNS
                    DISPLAY "COLUMN:", COL-INDEX,
                        "VALUE:", INPUT-TABLE(ROW-INDEX, COL-INDEX).
    DISPLAY "ROW TOTALS:".
    PERFORM VARYING ROW-INDEX FROM 1 BY 1
        UNTIL ROW-INDEX > NUM-OF-ROWS
            DISPLAY "ROW:", ROW-INDEX, "TOTAL:",
                ROW-TOTAL(ROW-INDEX).
    DISPLAY "COLUMN TOTALS:".
    PERFORM VARYING COL-INDEX FROM 1 BY 1
        UNTIL COL-INDEX > NUM-OF-COLUMNS
            DISPLAY "COLUMN:", COL-INDEX, "TOTAL:",
                COLUMN-TOTAL(COL-INDEX).
STOP RUN.