IDENTIFICATION DIVISION.
       PROGRAM-ID. SORT-ARRAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRAY-PARA.
           05 ARRAY-DATA PIC 9(5) OCCURS 100 TIMES.
       PROCEDURE DIVISION.
       PERFORM VARYING I FROM 1 BY 1
       UNTIL I > 100
           DISPLAY "Enter a number:"
           ACCEPT ARRAY-DATA(I).
       END-PERFORM.
       PERFORM VARYING I FROM 1 BY 1
       UNTIL I > 100
           PERFORM VARYING J FROM I BY 1
           UNTIL J > 100
               IF ARRAY-DATA(J) < ARRAY-DATA(I)
                   MOVE ARRAY-DATA(J) TO TEMP-DATA
                   MOVE ARRAY-DATA(I) TO ARRAY-DATA(J)
                   MOVE TEMP-DATA TO ARRAY-DATA(I)
               END-IF.
           END-PERFORM.
       END-PERFORM.
       PERFORM VARYING I FROM 1 BY 1
       UNTIL I > 100
           DISPLAY ARRAY-DATA(I).
       END-PERFORM.
       STOP RUN.