IDENTIFICATION DIVISION.
        PROGRAM-ID. TESTPROGRAM.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 MY-VARIABLE PIC 9(3).
        PROCEDURE DIVISION.
        DISPLAY "HELLO WORLD".
        DISPLAY "ENTER A NUMBER: ".
        ACCEPT MY-VARIABLE.
        IF MY-VARIABLE > 10
           DISPLAY "LARGE NUMBER".
        ELSE IF MY-VARIABLE < 5
           DISPLAY "SMALL NUMBER".
        ELSE
           DISPLAY "MEDIUM NUMBER".
        END-IF.
        STOP RUN.