IDENTIFICATION DIVISION.                        
  * Program: Perform Arithmetic Operations            
  * Date Written: 06/24/2019                           
  * Author: John Smith                                
 PROGRAM-ID. ARITH-OPER.                              

 DATA DIVISION.                                       
 WORKING-STORAGE SECTION.                             
  01 W-NUM1                  PIC 9(3) VALUE 200.       
  01 W-NUM2                  PIC 9(3) VALUE 100.       
  01 W-RESULT                PIC 9(4).                

 PROCEDURE DIVISION.                                    
  ADD W-NUM2 TO W-NUM1                                  
  MOVE W-NUM1 TO W-RESULT                               
  SUBTRACT W-NUM2 FROM W-RESULT                         
  MULTIPLY W-NUM2 BY W-NUM1                             
  DIVIDE W-NUM2 INTO W-RESULT                           
  DISPLAY "The result is: " W-RESULT                    
  STOP RUN.