IDENTIFICATION DIVISION.                                
       PROGRAM-ID. COMPLEX-CALC.                                
      *********************************************************
      * This program performs complex mathematical calculations
      * INPUT PARAMETERS:
      *     - NUM1: first number
      *     - NUM2: second number
      *     - OPERATOR: operation to be performed (+, -, *, /)     
      * OUTPUT PARAMETERS:
      *     - RESULT: result of the calculation
      *********************************************************
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1            PIC 9(3).    //Initialize first number                              
       01 NUM2            PIC 9(3).    //Initialize second number
       01 OPERATOR        PIC A(1).    //Initialize operation
       01 RESULT          PIC 9(4).    //Initialize result
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.                 
           DISPLAY "ENTER FIRST NUMBER: " WITH NO ADVANCING.
           ACCEPT NUM1.                //Take input for first number
           DISPLAY "ENTER SECOND NUMBER: " WITH NO ADVANCING.
           ACCEPT NUM2.                //Take input for second number
           DISPLAY "ENTER OPERATION (+, -, *, /): " WITH NO ADVANCING.
           ACCEPT OPERATOR.            //Take input for operator

           IF OPERATOR = "+"           //Check for addition
               COMPUTE RESULT = NUM1 + NUM2.
           ELSE IF OPERATOR = "-"      //Check for subtraction
               COMPUTE RESULT = NUM1 - NUM2.
           ELSE IF OPERATOR = "*"      //Check for multiplication
               COMPUTE RESULT = NUM1 * NUM2.
           ELSE IF OPERATOR = "/"      //Check for division
               COMPUTE RESULT = NUM1 / NUM2.
           ELSE                         //Invalid operator
               DISPLAY "INVALID OPERATOR: " OPERATOR.
           END-IF.
           DISPLAY "RESULT: " RESULT.   //Print result
       STOP RUN.