IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-BILL-AMOUNT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER-INFO.
           05 CUSTOMER-NAME           PIC X(30).
           05 CUSTOMER-ID             PIC 9(5).
       01 SALES-INFO.
           05 NUM-ITEMS               PIC 9(5).
           05 ITEM-PRICE              PIC 9(5)V99.
           05 BILL-AMOUNT             PIC 9(5)V99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "PLEASE ENTER CUSTOMER NAME:".
           ACCEPT CUSTOMER-NAME.
           DISPLAY "PLEASE ENTER CUSTOMER ID:".
           ACCEPT CUSTOMER-ID.
           DISPLAY "PLEASE ENTER NUMBER OF ITEMS PURCHASED:".
           ACCEPT NUM-ITEMS.
           DISPLAY "PLEASE ENTER PRICE FOR EACH ITEM:".
           ACCEPT ITEM-PRICE.
           COMPUTE BILL-AMOUNT = NUM-ITEMS * ITEM-PRICE.
           DISPLAY "CUSTOMER NAME:" CUSTOMER-NAME.
           DISPLAY "CUSTOMER ID:" CUSTOMER-ID.
           DISPLAY "NUMBER OF ITEMS:" NUM-ITEMS.
           DISPLAY "PRICE FOR EACH ITEM:" ITEM-PRICE.
           DISPLAY "TOTAL BILL AMOUNT:" BILL-AMOUNT.
           STOP RUN.