IDENTIFICATION DIVISION.
program-ID. strange-cobol-program.

ENVIRONMENT DIVISION.
configuration section.
source-computer. 'mainframe'.
object-computer. 'mainframe'.

DATA DIVISION.
    FILE SECTION.
    
fd input-file.
01 input-record pic x(80).

fd output-file.
01 output-record pic x(80).

WORKING-STORAGE SECTION.
01 input-text pic x(80) value "Hello, world!".
01 output-count pic 9(3) value zero.

PROCEDURE DIVISION.
move input-text to input-record.
perform varying i from 1 by 1 until i > 10
    compute output-count = output-count + 1
    write output-record from input-record
end-perform.

STOP RUN.