IDENTIFICATION DIVISION.
 PROGRAM-ID. MY-PROGRAM.
 DATA DIVISION.
 USAGE DISPLAY.
 WORKING-STORAGE SECTION.
 01 VAR1 PIC 9(10) VALUE 0.
 01 VAR2 PIC 9(5)V99.
 01 VAR3 PIC S9(11)V99.
 PROCEDURE DIVISION.
     PERFORM INIT-VARIABLES.
     PERFORM CALCULATE-VAR1.
     PERFORM CALCULATE-VAR2.
     DISPLAY 'Final result is ' VAR3.
 INIT-VARIABLES.
     COMPUTE VAR1 = 10 * 15.
     MOVE 2500 TO VAR2.
 CALCULATE-VAR1.
     ADD 500 TO VAR1.
 CALCULATE-VAR2.
     COMPUTE VAR3 = VAR1 * VAR2 + 7500.