Identification Division.
Program-ID. ComplexCalculation.

Environment Division.
Configuration Section.
Source-Computer. AS400.
Object-Computer. AS400.

Data Division.
Working-Storage Section.
01 INPUT-VALUES.
   05 NUM1 PIC 9(5)V99 VALUE 0.00.
   05 NUM2 PIC 9(5)V99 VALUE 0.00.
   05 OPERATOR PIC X VALUE "+".  *OPERATOR TO BE USED FOR CALCULATION
   05 RESULT PIC 9(7)V99 VALUE 0.00.

Procedure Division.
CalculateValues.

    *PERFORM A VALIDATION CHECK TO ENSURE CORRECT INPUTS ARE RECEIVED FROM USER
    IF NUM1 < 0 OR NUM2 < 0 THEN
        DISPLAY "Invalid input. Please provide positive numbers only."
        STOP RUN
    END-IF.
    
    *PERFORM THE CALCULATION BASED ON THE SELECTED OPERATOR
    IF OPERATOR = "+"
        COMPUTE RESULT = NUM1 + NUM2
    ELSE IF OPERATOR = "-"
        COMPUTE RESULT = NUM1 - NUM2
    ELSE IF OPERATOR = "*"
        COMPUTE RESULT = NUM1 * NUM2
    ELSE IF OPERATOR = "/"
        COMPUTE RESULT = NUM1 / NUM2
    END-IF.
    
    *DISPLAY THE RESULT TO THE USER
    DISPLAY "The result of" NUM1 " " OPERATOR " " NUM2 " is " RESULT.
    
    *GET USER INPUT TO REPEAT THE CALCULATION OR EXIT THE PROGRAM
    DISPLAY "Do you want to repeat the calculation? (Y/N)"
    ACCEPT CONTINUE-CALC.
    
    *IF USER CHOOSES TO CONTINUE, GO BACK TO START OF PROCEDURE DIVISION
    IF CONTINUE-CALC = "Y"
        PERFORM CalculateValues
    END-IF.
    
    *IF USER CHOOSES TO EXIT THE PROGRAM, DISPLAY GOODBYE MESSAGE AND STOP RUN
    DISPLAY "Thank you for using ComplexCalculation. Goodbye!"
    STOP RUN.
    
End Program ComplexCalculation.