IDENTIFICATION DIVISION.                           * start of COBOL program
       PROGRAM-ID. HELLO-WORLD.                            * program name
       ENVIRONMENT DIVISION.                              * used for environment settings
       DATA DIVISION.                                      * used for data declarations
       WORKING-STORAGE SECTION.                            * used for declaring working variables
       01 PRINT-OUTPUT PIC X(100) VALUE SPACE.              * declaration of output variable
       PROCEDURE DIVISION.                                 * start of the code logic
       DISPLAY "HELLO, WORLD!".                            * instruction to display to the screen
       MOVE "HELLO, WORLD!" TO PRINT-OUTPUT.                * assign the string to the output variable
       DISPLAY PRINT-OUTPUT.                               * display the output variable
       STOP RUN.                                           * end of program
       END PROGRAM HELLO-WORLD.                            * end of program identifier