IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-TOTAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-ARRAY.
05 NUM1 PIC 9(3) VALUE 100.
05 NUM2 PIC 9(3) VALUE 200.
05 NUM3 PIC 9(3) VALUE 300.
05 NUM4 PIC 9(3) VALUE 400.
05 NUM5 PIC 9(3) VALUE 500.
05 TOTAL PIC 9(4) VALUE ZERO.

PROCEDURE DIVISION.
CALCULATE-TOTAL.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        ADD NUM(1:I) TO TOTAL
    END-PERFORM.

DISPLAY "The total of the numbers is " TOTAL.

STOP RUN.