IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PERSON.
           05  NAME             PIC X(20).
           05  AGE              PIC 99.
           05  GENDER           PIC X(1).
           05  SALARY           PIC 9(7)V99.
       PROCEDURE DIVISION.
           ACCEPT PERSON        *accepts input from user
           DISPLAY 'Hello, ' NAME '!'      *displays greeting with name
           DISPLAY 'You are ' AGE ' years old and ' GENDER      *displays age and gender
                 'with a salary of $' SALARY ' per year.'       *displays salary per year
           IF GENDER = 'M'       *checks if gender is male
               COMPUTE SALARY = SALARY + SALARY * 0.10         *calculates 10% salary increase
               DISPLAY 'Congratulations! Your salary has been increased to $' SALARY ' per year.'
           ELSE
               DISPLAY 'Sorry, females do not receive a salary increase at this time.'
           END-IF.

           STOP RUN.