IDENTIFICATION DIVISION.
      PROGRAM-ID. SAMPLE-PGM.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 FIRST-NUMBER PIC 9(4).
      01 SECOND-NUMBER PIC 9(4).
      01 RESULT PIC 9(5).
      PROCEDURE DIVISION.
      DISPLAY "Enter first number: ".
      ACCEPT FIRST-NUMBER.
      DISPLAY "Enter second number: ".
      ACCEPT SECOND-NUMBER.
      MULTIPLY FIRST-NUMBER BY SECOND-NUMBER GIVING RESULT.
      DISPLAY "Result is: " RESULT.
      STOP RUN.