IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO 'INFILE.DAT'.
           SELECT OUT-FILE ASSIGN TO 'OUTFILE.DAT'.

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE
           RECORDING MODE IS F.
       01 IN-REC PIC X(10).

       FD OUT-FILE
           RECORDING MODE IS F.
       01 OUT-REC PIC X(10).

       WORKING-STORAGE SECTION.
       01 COUNT-THREE PIC 99.
       01 COUNT-FOUR PIC 99.

       PROCEDURE DIVISION.
       PERFORM VARYING COUNT-THREE FROM 1 BY 1 UNTIL COUNT-THREE > 10
           PERFORM VARYING COUNT-FOUR FROM 1 BY 1 UNTIL COUNT-FOUR > 10
               IF COUNT-THREE > COUNT-FOUR
                   MOVE 'X' TO OUT-REC(COUNT-THREE:1)
               ELSE
                   MOVE 'O' TO OUT-REC(COUNT-THREE:1)
               END-IF
           END-PERFORM
           WRITE OUT-REC
       END-PERFORM.

       CLOSE IN-FILE, OUT-FILE.
       STOP RUN.