IDENTIFICATION DIVISION.
  PROGRAM-ID. CALCULATOR.

  ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
  FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO "INPUT.TXT".
    SELECT OUT-FILE ASSIGN TO "OUTPUT.TXT".

  DATA DIVISION.
  FILE SECTION.
  FD IN-FILE
    LABEL RECORDS ARE STANDARD
    RECORDING MODE F.
  01 INPUT-RECORD.
    05 VALUE-1 PIC 9(5).
    05 VALUE-2 PIC 9(5).
    05 OPERATOR PIC A(1).
  FD OUT-FILE
    LABEL RECORDS ARE STANDARD
    RECORDING MODE F.
  01 OUTPUT-RECORD.
    05 RESULT PIC 9(10).

  WORKING-STORAGE SECTION.
  01 TOTAL PIC 9(10).

  PROCEDURE DIVISION.
  MAIN-PROCEDURE.
      OPEN INPUT IN-FILE
      OUTPUT OUT-FILE

      PERFORM READ-PROCESS UNTIL END-OF-FILE
      CLOSE IN-FILE
      CLOSE OUT-FILE
      STOP RUN.

  READ-PROCESS.
      READ IN-FILE
          AT END SET END-OF-FILE TO TRUE
      IF END-OF-FILE
          GO TO END-READ.
      MOVE VALUE-1 TO TOTAL
      MOVE VALUE-2 TO RESULT
      IF OPERATOR = '+'
          ADD VALUE-1 TO TOTAL
          MOVE TOTAL TO RESULT
      ELSE IF OPERATOR = '-'
          SUBTRACT VALUE-1 FROM TOTAL
          MOVE TOTAL TO RESULT
      ELSE IF OPERATOR = '*'
          MULTIPLY VALUE-1 BY TOTAL
          MOVE TOTAL TO RESULT
      ELSE IF OPERATOR = '/'
          DIVIDE VALUE-1 INTO TOTAL
          MOVE TOTAL TO RESULT
      MOVE RESULT TO OUTPUT-RECORD
      WRITE OUTPUT-RECORD
  END-READ.