IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SALESPERSON-COMMISSION.

DATA-DIVISION.
WORKING-STORAGE SECTION.

77 QUARTERLY-SALES-AMOUNT PIC 9(10)V99.
77 COMMISSION-RATE PIC 9(4)V99.
77 TOTAL-COMMISSION PIC 9(10)V99.

PROCEDURE DIVISION.
BEGIN.
    DISPLAY "Enter quarterly sales amount:".
    ACCEPT QUARTERLY-SALES-AMOUNT.

    IF QUARTERLY-SALES-AMOUNT < 10000 THEN
        COMPUTE COMMISSION-RATE = 1.5
    ELSE IF QUARTERLY-SALES-AMOUNT < 50000 THEN
        COMPUTE COMMISSION-RATE = 3.0
    ELSE IF QUARTERLY-SALES-AMOUNT < 100000 THEN
        COMPUTE COMMISSION-RATE = 4.0
    ELSE
        COMPUTE COMMISSION-RATE = 5.0

    COMPUTE TOTAL-COMMISSION = (QUARTERLY-SALES-AMOUNT * COMMISSION-RATE) / 100.
    DISPLAY "Total commission for the quarter is " TOTAL-COMMISSION.
END PROGRAM CALCULATE-SALESPERSON-COMMISSION.