IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE1.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DEPARTMENT-CODE PIC X.
01 EMPLOYEE-NAME PIC X(20).
01 EMPLOYEE-ID PIC 9(6).
01 HIRE-DATE.
  05 HIRE-MONTH PIC XX.
  05 HIRE-YEAR PIC 9(4).
01 CURRENT-YEAR PIC 9(4) VALUE 2021.
01 WORK-YEARS PIC 9(2).
PROCEDURE DIVISION.
100-MAIN.
DISPLAY "Enter Department Code: ".
ACCEPT DEPARTMENT-CODE.
DISPLAY "Enter Employee Name: ".
ACCEPT EMPLOYEE-NAME.
DISPLAY "Enter Employee ID: ".
ACCEPT EMPLOYEE-ID.
DISPLAY "Enter Hire Month: ".
ACCEPT HIRE-MONTH.
DISPLAY "Enter Hire Year: ".
ACCEPT HIRE-YEAR.
COMPUTE WORK-YEARS = CURRENT-YEAR - HIRE-YEAR.
IF DEPARTMENT-CODE = "SALES" THEN
   DISPLAY "Employee Name: " EMPLOYEE-NAME. 
   DISPLAY "Employee ID: " EMPLOYEE-ID.
   DISPLAY "Years of Service: " WORK-YEARS.
END-IF.
STOP RUN.