PROCEDURE DIVISION.
    01 STUDENT-TABLE.
        02 STUDENT-NAME PIC X(30).
        02 STUDENT-ID PIC 9(8).
        02 STUDENT-MAJOR PIC X(20).
        02 STUDENT-GRADES.
            03 MIDTERM PIC 9(3).
            03 FINAL PIC 9(3).
            03 PROJECT PIC 9(3).
    01 LETTER-GRADES.
        02 A-COUNT PIC 99.
        02 B-COUNT PIC 99.
        02 C-COUNT PIC 99.
        02 D-COUNT PIC 99.
        02 F-COUNT PIC 99.
    01 CLASS-AVERAGE PIC 9(3)V9(2).
    01 SUM-OF-MARKS PIC 9(5).
    01 INDEXES.
        02 TOTAL-STUDENTS PIC 99.
        02 STUDENT-INDEX PIC 99.
    01 COUNTERS.
        02 A-COUNTER PIC 99.
        02 B-COUNTER PIC 99.
        02 C-COUNTER PIC 99.
        02 D-COUNTER PIC 99.
        02 F-COUNTER PIC 99.
        
    PERFORM VARYING STUDENT-INDEX FROM 1 BY 1 UNTIL STUDENT-INDEX > TOTAL-STUDENTS
        ACCEPT STUDENT-NAME
        ACCEPT STUDENT-ID
        ACCEPT STUDENT-MAJOR
        ACCEPT MIDTERM
        ACCEPT FINAL
        ACCEPT PROJECT
        MULTIPLY MIDTERM BY 30 GIVING MIDTERM-PERCENT
        MULTIPLY FINAL BY 35 GIVING FINAL-PERCENT
        MULTIPLY PROJECT BY 35 GIVING PROJECT-PERCENT
        ADD MIDTERM-PERCENT TO FINAL-PERCENT
        ADD PROJECT-PERCENT TO FINAL-PERCENT
        IF FINAL-PERCENT >= 90
            ADD 1 TO A-COUNTER
            ADD 1 TO A-COUNT
        ELSE IF FINAL-PERCENT >=80
            ADD 1 TO B-COUNTER
            ADD 1 TO B-COUNT
        ELSE IF FINAL-PERCENT >=70
            ADD 1 TO C-COUNTER
            ADD 1 TO C-COUNT
        ELSE IF FINAL-PERCENT >=60
            ADD 1 TO D-COUNTER
            ADD 1 TO D-COUNT
        ELSE
            ADD 1 TO F-COUNTER
            ADD 1 TO F-COUNT
        END-IF
        ADD FINAL-PERCENT TO SUM-OF-MARKS
    END-PERFORM
    
    COMPUTE CLASS-AVERAGE ROUNDED = SUM-OF-MARKS / TOTAL-STUDENTS.
    
    DISPLAY "Class Average = " CLASS-AVERAGE.
    DISPLAY "Number of A's: " A-COUNT.
    DISPLAY "Proportion of A's relative to class size" A-COUNT "/" TOTAL-STUDENTS.
    DISPLAY "Number of B's: " B-COUNT.
    DISPLAY "Proportion of B's relative to class size" B-COUNT "/" TOTAL-STUDENTS.
    DISPLAY "Number of C's: " C-COUNT.
    DISPLAY "Proportion of C's relative to class size" C-COUNT "/" TOTAL-STUDENTS.
    DISPLAY "Number of D's: " D-COUNT.
    DISPLAY "Proportion of D's relative to class size" D-COUNT "/" TOTAL-STUDENTS.
    DISPLAY "Number of F's: " F-COUNT.
    DISPLAY "Proportion of F's relative to class size" F-COUNT "/" TOTAL-STUDENTS.
    DISPLAY "Total Number of Students: " TOTAL-STUDENTS.
    DISPLAY "Class Average: " CLASS-AVERAGE.