IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  FIRST-NUMBER       PIC 9(3).
       01  SECOND-NUMBER      PIC 9(3).
       01  RESULT-NUMBER      PIC 9(4).
       PROCEDURE DIVISION.
           DISPLAY "Enter the first number:".
           ACCEPT FIRST-NUMBER.
           DISPLAY "Enter the second number:".
           ACCEPT SECOND-NUMBER.
           MULTIPLY FIRST-NUMBER BY SECOND-NUMBER GIVING RESULT-NUMBER.
           DISPLAY "The product of the two numbers is:" RESULT-NUMBER.
           STOP RUN.