IDENTIFICATION DIVISION.                              * START OF PROGRAM IDENTIFICATION
       PROGRAM-ID. HELLO-WORLD.                               * NAME OF PROGRAM
       ENVIRONMENT DIVISION.                                  * START OF ENVIRONMENT DIVISION
       CONFIGURATION SECTION.                                 * CONFIGURATION SECTION DEALS WITH DECLARING FILES
       INPUT-OUTPUT SECTION.
       DATA DIVISION.                                         * START OF DATA DIVISION
       FILE SECTION.                                          * DEFINES CONTENTS OF ALL FILES USED IN THE PROGRAM
       FD INPUT-FILE.                                         * FILE DESCRIPTOR FOR INPUT FILE
       01 INPUT-RECORD.                                       * RECORD FORMAT FOR INPUT FILE
          05 INPUT-NAME      PIC X(20).                       * FIELD FOR NAME WITH MAXIMUM OF 20 CHARACTERS
          05 INPUT-AGE       PIC 99.                          * FIELD FOR AGE WITH MAXIMUM OF 2 DIGITS
          05 INPUT-SALARY    PIC 9(5)V99.                     * FIELD FOR SALARY WITH MAXIMUM OF 5 DIGITS BEFORE DECIMAL AND 2 DIGITS AFTER DECIMAL
       WORKING-STORAGE SECTION.                               * DEFINES TEMPORARY STORAGE FOR CALCULATIONS AND LOGIC
       01 TOTAL-SALARY       PIC 9(7)V99.                     * FIELD FOR TOTAL SALARY WITH MAXIMUM OF 7 DIGITS BEFORE DECIMAL AND 2 DIGITS AFTER DECIMAL
       PROCEDURE DIVISION.                                    * START OF PROCEDURE DIVISION 
       100-MAIN-RUTINE.
          OPEN INPUT INPUT-FILE.                              * OPENS INPUT FILE FOR READING
       
       200-READ-RUTINE.
          READ INPUT-FILE INTO INPUT-RECORD                   * READS DATA FROM INPUT FILE INTO INPUT-RECORD
          AT END                                             * EXECUTE LOGIC IF END OF FILE IS REACHED
             DISPLAY 'END OF FILE REACHED.'                   * DISPLAYS MESSAGE ON SCREEN
             CLOSE INPUT-FILE.                               * CLOSES INPUT FILE
             STOP RUN.                                       * EXITS THE PROGRAM
          END-READ.
          
          MULTIPLY INPUT-SALARY BY 12 GIVING TOTAL-SALARY.    * MULTIPLIES SALARY BY 12 AND STORES RESULT IN TOTAL-SALARY
          DISPLAY 'TOTAL SALARY FOR ' INPUT-NAME              * DISPLAYS NAME OF EMPLOYEE
                  'IS ' TOTAL-SALARY '.'                      * DISPLAYS TOTAL SALARY FOR EMPLOYEE
       
       300-MAIN-LOOP.
          PERFORM 200-READ-RUTINE UNTIL EOF-FLAG = 'Y'.       * REPEATS READ RUTINE UNTIL END OF FILE FLAG IS SET TO 'Y'
          
          CLOSE INPUT-FILE.                                   * CLOSES INPUT FILE
          
          STOP RUN.                                           * EXITS THE PROGRAM
       END PROGRAM HELLO-WORLD.                               * END OF PROGRAM.