IDENTIFICATION DIVISION.
       PROGRAM-ID. TRANSACTION-PROCESSING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       78 DATE-LENGTH             PIC S9(4) VALUE 4.
       78 DATE-STARTING-INDEX    PIC S9(4) VALUE 1.
       78 DATE-ENDING-INDEX      PIC S9(4) VALUE 8.
       78 TIME-LENGTH             PIC S9(4) VALUE 6.
       78 TIME-STARTING-INDEX    PIC S9(4) VALUE 9.
       78 TIME-ENDING-INDEX      PIC S9(4) VALUE 14.
       01 DATE                    PIC X(4).
       01 DATE-MONTH              PIC X.
       01 DATE-DAY                PIC X.
       01 DATE-YEAR               PIC X.
       01 TIME                    PIC X(6).
       01 TIME-HOUR               PIC X(2).
       01 TIME-MINUTE             PIC X(2).
       01 TIME-SECOND             PIC X(2).
       PROCEDURE DIVISION.

       * CODE TO ACCEPT DATE AND TIME FROM USER AS STRING
       ACCEPT DATE FROM DATE-STARTING-INDEX TO DATE-ENDING-INDEX.
       ACCEPT TIME FROM TIME-STARTING-INDEX TO TIME-ENDING-INDEX.

       * VALIDATION FOR DATE INPUT
       IF DATE-LENGTH NOT = 8
       MOVE 'INVALID DATE LENGTH' TO DATE
       END-IF
       IF (DATE-MONTH < 1 OR DATE-MONTH >12)
       MOVE 'INVALID MONTH' TO DATE-MONTH
       END-IF
       IF (DATE-DAY < 1 OR DATE-DAY > 31)
       MOVE 'INVALID DAY' TO DATE-DAY
       END-IF
       IF (DATE-YEAR < 1900 OR DATE-YEAR > 9999)
       MOVE 'INVALID YEAR' TO DATE-YEAR
       END-IF

       * VALIDATION FOR TIME INPUT
       IF TIME-LENGTH NOT = 6
       MOVE 'INVALID TIME LENGTH' TO TIME
       END-IF
       IF (TIME-HOUR < 0 OR TIME-HOUR > 23)
       MOVE 'INVALID HOUR' TO TIME-HOUR
       END-IF
       IF (TIME-MINUTE < 0 OR TIME-MINUTE > 59)
       MOVE 'INVALID MINUTE' TO TIME-MINUTE
       END-IF
       IF (TIME-SECOND < 0 OR TIME-SECOND > 59)
       MOVE 'INVALID SECOND' TO TIME-SECOND
       END-IF

       * CODE TO CONVERT DATE AND TIME TO NUMERIC VALUES
       STRING DATE-MONTH DATE-DAY DATE-YEAR INTO NUMERIC-DATE
       CONVERT NUMERIC-DATE TO NUMERIC-YEAR
       MULTIPLY 10000 BY NUMERIC-YEAR GIVING NUMERIC-YEAR
       ADD NUMERIC-DATE TO NUMERIC-YEAR GIVING NUMERIC-DATE

       STRING TIME-HOUR TIME-MINUTE TIME-SECOND INTO NUMERIC-TIME
       CONVERT NUMERIC-TIME TO NUMERIC-SECOND
       MULTIPLY 100 BY NUMERIC-SECOND GIVING NUMERIC-SECOND
       ADD NUMERIC-TIME TO NUMERIC-SECOND GIVING NUMERIC-TIME

       * CODE TO OUTPUT NUMERIC VALUES OF DATE AND TIME
       DISPLAY 'DATE: ' NUMERIC-DATE
       DISPLAY 'TIME: ' NUMERIC-TIME.

       STOP RUN.