IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG.
       ENVIRONMENT DIVISION.
       INPUT OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUTFILE ASSIGN TO 'INFILE.TXT'
           SELECT OUTPUTFILE ASSIGN TO 'RESULTS.TXT'
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUTFILE
          LABEL RECORDS ARE STANDARD
          DATA RECORD IS INPUTRECORD
          FILE STATUS IS WS-INFILE-STAT.
       FD OUTPUTFILE
          LABEL RECORDS ARE OMITTED
          DATA RECORD IS OUTPUTRECORD
          FILE STATUS IS WS-OUTFILE-STAT.
       01 INPUTRECORD.
          02 NAME-IN PIC X(20).
          02 AGE-IN PIC 99.
          02 GRADE-IN PIC 99.
       01 OUTPUTRECORD.
          02 NAME-OUT PIC X(20).
          02 AGE-OUT PIC 99.
          02 RESULT-OUT PIC X.

       WORKING-STORAGE SECTION.
       01 WS-INFILE-STAT PIC XX.
       01 WS-OUTFILE-STAT PIC XX.
       01 WS-RESULT PIC X.

       PROCEDURE DIVISION.
           OPEN INPUT INPUTFILE
           OPEN OUTPUT OUTPUTFILE
           PERFORM UNTIL WS-INFILE-STAT = '10'
               READ INPUTFILE
                    AT END MOVE '10' TO WS-INFILE-STAT
               END-READ
               PERFORM PROCESS-RECORD
           END-PERFORM
           CLOSE INPUTFILE
           CLOSE OUTPUTFILE
           STOP RUN.

       PROCESS-RECORD.
           PERFORM CALCULATE-RESULT
           MOVE NAME-IN TO NAME-OUT
           MOVE AGE-IN TO AGE-OUT
           MOVE RESULT-OUT TO RESULT-OUT
           WRITE OUTPUTRECORD.
       
       CALCULATE-RESULT.
           IF GRADE-IN >= 90
               MOVE 'A' TO RESULT-OUT
           ELSE IF GRADE-IN >= 80
               MOVE 'B' TO RESULT-OUT
           ELSE IF GRADE-IN >= 70
               MOVE 'C' TO RESULT-OUT
           ELSE
               MOVE 'D' TO RESULT-OUT.