identification division.
       program-id. data-manipulation.
       environment division.
       configuration section.
           source-computer. ibm-pc.
           object-computer. ibm-pc.
       input-output section.
           file-control.
               select employee-file assign to "EMPLOYEE.DAT".
           data division.
       file section.
        FD employee-file.
        01 employee-record.
        05 employee-id pic x(8).
        05 employee-name pic x(30).
        05 employee-age pic 99.
        working-storage section.
        01 employee-counter pic 9(3).
        01 total-salary pic 9(6)v99.
        01 salary-increment pic 9.99.
        01 salary-divide pic 9.99.
        procedure division.
       000-main.
           open input employee-file.
           initialize employee-counter to 0.
           initialize total-salary to 0.
       100-read-file.
           read employee-file
               at end
                   move "END OF FILE" to employee-record
               not at end
                   perform 200-process-employee.
       150-eof.
           close employee-file
           display total-salary.
       200-process-employee.
           add salary-increment to total-salary
               giving total-salary.
           add 1 to employee-counter.
           move employee-id to employee-record.
           perform 300-output-employee.
       300-output-employee.
           display "Employee ID: ", employee-id.
           display "Employee Name: ", employee-name.
           display "Employee Age: ", employee-age.
           display "Salary Increment: ", salary-increment.
           display "Total Salary: ", total-salary.
           perform 100-read-file until employee-record = "END OF FILE".