IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SALES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       DATA DIVISION.
       FILE SECTION.
       FD ORDERS-IN.
          01 ORDER-RECORD.
             05 ORDER-NO       PIC 9(4).
             05 ORDER-TYPE     PIC X.
             05 ORDER-AMOUNT   PIC 9(5)V99.
             05 CUST-LAST-NAME PIC X(16).
             05 CUST-FIRST-NAME PIC X(16).
             05 CUST-ADDRESS-A PIC X(30).
             05 CUST-ADDRESS-B PIC X(30).
             05 CUST-CITY      PIC X(20).
             05 CUST-STATE     PIC X(2).
             05 CUST-ZIP       PIC 9(5).

       WORKING-STORAGE SECTION.
       01 TOTAL-SALES           PIC 9(5)V99 VALUE 0.
       01 ORDER-COUNT           PIC 99 VALUE 0.
       01 ORDER-TYPE-TOTALS.
          05 TABLE-ENTRY OCCURS 2 TIMES.
             10 ORDER-TYPE   PIC X.
             10 TOTAL-AMOUNT PIC 9(5)V99 VALUE 0.

       PROCEDURE DIVISION.
       PERFORM READ-ORDERS THRU END-OF-FILE
       DISPLAY "TOTAL SALES: " TOTAL-SALES
       DISPLAY "TOTAL NUMBER OF ORDERS: " ORDER-COUNT
       PERFORM DISPLAY-TYPE-TOTALS THRU DISPLAY-TYPE-TOTALS-EXIT
       STOP RUN.

       READ-ORDERS.
       READ ORDERS-IN
       AT END SET EOF TO TRUE
       NOT AT END
	       ADD ORDER-AMOUNT TO TOTAL-SALES
	       ADD 1 TO ORDER-COUNT
	       SEARCH ORDER-TYPE-TOTALS
		       WHEN ORDER-TYPE = ORDER-TYPE-TOTALS(1)
			        ADD ORDER-AMOUNT TO TOTAL-AMOUNT
			        GO TO NOT-FOUND
		       WHEN ORDER-TYPE = ORDER-TYPE-TOTALS(2)
			        ADD ORDER-AMOUNT TO TOTAL-AMOUNT
			        GO TO NOT-FOUND
		       WHEN OTHER
				 MOVE ORDER-TYPE TO ORDER-TYPE-TOTALS(1)
				 ADD ORDER-AMOUNT TO TOTAL-AMOUNT
				 EXIT PERFORM
		       NOT-FOUND DISPLAY "ORDER TYPE NOT FOUND" END-SEARCH.

       END-OF-FILE.
       DISPLAY "END OF FILE REACHED".

       DISPLAY-TYPE-TOTALS.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > ORDER-TYPE-TOTALS(2)
           DISPLAY "ORDER TYPE: " ORDER-TYPE(I)
           DISPLAY "TOTAL AMOUNT: " TOTAL-AMOUNT(I).
       DISPLAY-TYPE-TOTALS-EXIT.
       EXIT.