IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-1 PIC 9(3).
01 NUM-2 PIC 9(3).
01 RESULT PIC 9(4).
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE "123" TO NUM-1.
    MOVE "456" TO NUM-2.
    MULTIPLY NUM-1 BY 3 GIVING NUM-1.
    MULTIPLY NUM-2 BY 2 GIVING NUM-2.
    ADD NUM-1 TO NUM-2 GIVING RESULT.
    DISPLAY "The result is " RESULT.
STOP RUN.