IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATE-TOTAL.
      DATA DICTIONARY.
      01 ITEM-PRICE PIC 99.99.
      01 QUANTITY PIC 99.
      01 TOTAL-PRICE PIC $$,$$$,$$.99.

      WORKING-STORAGE SECTION.
      01 ITEM-COUNT PIC 9.

      PROCEDURE DIVISION.
      GET-ITEM-COUNT.
           ACCEPT ITEM-COUNT.

      CALCULATE-AND-SUM.
           PERFORM VARYING ITEM-INDEX FROM 1 BY 1
           UNTIL ITEM-INDEX > ITEM-COUNT
                MOVE ZERO TO TOTAL-PRICE
                PERFORM GET-NEXT-ITEM
                COMPUTE TOTAL-PRICE = ITEM-PRICE + TOTAL-PRICE
           END-PERFORM.

      DISPLAY-TOTAL.
           DISPLAY "The total price for all items is: " TOTAL-PRICE.

      GET-NEXT-ITEM.
           ACCEPT ITEM-PRICE, QUANTITY.

      STOP RUN.