IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
      **************************************************
      * This is a test program written in COBOL.
      * It calculates the average of 5 numbers.
      ************************************************** 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3).                           // Declare variable for first number
       01 NUM2 PIC 9(3).                           // Declare variable for second number
       01 NUM3 PIC 9(3).                           // Declare variable for third number
       01 NUM4 PIC 9(3).                           // Declare variable for fourth number
       01 NUM5 PIC 9(3).                           // Declare variable for fifth number
       01 AVERAGE PIC 9V99.                        // Declare variable for average
       PROCEDURE DIVISION.
       DISPLAY "Enter first number:".              // Prompt user to enter first number
       ACCEPT NUM1.                                // Store user input in NUM1 variable
       DISPLAY "Enter second number:".             // Prompt user to enter second number
       ACCEPT NUM2.                                // Store user input in NUM2 variable
       DISPLAY "Enter third number:".              // Prompt user to enter third number
       ACCEPT NUM3.                                // Store user input in NUM3 variable
       DISPLAY "Enter fourth number:".             // Prompt user to enter fourth number
       ACCEPT NUM4.                                // Store user input in NUM4 variable
       DISPLAY "Enter fifth number:".              // Prompt user to enter fifth number
       ACCEPT NUM5.                                // Store user input in NUM5 variable
       COMPUTE AVERAGE = (NUM1 + NUM2 + NUM3 + NUM4 + NUM5) / 5.  // Calculate average
       DISPLAY "The average is " AVERAGE.           // Display the calculated average
       STOP.                                       // End program execution