IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  COUNT PIC S9(6) VALUE ZERO.
       01  TOTAL PIC S9(9)V99 VALUE ZERO.
       01  PRICE PIC S9(7)V99 VALUE 50.00.
       01  SALES-TABLE.
           05  SALES-MONTH OCCURS 12 TIMES.
               10  MONTHLY-SALES PIC S9(6)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM VARYING COUNT FROM 1 BY 1
           UNTIL COUNT > 12
               ADD MONTHLY-SALES (COUNT)
                    TO TOTAL
               DISPLAY 'Monthly Sales for Month ' COUNT
                    ':' MONTHLY-SALES (COUNT)
           END-PERFORM.
           DISPLAY 'Total Sales for the Year:' TOTAL
           GOBACK.