IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERIC-VARIABLE PIC 9(4) VALUE 1234.
01 NUMERIC-VARIABLE2 PIC 9(3)V9(2).
01 ALPHANUMERIC-VARIABLE PIC X(10) VALUE "HELLO".
01 BOOLEAN-VARIABLE PIC X VALUE "Y".
01 BOOLEAN-ARRAY.
05 BOOLEAN-ELEMENT PIC X OCCURS 5 TIMES.
PROCEDURE DIVISION.
START-EXAMPLE.
DISPLAY "NUMERIC VARIABLE1: " NUMERIC-VARIABLE.
MULTIPLY NUMERIC-VARIABLE BY 2 GIVING NUMERIC-VARIABLE.
DISPLAY "NUMERIC VARIABLE AFTER MULTIPLICATION: " NUMERIC-VARIABLE.
MOVE NUMERIC-VARIABLE TO NUMERIC-VARIABLE2.
DISPLAY "NUMERIC VARIABLE2: " NUMERIC-VARIABLE2.
DISPLAY "ALPHANUMERIC VARIABLE: " ALPHANUMERIC-VARIABLE.
IF BOOLEAN-VARIABLE = "Y"
	MOVE "N" TO BOOLEAN-VARIABLE
ELSE
	MOVE "Y" TO BOOLEAN-VARIABLE.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
	MOVE BOOLEAN-VARIABLE TO BOOLEAN-ELEMENT(I).
END-PERFORM.
DISPLAY "BOOLEAN ARRAY: ".
PERFORM VARYING J FROM 1 BY 1 UNTIL J > 5
	DISPLAY BOOLEAN-ELEMENT(J).
END-PERFORM.
STOP RUN.