IDENTIFICATION DIVISION. * Beginning of program division
       PROGRAM-ID. complex-code. * Program name
       AUTHOR. John Doe. * Author name
       ENVIRONMENT DIVISION. * Beginning of environment division
       INPUT-OUTPUT SECTION. * Input/output section
       FILE-CONTROL.

       SELECT data-file ASSIGN TO "data.txt". * Selects text file for data
       SELECT output-file ASSIGN TO "output.txt". * Selects text file for output

       DATA DIVISION. * Beginning of data division
       FILE SECTION. * File section
       FD data-file * File description
       01 data-record. * Format of data in file
       05 data-field1 PIC X(10). * Data field 1 with maximum 10 characters
       05 data-field2 PIC 9(2). * Data field 2 with maximum 2 digits
       05 data-field3 PIC X(20). * Data field 3 with maximum 20 characters

       WORKING-STORAGE SECTION. * Working storage section
       01 output-record. * Format of output record
       05 output-field1 PIC X(10). * Output field 1 with maximum 10 characters
       05 output-field2 PIC 9(2). * Output field 2 with maximum 2 digits
       05 output-field3 PIC X(20). * Output field 3 with maximum 20 characters

       PROCEDURE DIVISION. * Beginning of procedure division
       OPEN INPUT data-file. * Opens data file for reading
       OPEN OUTPUT output-file. * Opens output file for writing
       PERFORM UNTIL EOF * Performs following steps until end of file is reached
           READ data-file INTO data-record. * Reads data from file into data-record
           MOVE data-field1 TO output-field1. * Moves data from data record to output record
           MOVE data-field2 TO output-field2. * Moves data from data record to output record
           MOVE data-field3 TO output-field3. * Moves data from data record to output record
           WRITE output-record. * Writes output record to output file
       END-PERFORM.
       CLOSE data-file. * Closes data file
       CLOSE output-file. * Closes output file
       STOP RUN. * End of program