IDENTIFICATION DIVISION.
      PROGRAM-ID. CALCULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NUMBER PIC 9(2).
       01 SECOND-NUMBER PIC 9(2).
       01 RESULT PIC S9(4).
       PROCEDURE DIVISION.
       BEGIN.
       DISPLAY "Please enter first number: ".
       ACCEPT FIRST-NUMBER.
       DISPLAY "Please enter second number: ".
       ACCEPT SECOND-NUMBER.
       MULTIPLY FIRST-NUMBER BY SECOND-NUMBER GIVING RESULT.
       DISPLAY "The product is: " RESULT.
       END PROGRAM CALCULATOR.