IDENTIFICATION DIVISION.             //Start of COBOL program
PROGRAM-ID. STUDENT-MARKS.

DATA DIVISION.
WORKING-STORAGE SECTION.             //Working storage section for variable declarations
    01 STUDENT-NUMBER PIC 9(6).       //Defines a variable to store student number
    01 STUDENT-NAME PIC X(20).        //Defines a variable to store student name
    01 MARKS-COMPUTER PIC 999.        //Defines a variable to store marks in computer subject
    01 MARKS-MATHS PIC 999.           //Defines a variable to store marks in maths subject
    01 MARKS-SCIENCE PIC 999.         //Defines a variable to store marks in science subject
    01 TOTAL-MARKS PIC 999.           //Defines a variable to store total marks

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Enter Student Number: ".    //Displays a message to prompt user to enter student number
    ACCEPT STUDENT-NUMBER                 //Accepts input from user and stores in STUDENT-NUMBER variable
    DISPLAY "Enter Student Name: ".       //Displays a message to prompt user to enter student name
    ACCEPT STUDENT-NAME                   //Accepts input from user and stores in STUDENT-NAME variable
    DISPLAY "Enter Marks for Computer: ". //Displays a message to prompt user to enter marks in computer subject
    ACCEPT MARKS-COMPUTER                 //Accepts input from user and stores in MARKS-COMPUTER variable
    DISPLAY "Enter Marks for Maths: ".    //Displays a message to prompt user to enter marks in maths subject
    ACCEPT MARKS-MATHS                    //Accepts input from user and stores in MARKS-MATHS variable
    DISPLAY "Enter Marks for Science: ".  //Displays a message to prompt user to enter marks in science subject
    ACCEPT MARKS-SCIENCE                  //Accepts input from user and stores in MARKS-SCIENCE variable
    COMPUTE TOTAL-MARKS = MARKS-COMPUTER + MARKS-MATHS + MARKS-SCIENCE.   //Calculates total marks
    DISPLAY "Total Marks: " TOTAL-MARKS.   //Displays total marks
    STOP.                                  //End of program
END PROGRAM STUDENT-MARKS.