IDENTIFICATION DIVISION.                             * Identifies the division
       PROGRAM-ID. MYPROGRAM.                                * Specifies the program name
       ENVIRONMENT DIVISION.                                * Specifies the environment used

       DATA DIVISION.                                       * Defines the data section
       WORKING-STORAGE SECTION.                             * Specifies the working storage area
       01 WS-COUNTER1 PIC 9(4).                              * Specifies a numeric data item
       01 WS-COUNTER2 PIC 9(4).
       01 WS-TOTAL PIC 9(6).
       01 WS-TABLE.
          05 WS-RECORD OCCURS 10 TIMES.                       * Defines a 10-element table
             10 WS-ID-NUMBER PIC X(6).                       * Defines a character data item
             10 WS-AMOUNT PIC 9(5)V99.

       PROCEDURE DIVISION.                                   * Defines the procedure section
       PERFORM VARYING WS-COUNTER1 FROM 1 BY 1 UNTIL WS-COUNTER1 = 10.
          DISPLAY "LOOP COUNTER:" WS-COUNTER1.
          ADD WS-COUNTER1 TO WS-TOTAL.
          MOVE WS-COUNTER1 TO WS-COUNTER2.
          DISPLAY "VALUE OF WS-COUNTER2:" WS-COUNTER2.

          IF WS-COUNTER1 > 5                                 * Start of conditional statement
             ADD 1 TO WS-TOTAL
          ELSE
             SUBTRACT 1 FROM WS-TOTAL
          END-IF.                                            * End of conditional statement

          PERFORM VARYING WS-COUNTER2 FROM 1 BY 1 UNTIL WS-COUNTER2 = WS-COUNTER1.
             COMPUTE WS-RECORD(WS-COUNTER2).WS-AMOUNT = WS-COUNTER2 * WS-COUNTER1.
             ADD WS-RECORD(WS-COUNTER2).WS-AMOUNT TO WS-TOTAL.
          END-PERFORM.

       DISPLAY "FINAL TOTAL IS:" WS-TOTAL.
       
       STOP RUN.                                             * Stops the program