IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS.
   05 DIVIDEND PICTURE 9(7)V9(2) VALUE +1234.56.
   05 DIVISOR PICTURE 999.99 VALUE 20.
   05 QUOTIENT PICTURE 9(4)V9(4).
   05 REMAINDER PICTURE 9(7)V9(2).

PROCEDURE DIVISION.
DIVIDE DIVIDEND BY DIVISOR GIVING QUOTIENT REMAINDER.

DISPLAY "ANSWER: " QUOTIENT.