CONFIGURATION SECTION.
       SOURCE-COMPUTER. COMPUTER1.
       OBJECT-COMPUTER. COMPUTER2.
       SPECIAL-NAMES.
           DECIMAL POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE ASSIGN TO "EMPLOYEE.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE.
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-ID PIC X(10).
           05 EMPLOYEE-NAME PIC X(20).
           05 EMPLOYEE-AGE PIC 99.
           05 EMPLOYEE-SALARY PIC 99999V99.
       WORKING-STORAGE SECTION.
       01 TOTAL-SALARY PIC 999999V99 VALUE ZERO.
       01 AVERAGE-SALARY PIC 999999V99 VALUE ZERO.
       01 NUM-EMPLOYEES PIC 99 VALUE ZERO.
       PROCEDURE DIVISION.
           OPEN INPUT EMPLOYEE-FILE.
           READ EMPLOYEE-FILE AT END GO TO END-OF-FILE.
       CALCULATE-TOTAL.
           ADD EMPLOYEE-SALARY TO TOTAL-SALARY.
           ADD 1 TO NUM-EMPLOYEES.
           READ EMPLOYEE-FILE AT END GO TO END-OF-FILE.
           IF NUM-EMPLOYEES GREATER THAN 0
               DIVIDE TOTAL-SALARY BY NUM-EMPLOYEES GIVING AVERAGE-SALARY.
           ELSE
               DISPLAY "NO EMPLOYEES FOUND".
           END-IF.
       END-OF-FILE.
           CLOSE EMPLOYEE-FILE.
           DISPLAY "TOTAL SALARY: " TOTAL-SALARY.
           DISPLAY "AVERAGE SALARY: " AVERAGE-SALARY.
           STOP RUN.