01 STUDENT-RECORD.
   05 STUDENT-NAME   PIC X(30).
   05 STUDENT-ID     PIC 9(9).
   05 STUDENT-PROGRAMMER.
      10 PROGRAMMING-COURSES OCCURS 15 TIMES.
         15 COURSE-CODE     PIC X(6).
         15 COURSE-GRADE    PIC 9.
   05 STUDENT-GPA
      10 NUM-COURSES      PIC 99.
      10 TOTAL-GRADE-PTS  PIC S9(5)V99.
      10 STUDENT-AVERAGE  PIC 999V99.


PROCEDURE DIVISION.
   DISPLAY "ENTER STUDENT NAME: ".
   ACCEPT STUDENT-NAME.
   DISPLAY "ENTER STUDENT ID: ".
   ACCEPT STUDENT-ID.
   
   DISPLAY "ENTER COURSE CODES AND GRADES: ".
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > 15.
      ACCEPT PROGRAMMING-COURSES(I).
      IF COURSE-CODE(I) = 'CSCI01'.
         PERFORM CALCULATE-GRADE-PTS.
      END-IF.
   END-PERFORM.
   
   COMPUTE STUDENT-AVERAGE = TOTAL-GRADE-PTS / NUM-COURSES.
   
   DISPLAY "STUDENT NAME: " STUDENT-NAME.
   DISPLAY "STUDENT ID: " STUDENT-ID.
   DISPLAY "STUDENT GPA: " STUDENT-AVERAGE.
   
   
CALCULATE-GRADE-PTS.
   IF COURSE-GRADE(I) = 5 OR 6.
      ADD 4 TO TOTAL-GRADE-PTS.
   ELSE IF COURSE-GRADE(I) = 7 OR 8.
      ADD 3 TO TOTAL-GRADE-PTS.
   ELSE IF COURSE-GRADE(I) = 9 OR 10.
      ADD 2 TO TOTAL-GRADE-PTS.
   ELSE IF COURSE-GRADE(I) = 11 OR 12.
      ADD 1 TO TOTAL-GRADE-PTS.
   END-IF.
   
   ADD 1 TO NUM-COURSES.