IDENTIFICATION DIVISION.
       PROGRAM-ID. PURCHASE-ORDER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUTS.
          05 WS-CUSTOMER-NAME  PIC X(30).
          05 WS-ORDER-NO       PIC 9(4).
          05 WS-ITEM-NO        PIC 9(3).
          05 WS-ITEM-DESC      PIC X(50).
          05 WS-ITEM-PRICE     PIC 9(5)V99.
          05 WS-QUANTITY       PIC 9(2).
          05 WS-TOTAL-PRICE    PIC 9(7)V99.
       01 WS-OUTPUTS.
          05 WS-RECEIPT        PIC X(60).
          05 WS-TOTAL-ORDER    PIC 9(8)V99.
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY "Welcome to the purchase order system."
           DISPLAY "Please enter customer name: "
           ACCEPT WS-CUSTOMER-NAME
           DISPLAY "Please enter order number: "
           ACCEPT WS-ORDER-NO
           DISPLAY "Please enter item number: "
           ACCEPT WS-ITEM-NO
           DISPLAY "Please enter item description: "
           ACCEPT WS-ITEM-DESC
           DISPLAY "Please enter item price: "
           ACCEPT WS-ITEM-PRICE
           DISPLAY "Please enter quantity: "
           ACCEPT WS-QUANTITY
           COMPUTE WS-TOTAL-PRICE = WS-ITEM-PRICE * WS-QUANTITY
           MOVE WS-CUSTOMER-NAME TO WS-RECEIPT
           STRING "Order Number: " WS-ORDER-NO DELIMITED BY SIZE
                  "Item Number: " WS-ITEM-NO DELIMITED BY SIZE
                  "Item Description: " WS-ITEM-DESC DELIMITED BY SIZE
                  "Item Price: $" WS-ITEM-PRICE DELIMITED BY SPACE
                  "Quantity: " WS-QUANTITY DELIMITED BY SIZE
                  "Total Price: $" WS-TOTAL-PRICE DELIMITED BY SPACE
                  INTO WS-RECEIPT
           COMPUTE WS-TOTAL-ORDER = WS-TOTAL-PRICE + WS-TOTAL-ORDER
           DISPLAY WS-RECEIPT
           DISPLAY "Total Order Price: $" WS-TOTAL-ORDER
           STOP RUN.