IDENTIFICATION DIVISION.
       PROGRAM-ID. GENERATE-ARRAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRAY-SIZE PIC 9(3).
       01 NUMERIC-ARRAY OCCURS 999 TIMES INDEXED BY I.
           05 ARRAY-ELEMENT PIC 9(3).
       PROCEDURE DIVISION.
       ACCEPT ARRAY-SIZE.
       PERFORM VARYING I FROM 1 BY 1 
             UNTIL I = ARRAY-SIZE
           DISPLAY "Enter value " I " of the array."
           ACCEPT ARRAY-ELEMENT(I)
       END-PERFORM.
       DISPLAY "The array contains the following elements: ".
       PERFORM VARYING I FROM 1 BY 1 
             UNTIL I = ARRAY-SIZE
           DISPLAY ARRAY-ELEMENT(I)
       END-PERFORM.
       STOP RUN.