IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
      * This is a calculator program that performs basic arithmetic operations.
       DATA DIVISION.
       01 NUM1 PIC 9(4).       
      * First number entered by user.
       01 NUM2 PIC 9(4).       
      * Second number entered by user. 
       01 OPERATOR PIC X(1).    
      * Operator (+, -, *, /) entered by user.
       01 RESULT PIC 9(8).      
      * Result of calculation, maximum 8 digits.

       PROCEDURE DIVISION.
       DISPLAY "Enter first number: ".
       ACCEPT NUM1.
       DISPLAY "Enter second number: ".
       ACCEPT NUM2.
       DISPLAY "Enter operator (+, -, *, /): ".
       ACCEPT OPERATOR.

       IF OPERATOR = "+" 
           COMPUTE RESULT = NUM1 + NUM2 
           GO TO DISPLAY_RESULT.
       ELSE IF OPERATOR = "-"
           COMPUTE RESULT = NUM1 - NUM2 
           GO TO DISPLAY_RESULT.
       ELSE IF OPERATOR = "*" 
           COMPUTE RESULT = NUM1 * NUM2 
           GO TO DISPLAY_RESULT.
       ELSE IF OPERATOR = "/"
           COMPUTE RESULT = NUM1 / NUM2 
           GO TO DISPLAY_RESULT.
       ELSE                 
           DISPLAY "Invalid operator.".
           STOP RUN.
       
       DISPLAY_RESULT.
       DISPLAY "The result is: ", RESULT.
       STOP RUN.