IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE-PROGRAM.
       AUTHOR. JOHN DOE.
       INSTALLATION. COMPANY ABC.

      01 STUDENT-RECORD.
          05 STUDENT-ID        PIC 9(6).
          05 STUDENT-NAME      PIC X(20).
          05 STUDENT-GRADE     PIC 9.
          05 STUDENT-ADDRESS   PIC X(30).

      PROCEDURE DIVISION.

      MAIN-PARAGRAPH.
          DISPLAY "WELCOME TO OUR SCHOOL!"
          DISPLAY "PLEASE ENTER STUDENT ID:"
          ACCEPT STUDENT-ID
          DISPLAY "PLEASE ENTER STUDENT NAME:"
          ACCEPT STUDENT-NAME
          DISPLAY "PLEASE ENTER STUDENT GRADE:"
          ACCEPT STUDENT-GRADE
          DISPLAY "PLEASE ENTER STUDENT ADDRESS:"
          ACCEPT STUDENT-ADDRESS
          
         IF STUDENT-GRADE < 60
            DISPLAY "STUDENT IS FAILING"
         ELSE
            DISPLAY "STUDENT IS PASSING"
         END-IF.
         
         ACCEPT FAREWELL-INPUT
         IF FAREWELL-INPUT = "GOODBYE"
            GO TO EXIT-PARAGRAPH
         ELSE
            GO TO MAIN-PARAGRAPH
         END-IF.
         
      EXIT-PARAGRAPH.
          DISPLAY "THANK YOU FOR USING OUR PROGRAM!"
          DISPLAY "HAVE A GREAT DAY!"
          
          STOP RUN.