IF MONTH-SELECTED < 10
           MOVE MONTH-SELECTED TO NUM-MONTH
       ELSE
           ADD MONTH-SELECTED 75 TO NUM-MONTH
       END-IF

       PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 12
           MULTIPLY NUM-MONTH BY COUNT
           MOVE NUM-MONTH TO ARRAY(COUNT)
       END-PERFORM