IDENTIFICATION DIVISION.
       PROGRAM-ID. SEARCH-ARRAY.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARRAYS.
          05 NUM-ARRAY PIC 9(10) OCCURS 10 TIMES.
       01 SEARCH-VALUE PIC 9(10).
       01 FOUND-FLAG PIC 9(1) VALUE 0.
       01 INDEX-VALUE PIC 9(2) VALUE ZERO.
       01 INVALID-ENTRY PIC 9(1) VALUE 0.
       PROCEDURE DIVISION.
       PARA-1.
          DISPLAY "ENTER A VALUE TO SEARCH FOR: "
          ACCEPT SEARCH-VALUE.
          PERFORM VARYING INDEX-VALUE FROM 1 BY 1
             UNTIL INDEX-VALUE > 10 OR FOUND-FLAG = 1
             IF INDEX-VALUE NOT = 10
                IF NUM-ARRAY(INDEX-VALUE) = SEARCH-VALUE
                   SET FOUND-FLAG TO 	1
                   DISPLAY "VALUE FOUND AT INDEX " INDEX-VALUE
             END-IF
          END-PERFORM
          IF FOUND-FLAG = 0
             DISPLAY "VALUE NOT FOUND IN ARRAY."
          END-IF
          STOP RUN.
       END PROGRAM SEARCH-ARRAY.