IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TEMPERATURE PIC 9(3).

PROCEDURE DIVISION.
DISPLAY "Enter a temperature: " WITH NO ADVANCING.
ACCEPT TEMPERATURE.
IF TEMPERATURE < 32
DISPLAY "It is freezing outside.".
ELSE
DISPLAY "It is not freezing outside.".
END-IF.

STOP RUN.