IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN-PROGRAM.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO "INFILE".
       SELECT OUTPUT-FILE ASSIGN TO "OUTFILE".

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 IN-RECORD.
   03 IN-CUSTOMER-ID          PIC X(6).
   03 IN-NAME                 PIC X(20).
   03 IN-ADDRESS              PIC X(30).
   03 IN-AGE                  PIC 99.
   03 IN-GENDER               PIC X.
 
FD OUTPUT-FILE.
01 OUT-RECORD.
   03 OUT-CUSTOMER-ID         PIC X(6).
   03 OUT-NAME                PIC X(20).
   03 OUT-ADDRESS             PIC X(30).
   03 OUT-AGE                 PIC 99.
   03 OUT-GENDER              PIC X.
   
WORKING-STORAGE SECTION.
01 WS-COUNT                   PIC 99 VALUE 0.
01 WS-TOTAL-AGE               PIC 99 VALUE 0.

PROCEDURE DIVISION.
1. MAIN-PROCEDURE.
    PERFORM INITIALIZE-FILES
    PERFORM READ-INPUT-RECORD
       UNTIL IN-RECORD = 'END'
    STOP RUN.
    
INITIALIZE-FILES.
    OPEN INPUT INPUT-FILE
    OPEN OUTPUT OUTPUT-FILE.
    
READ-INPUT-RECORD.
    READ INPUT-FILE
      AT END
        CLOSE INPUT-FILE
        CLOSE OUTPUT-FILE
        MOVE 'END' TO IN-RECORD
    END-READ.
    
    IF IN-GENDER = 'M' THEN
       ADD 1 TO WS-COUNT
       ADD IN-AGE TO WS-TOTAL-AGE
       MOVE IN-RECORD TO OUT-RECORD
       WRITE OUTPUT-FILE FROM OUT-RECORD.
       
    ELSE IF IN-GENDER = 'F' THEN
       ADD 1 TO WS-COUNT
       ADD IN-AGE TO WS-TOTAL-AGE
       MOVE IN-RECORD TO OUT-RECORD
       WRITE OUTPUT-FILE FROM OUT-RECORD.
       
    ELSE IF IN-GENDER = 'O' THEN
       ADD 1 TO WS-COUNT
       ADD IN-AGE TO WS-TOTAL-AGE
       MOVE IN-RECORD TO OUT-RECORD
       WRITE OUTPUT-FILE FROM OUT-RECORD.
       
    ELSE
       DISPLAY 'ERROR: INVALID GENDER'
       MOVE 'END' TO IN-RECORD.