IDENTIFICATION DIVISION.
       PROGRAM-ID.    COMPLEX-CODE.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 NUM1        PIC 9(9).
       01 NUM2        PIC 9(9).
       01 ANSWER      PIC 9(9) VALUE ZERO.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Please enter two numbers:"
           ACCEPT NUM1
           ACCEPT NUM2
           
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM2
               MULTIPLY NUM1 BY NUM2 GIVING ANSWER
               DISPLAY "The answer is:" ANSWER
           END-PERFORM
           
           STOP RUN.