IDENTIFICATION DIVISION.
PROGRAM-ID. SampleProgram.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 my-numbers TABLE OF 5 INTEGER.
01 total_number INTEGER.
01 i INTEGER.

PROCEDURE DIVISION.
MAIN-LOGIC.
    INITIALIZE my-numbers
    PERFORM VARYING i FROM 1 BY 1 UNTIL i > 5
        ADD 2 TO my-numbers(i)
    END-PERFORM
    DISPLAY "My Numbers: "
    PERFORM VARYING i FROM 1 BY 1 UNTIL i > 5
        DISPLAY my-numbers(i)
    END-PERFORM
    COMPUTE total_number = FUNCTION SUM(my-numbers)
    DISPLAY "Total Number: " total_number
    STOP RUN.