IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-AVERAGE.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO 'INPUT.TXT'
                  ORGANIZATION IS LINE SEQUENTIAL.
           SELECT OUT-FILE ASSIGN TO 'OUTPUT.TXT'
                  ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 IN-RECORD.
           05 IN-GRADE PIC X(3).
           05 IN-NAME PIC X(15).
       
       FD OUT-FILE.
       01 OUT-RECORD.
           05 OUT-GRADE PIC X(3).
           05 OUT-NAME PIC X(15).
           05 OUT-AVERAGE PIC X(5).
       
       WORKING-STORAGE SECTION.
       77 NUM-STUDENTS PIC 9(3) VALUE 0.
       77 TOTAL-GRADES PIC 9(3)V99 VALUE 0.
       77 AVERAGE-GRADE PIC 9(3)V99 VALUE 0.
       77 GRADE-TABLE OCCURS 100 INDEXED BY I.
           05 GRADE-LIST PIC 9(3)V99 OCCURS 100 TIMES.
           05 NAME-LIST PIC X(15) OCCURS 100 TIMES.
       
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           OPEN INPUT IN-FILE
           PERFORM READ-PARAGRAPH
           PERFORM CALC-PARAGRAPH
           PERFORM WRITE-PARAGRAPH
           CLOSE IN-FILE
           STOP RUN.
           
       READ-PARAGRAPH.
           PERFORM UNTIL IN-FILE AT END
               READ IN-FILE
                   AT END MOVE 'Y' TO FLAG-EOF
                   NOT AT END
                       ADD 1 TO NUM-STUDENTS
                       SET I TO NUM-STUDENTS
                       MOVE IN-GRADE TO GRADE-LIST(I)
                       MOVE IN-NAME TO NAME-LIST(I)
               END-READ
           END-PERFORM.
           
       CALC-PARAGRAPH.
           PERFORM VARYING I FROM 1 BY 1
              UNTIL I > NUM-STUDENTS
                  ADD GRADE-LIST(I) TO TOTAL-GRADES
           END-PERFORM
           DIVIDE TOTAL-GRADES BY NUM-STUDENTS
               GIVING AVERAGE-GRADE.
       
       WRITE-PARAGRAPH.
           OPEN OUTPUT OUT-FILE
           MOVE 'NAME' TO OUT-NAME
           MOVE 'GRADE' TO OUT-GRADE
           MOVE 'AVERAGE' TO OUT-AVERAGE
           WRITE OUT-RECORD
           WRITE OUT-RECORD FROM NAME-LIST(I)
               AFTER ADVANCING 1 LINES
           WRITE OUT-RECORD FROM GRADE-LIST(I)
               AFTER ADVANCING 1 LINES
           WRITE OUT-RECORD FROM AVERAGE-GRADE
              AFTER ADVANCING 1 LINES
           CLOSE OUT-FILE.