IDENTIFICATION DIVISION.                                                        
PROGRAM-ID.  TEST-PROGRAM.                                                       
DATA DIVISION.                                                                  
   WORKING-STORAGE SECTION.                                                     
   01  WS-INPUT-DATA.                                                            
       05 WS-NUM-1              PIC 9(6) VALUE 100020.                           
       05 WS-NUM-2              PIC 9(6) VALUE 5045.                             
       05 WS-NUM-3              PIC 9(6) VALUE 4152.                             
   01  WS-OUTPUT-DATA.                                                           
       05 WS-TOTAL              PIC 9(6).                                       
       05 WS-PRODUCT            PIC 9(6).                                       
       05 WS-AVG                PIC 9(6)V99.                                    
   WORKING-STORAGE SECTION.                                                     
   01  WS-TEMP-NUM.                                                               
       05 WS-TEMP-NUM1          PIC 9(6).                                  
       05 WS-TEMP-NUM2          PIC 9(6).
       05 WS-TEMP-MULTIPLY      PIC 9(6).
       05 WS-TEMP-AVERAGE       PIC 9(6)V99.                              
PROCEDURE DIVISION.                                                              
MAIN-PROCESS.                                                                   
   MOVE WS-NUM-1 TO WS-TEMP-NUM1.                                                           
   MOVE WS-NUM-1 TO WS-TEMP-NUM2.
   ADD WS-NUM-2 TO WS-TEMP-NUM1.                                                           
   MULTIPLY WS-TEMP-NUM1 BY WS-NUM-3 GIVING WS-TEMP-MULTIPLY.                         
   DIVIDE WS-TEMP-MULTIPLY BY WS-NUM-1 GIVING WS-AVG.                           
   ADD WS-TEMP-NUM1 WS-TEMP-NUM2 TO WS-TOTAL.                          
   SUBTRACT WS-TEMP-NUM2 WS-TEMP-NUM1 FROM WS-TOTAL.                  
   SUBTRACT WS-NUM-1 FROM WS-TOTAL.
   MOVE WS-TOTAL TO WS-PRODUCT.                                     
   DISPLAY 'The sum of all three numbers is: ' WS-TOTAL.                              
   DISPLAY 'The average of all three numbers is: ' WS-AVG.                              
   DISPLAY 'The product of all three numbers is: ' WS-PRODUCT.                              
STOP RUN.