IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEXCODE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  MY-VARIABLE-1 PIC X(10).
       01  MY-VARIABLE-2 PIC 9(2)V9(4) VALUE 10.4567.
       01  MY-VARIABLE-3 PIC 9(4) COMP-3 VALUE 1234.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "My Variable 1: " MY-VARIABLE-1.
           MULTIPLY MY-VARIABLE-2 BY MY-VARIABLE-3 GIVING MY-VARIABLE-1.
           DISPLAY "New value of 1: " MY-VARIABLE-1.
           COMPUTE MY-VARIABLE-2 ROUNDED = MY-VARIABLE-3 * MY-VARIABLE-1.
           DISPLAY "New value of 2: " MY-VARIABLE-2.
           ADD 1 TO MY-VARIABLE-3.
           DISPLAY "New value of 3: " MY-VARIABLE-3.
           PERFORM SUB-PROCEDURE-1.
           PERFORM SUB-PROCEDURE-2 MY-VARIABLE-1, MY-VARIABLE-2, MY-VARIABLE-3.
       END MAIN-PROCEDURE.

       SUB-PROCEDURE-1.
           DISPLAY "This is a sub-procedure.".

       SUB-PROCEDURE-2 USING ARG-1, ARG-2, ARG-3.
           DISPLAY "Value of Arg1: " ARG-1.
           DISPLAY "Value of Arg2: " ARG-2.
           DISPLAY "Value of Arg3: " ARG-3.
           MOVE "NEW VALUE" TO ARG-1.
           MOVE 20.3456 TO ARG-2.
           ADD 5 TO ARG-3.
           DISPLAY "New value of Arg1: " ARG-1.
           DISPLAY "New value of Arg2: " ARG-2.
           DISPLAY "New value of Arg3: " ARG-3.
       END SUB-PROCEDURE-2.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEXCODE.