IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       AUTHOR. COBOLPROGRAMMER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT INFILE ASSIGN TO "INPUT.TXT".
          SELECT OUTFILE ASSIGN TO "OUTPUT.TXT".

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-REC.
          05 IN-NAME PIC X(20).
          05 IN-AGE PIC 99.

       FD OUTFILE.
       01 OUT-REC PIC X(30).

       WORKING-STORAGE SECTION.
       01 COUNT PIC 9(3).
       01 TOTAL-AGE PIC 9(10).

       PROCEDURE DIVISION.
       OPEN INPUT INFILE.
       OPEN OUTPUT OUTFILE.
       MOVE 0 TO COUNT, TOTAL-AGE.
       PERFORM UNTIL INFILE = "EOF"
          READ INFILE INTO IN-REC
          ADD IN-AGE TO TOTAL-AGE
          ADD 1 TO COUNT
          PERFORM DISPLAY-IN-REC
       END-PERFORM.
       MOVE "TOTAL NO. OF RECORDS: " TO OUT-REC
       STRING COUNT DELIMITED SPACE
       "TOTAL AGE: " DELIMITED SPACE
       TOTAL-AGE TO OUT-REC
       WRITE OUT-REC FROM OUT-REC
       CLOSE INFILE.
       CLOSE OUTFILE.
       STOP RUN.

       DISPLAY-IN-REC.
       MOVE IN-NAME TO OUT-REC
       STRING ":" DELIMITED SPACE
       IN-AGE DELIMITED SPACE
       WRITE OUT-REC FROM OUT-REC.