IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.
       ENVIRONMENT DIVISION.
       INPUT OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(9).
       01 NUM2 PIC 9(9).
       01 SUM PIC 9(9).
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "ENTER FIRST NUMBER:".
           ACCEPT NUM1.
           DISPLAY "ENTER SECOND NUMBER:".
           ACCEPT NUM2.
           COMPUTE SUM = NUM1 + NUM2.
           DISPLAY "THE SUM IS:" SUM.
           STOP RUN.