IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROG.
      * This program calculates the factorial of a number
       AUTHOR. JOHN DOE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INPUT-FILE ASSIGN TO "INPUT.TXT".

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 DATA.
           02 NUM PIC 9(4).

       WORKING-STORAGE SECTION.
       01 FACTORIAL PIC 9(15).

       PROCEDURE DIVISION.
       PERFORM READ-LOOP 10 TIMES.

       READ-LOOP.
           READ INPUT-FILE INTO DATA.
           IF NUM NOT = ZERO
               PERFORM CALC-FACTORIAL
           ELSE
               DISPLAY "Number cannot be zero".
               EXIT PROGRAM.
           END-IF.
           DISPLAY "Factorial of " NUM " is : " FACTORIAL.

       CALC-FACTORIAL.
           IF NUM = 1
               MOVE 1 TO FACTORIAL.
           ELSE
               MULTIPLY NUM BY FACTORIAL GIVING FACTORIAL.
               SUBTRACT 1 FROM NUM.
               PERFORM CALC-FACTORIAL.
           END-IF.