IDENTIFICATION DIVISION.
PROGRAM-ID. COMPLEX-CALCULATIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBER-ONE PIC S9(3)V(2).
01 NUMBER-TWO PIC S9(3)V(2).
01 RESULT PIC S9(3)V(2).
01 TEMP PIC S9(5).

PROCEDURE DIVISION.
BEGIN.
    MOVE 123.45 TO NUMBER-ONE.
    MOVE -21.57 TO NUMBER-TWO.
    COMPUTE RESULT = (NUMBER-ONE + NUMBER-TWO) / 2 * 5.
    DISPLAY "The result is: " RESULT.
    MOVE -123.45 TO TEMP.
    ADD TEMP TO NUMBER-TWO GIVING RESULT.
    DISPLAY "The new result is: " RESULT.
    MULTIPLY RESULT BY 10 GIVING TEMP.
    DISPLAY "The final result is: " TEMP.
STOP RUN.