IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5) VALUE 100.
01 NUM2 PIC 9(5) VALUE 200.
01 RESULT PIC 9(6) VALUE 0.

PROCEDURE DIVISION.
MULTIPLY NUM1 BY NUM2 GIVING RESULT.

DISPLAY "The value of NUM1 is: " NUM1
DISPLAY "The value of NUM2 is: " NUM2
DISPLAY "The result of the multiplication is: " RESULT

STOP RUN.