IDENTIFICATION DIVISION.                 // This is the identification division
    PROGRAM-ID. HELLO-WORLD.                  // Program name
    DATA DIVISION.                            // This is the data division
    WORKING-STORAGE SECTION.                  // This is the working storage section
    01 MESSAGE PIC X(20) VALUE "Hello, World!". // Declaring a variable to hold the message
    PROCEDURE DIVISION.                       // This is the procedure division
        DISPLAY MESSAGE.                      // Displaying the message
        STOP RUN.                             // Terminating the program