IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMBER PIC 9(3) VALUE 123.

PROCEDURE DIVISION.
    PERFORM CALCULATIONS
    DISPLAY "Result: " WS-NUMBER.

CALCULATIONS.
    IF WS-NUMBER > 100
       MULTIPLY WS-NUMBER BY 10
    ELSE
       SUBTRACT 10 FROM WS-NUMBER
    END-IF.