IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROGRAM1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION. 

       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-NAME PIC X(20).
           05 EMPLOYEE-ID   PIC 9(9).
           05 EMPLOYEE-AGE  PIC 99.
           05 ADDRESS       PIC X(30).
           05 SALARY        PIC 9(6)V99.

       01 TAXES-RECORD.
           05 TAX-RATE PIC 9(3).
           05 TAX-DUE  PIC 9(6)V99.

       LINKAGE SECTION.
       01 INPUT-TAX-RATE PIC 9(3).
       01 OUTPUT-TAX-DUE PIC 9(6)V99.

       PROCEDURE DIVISION.
       MAIN-PROGRAM.

           DISPLAY "Enter Tax Rate: ".
           ACCEPT INPUT-TAX-RATE FROM CONSOLE.

           PERFORM CALCULATE-TAX UNTIL INPUT-TAX-RATE = 999.9.

           START-OF-SUBPROGRAM.
           MOVE TAX-RATE TO OUTPUT-TAX-RATE.
           COMPUTE TAX-DUE = (TAX-RATE/100) * SALARY.

           START-OF-SUBPROGRAM2.
           ADD 1 TO EMPLOYEE-AGE.
           IF ADDRESS = " " THEN
               MOVE "Unknown" TO ADDRESS.

           START-OF-SUBPROGRAM3.
           DISPLAY "Employee Name: " EMPLOYEE-NAME.
           DISPLAY "Tax Rate: " TAX-RATE.
           DISPLAY "Tax Due: " TAX-DUE.

       CALUCLATE-TAX.
           PERFORM START-OF-SUBPROGRAM.
           PERFORM START-OF-SUBPROGRAM2.
           PERFORM START-OF-SUBPROGRAM3.

           DISPLAY "Enter Tax Rate: ".
           ACCEPT INPUT-TAX-RATE FROM CONSOLE.
       END-PERFORM.
           
       STOP RUN.
       END PROGRAM COBPROGRAM1.