IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE ASSIGN TO "EMPLOY.DAT".
           SELECT RESULT-FILE ASSIGN TO "PAYROLL.SUM".

       DATA DIVISION.
       FILE SECTION.
       FD  EMPLOYEE-FILE
           RECORDING MODE IS F,ORIGIN IS 1.
       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-NAME PIC X(30).
           05 EMPLOYEE-ID PIC 9(4).
           05 EMPLOYEE-DEPARTMENT PIC X(20).
           05 EMPLOYEE-SALARY PIC 9(6)V99.
       FD  RESULT-FILE
           RECORDING MODE IS F,ORIGIN IS 1.
       01 RESULT-RECORD PIC X(80).

       WORKING-STORAGE SECTION.
       01 TOTAL-EMPLOYEES PIC 99.
       01 TOTAL-SALARY PIC 9(9)V99.
       01 AVERAGE-SALARY PIC 9(6.V99).

       PROCEDURE DIVISION.
       SORT EMPLOYEE-FILE ON ASCENDING EMPLOYEE-DEPARTMENT.

       OPEN INPUT EMPLOYEE-FILE.
       OPEN OUTPUT RESULT-FILE.

       READ EMPLOYEE-FILE.

       PERFORM UNTIL EMPLOYEE-FILE IS AT END
           ADD EMPLOYEE-SALARY TO TOTAL-SALARY
           ADD 1 TO TOTAL-EMPLOYEES
           MOVE EMPLOYEE-RECORD TO RESULT-RECORD
           WRITE RESULT-RECORD
           READ EMPLOYEE-FILE
       END-PERFORM.

       IF TOTAL-EMPLOYEES = 0
           DISPLAY "No employees found."
       ELSE
           COMPUTE AVERAGE-SALARY = TOTAL-SALARY / TOTAL-EMPLOYEES
           DISPLAY "Total employees: " TOTAL-EMPLOYEES
           DISPLAY "Total salary: " TOTAL-SALARY
           DISPLAY "Average salary: " AVERAGE-SALARY
       END-IF.

       CLOSE EMPLOYEE-FILE.
       CLOSE RESULT-FILE.

       STOP RUN.