000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 WS-MESSAGE PIC X(16) VALUE "HELLO, WORLD!".
000700 PROCEDURE DIVISION.
000800 DISPLAY WS-MESSAGE.
000900 STOP RUN.