IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3287-1.
OBJECT-COMPUTER. IBM-3287-1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MESSAGE PIC X(50) VALUE 'Hello, world!'.
01 WRAPPER PIC X(3) VALUE '+++ '.

PROCEDURE DIVISION.
DISPLAY '+++ ' MESSAGE.
STOP RUN.