IDENTIFICATION DIVISION.
PROGRAM-ID. CALC-SUM.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  VAR-1 PIC 9(3).
01  VAR-2 PIC 9(3).
01  SUM PIC 9(4).
PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "ENTER FIRST NUMBER: ".
    ACCEPT VAR-1.
    DISPLAY "ENTER SECOND NUMBER: ".
    ACCEPT VAR-2.
    COMPUTE SUM = VAR-1 + VAR-2.
    DISPLAY "THE SUM IS: " SUM.
STOP RUN.