IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPLEX-PROGRAM.
       AUTHOR. YOUR NAME.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC S9(3) VALUE 123.
       01 NUM2 PIC S9(3) VALUE 321.
       01 RESULT PIC S9(4) VALUE 0.

       PROCEDURE DIVISION.
       COMPUTE RESULT = NUM1 + NUM2.
       DISPLAY "The result of adding NUM1 and NUM2 is: " RESULT.
       COMPUTE RESULT = NUM1 - NUM2.
       DISPLAY "The result of subtracting NUM2 from NUM1 is: " RESULT.
       COMPUTE RESULT = NUM1 * NUM2.
       DISPLAY "The result of multiplying NUM1 and NUM2 is: " RESULT.
       COMPUTE RESULT = NUM1 / NUM2.
       DISPLAY "The result of dividing NUM1 by NUM2 is: " RESULT.

       STOP RUN.