*> This code snippet performs a bubble sort on an array
IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLE-SORT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(3).
01 NUMBERS.
   05 NUMBERS-ARRAY OCCURS 30 TIMES
      INDEXED BY ARRAY-INDEX.
      10 NUMBER PIC 9(3).
01 TEMP PIC 9(3).

PROCEDURE DIVISION.
MAIN.
   DISPLAY "Enter the size of the array: ".
   ACCEPT ARRAY-SIZE.

   PERFORM VARYING ARRAY-INDEX FROM 1 BY 1 UNTIL ARRAY-INDEX > ARRAY-SIZE
      DISPLAY "Enter number " ARRAY-INDEX " : ".
      ACCEPT NUMBERS(NUMBER-INDEX).

   PERFORM BUBBLE-SORT.

   DISPLAY "Sorted Array: ".
   PERFORM VARYING ARRAY-INDEX FROM 1 BY 1 UNTIL ARRAY-INDEX > ARRAY-SIZE
      DISPLAY NUMBERS(ARRAY-INDEX).
   STOP RUN.

BUBBLE-SORT.
   PERFORM VARYING OUTER-INDEX FROM ARRAY-SIZE BY -1 UNTIL OUTER-INDEX < 1
      PERFORM VARYING INNER-INDEX FROM 1 BY 1 UNTIL INNER-INDEX >= OUTER-INDEX
         IF NUMBERS(INNER-INDEX) > NUMBERS(INNER-INDEX+1)
            MOVE NUMBERS(INNER-INDEX) TO TEMP
            MOVE NUMBERS(INNER-INDEX+1) TO NUMBERS(INNER-INDEX)
            MOVE TEMP TO NUMBERS(INNER-INDEX+1)
         END-IF
      END-PERFORM
   END-PERFORM.

*> This code snippet uses a modified bubble sort algorithm to sort an array
IDENTIFICATION DIVISION.
PROGRAM-ID. MOD-BUBBLE-SORT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(3).
01 NUMBERS.
   05 NUMBERS-ARRAY OCCURS 30 TIMES
      INDEXED BY ARRAY-INDEX.
      10 NUMBER PIC 9(3).
01 TEMP PIC 9(3).
01 SWAP-SWITCH PIC X.

PROCEDURE DIVISION.
MAIN.
   DISPLAY "Enter the size of the array: ".
   ACCEPT ARRAY-SIZE.

   PERFORM VARYING ARRAY-INDEX FROM 1 BY 1 UNTIL ARRAY-INDEX > ARRAY-SIZE
      DISPLAY "Enter number " ARRAY-INDEX " : ".
      ACCEPT NUMBERS(NUMBER-INDEX).

   PERFORM MOD-BUBBLE-SORT.

   DISPLAY "Sorted Array: ".
   PERFORM VARYING ARRAY-INDEX FROM 1 BY 1 UNTIL ARRAY-INDEX > ARRAY-SIZE
      DISPLAY NUMBERS(ARRAY-INDEX).
   STOP RUN.

MOD-BUBBLE-SORT.
   PERFORM VARYING OUTER-INDEX FROM ARRAY-SIZE BY -1 UNTIL OUTER-INDEX < 1
      MOVE "N" TO SWAP-SWITCH
      PERFORM VARYING INNER-INDEX FROM 1 BY 1 UNTIL INNER-INDEX >= OUTER-INDEX
         IF NUMBERS(INNER-INDEX) > NUMBERS(INNER-INDEX+1)
            MOVE NUMBERS(INNER-INDEX) TO TEMP
            MOVE NUMBERS(INNER-INDEX+1) TO NUMBERS(INNER-INDEX)
            MOVE TEMP TO NUMBERS(INNER-INDEX+1)
            MOVE "Y" TO SWAP-SWITCH
         END-IF
      END-PERFORM
      IF SWAP-SWITCH = "N"
         EXIT PERFORM
      END-IF
   END-PERFORM.