IDENTIFICATION DIVISION.                                    
       PROGRAM-ID. EXAMPLE.                                         
       DATA DIVISION.                                               
       WORKING-STORAGE SECTION.                                     
       01  VAR-ONE                 PIC X(10) VALUE "COBOL".          
       01  VAR-TWO                 PIC X(10) VALUE "PROGRAMMING".    
       01  VAR-THREE               PIC X(10) VALUE "LANGUAGE".      
       01  FINAL-VAR               PIC X(30).                       
       PROCEDURE DIVISION.                                          
       MOVE VAR-ONE TO FINAL-VAR.                                   
       DISPLAY FINAL-VAR.                                           
       MOVE VAR-TWO TO FINAL-VAR.                                   
       DISPLAY FINAL-VAR.                                           
       MOVE VAR-THREE TO FINAL-VAR.                                 
       DISPLAY FINAL-VAR.                                           
       STOP RUN.