Identification division.
       Program-id. print-multiplication-table.

       Environment division.
       Input-output section.

       Data division.
       Working-storage section.
       77 table-size pic 9(3).
       77 input-number pic 9(3).
       77 output-number pic 9(4).
       
       Procedure division.
       Begin. 
           Display "Enter the size of the multiplication table (1-100): ".
           Accept table-size.
           Display "Enter the number to multiply: ".
           Accept input-number.
           
           If table-size is greater than 100
               Display "Invalid input, table size must be less than 100."
           Else
               Perform calculate-multiplication.
           
           Display "Multiplication table for " input-number " : ".
           Perform display-table.
           
           Stop run.
       
       calculate-multiplication.
           Perform varying i from 1 by 1 until i is equal to table-size
               Multiply input-number by i giving output-number.
               Display input-number " * " i " = " output-number.
       
       display-table.
           Perform varying i from 1 by 1 until i is equal to table-size
               Multiply input-number by i giving output-number.
               Display i " * " input-number " = " output-number.