IDENTIFICATION DIVISION.
       PROGRAM-ID. fibonacci.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMBER-1 PIC 9(3) VALUE 0.
       01 NUMBER-2 PIC 9(3) VALUE 1.
       01 FIB-NUM PIC 9(3).

       PROCEDURE DIVISION.
       MAIN-PARA.
       DISPLAY "Enter the number of fibonacci numbers to generate: ".
       ACCEPT FIB-NUM.

       IF FIB-NUM = 0
           DISPLAY "Invalid entry. Please enter a number greater than 0.".
       END-IF.

       PERFORM CALCULATE-FIB UNTIL NUMBER-1 >= FIB-NUM.

       DISPLAY "The first " FIB-NUM " fibonacci numbers are: ".
       PERFORM PRINT-FIB.

       STOP RUN.

       CALCULATE-FIB.
       COMPUTE NUMBER-1 = NUMBER-1 + NUMBER-2.
       COMPUTE NUMBER-2 = NUMBER-1 - NUMBER-2.

       PRINT-FIB.
       COMPUTE FIB-NUM = NUMBER-1.
       DISPLAY FIB-NUM.