IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 VARIABLE-1 PIC X(10) VALUE 'HELLO'.
77 VARIABLE-2 PIC X(10) VALUE 'WORLD'.
PROCEDURE DIVISION.
DISPLAY VARIABLE-1.
DISPLAY VARIABLE-2.
STOP RUN.