IDENTIFICATION DIVISION.
PROGRAM-ID. MyProgram.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Counters.
   05 A PIC 9 VALUE 0.
   05 B PIC 9 VALUE 0.
   05 C PIC 9 VALUE 0.

01 Results.
   05 A-B PIC 9 VALUE 0.
   05 B-C PIC 9 VALUE 0.
   05 Output PIC X(20) VALUE SPACES.

PROCEDURE DIVISION.
Main.
   PERFORM Calculate-A-B 
   PERFORM Calculate-B-C
   DISPLAY "Output: " Output.
   STOP RUN.

Calculate-A-B.
   IF A > B THEN
       SUBTRACT B FROM A GIVING A-B
   ELSE
       SUBTRACT A FROM B GIVING A-B.

Calculate-B-C.
   IF B > C THEN
       SUBTRACT C FROM B GIVING B-C
   ELSE
       SUBTRACT B FROM C GIVING B-C.

   MULTIPLY A-B BY B-C GIVING Output.