IDENTIFICATION DIVISION.
PROGRAM-ID. MYPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM1 PIC 9(5) VALUE 5000.
01 NUM2 PIC 9(5) VALUE 2000.
01 RESULT PIC S9(9) USAGE COMP-3.

PROCEDURE DIVISION.
CALCULATE-RESULT.
   MULTIPLY NUM1 BY NUM2 GIVING RESULT.
   DISPLAY 'Result is ' RESULT.

STOP RUN.