IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ITEMS PIC 9(3) VALUE ZERO.
       01 ITEM-DESC   PIC A(20).
       01 ITEM-PRICE  PIC 9(5)V99.
       01 TOTAL-PRICE PIC 9(6)V99.
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY "WELCOME TO MY PROGRAM".
           PERFORM GET-INPUT UNTIL NUM-ITEMS = 000.
           DISPLAY "ITEM NUMBER   ITEM DESCRIPTION        PRICE   TOTAL".
       
       ITEM-LOOP.
           PERFORM PROCESS-ITEM.
           IF NUM-ITEMS NOT = 000
               GO TO ITEM-LOOP.
           DISPLAY "TOTAL PRICE:" TOTAL-PRICE.
           
       GET-INPUT.
           DISPLAY "ENTER NUMBER OF ITEMS (000 TO QUIT):".
           ACCEPT NUM-ITEMS.
           
       PROCESS-ITEM.
           DISPLAY "ENTER ITEM DESCRIPTION:".
           ACCEPT ITEM-DESC.
           DISPLAY "ENTER ITEM PRICE:".
           ACCEPT ITEM-PRICE.
           COMPUTE TOTAL-PRICE = TOTAL-PRICE + ITEM-PRICE.
           
       END.
       STOP RUN.