IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-TABLE.
           05 NUM-TABLE-ENTRY.
               10 NUM PIC 9(3) OCCURS 5 TIMES.
               10 DESC PIC X(10) OCCURS 5 TIMES.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
               PERFORM VARYING J FROM 1 BY 1 UNTIL J > 5
                   IF NUM-TABLE-ENTRY(I).NUM(J) = 100
                       ADD 1 TO NUM-TABLE-ENTRY(I).DESC(J)
           DISPLAY "NUMBERS  DESCRIPTORS"
           PERFORM VARYING K FROM 1 BY 1 UNTIL K > 5
               DISPLAY "ROW " K
               PERFORM VARYING L FROM 1 BY 1 UNTIL L > 5
                   DISPLAY NUM-TABLE-ENTRY(K).NUM(L)"           "NUM-TABLE-ENTRY(K).DESC(L)

               END-PERFORM
           END-PERFORM.

       STOP RUN.