IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD-ARRAY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ARR-LEN PIC S9(4) 
          VALUE 10.
       01 ARRAY OCCURS ARR-LEN TIMES 
          INDEXED BY IDX.
          05 ELEM PIC S9(4) OCCURS 10 TIMES. 

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           PERFORM VARYING IDX 
                      FROM 1 BY 1 
                      UNTIL IDX > ARR-LEN 
               THRU ADD-ELEMENTS
               DISPLAY "ELEMENTS ADDED" 
               ADD ELEM(ARRAY(IDX)) TO ELEM(ARRAY(IDX+5)) 
               END-PERFORM.
           DISPLAY "NEW ARRAY:" 
           PERFORM VARYING IDX 
                      FROM 1 BY 1 
                      UNTIL IDX > ARR-LEN 
               DISPLAY "ARRAY(" IDX "):" 
               MOVE ELEM(ARRAY(IDX)) TO ELEM(ARRAY(IDX+5)) 
               DISPLAY ELEM(ARRAY(IDX)) 
               END-PERFORM.
               
       ADD-ELEMENTS. 
           PERFORM VARYING VALUE 
                      FROM 1 BY 1 
                      UNTIL VALUE > 10 
               THRU ADD-TO-FIRST
               ADD VALUE TO ELEM(ARRAY(IDX)) 
               END-PERFORM.
               
       ADD-TO-FIRST. 
           ADD 1 TO ELEM(ARRAY(IDX)) 
           
       END PROGRAM ADD-ARRAY.