IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5).
       01 NUM2 PIC 9(5).
       01 RESULT PIC 9(5).
       PROCEDURE DIVISION.
       BEGIN.
            DISPLAY 'ENTER FIRST NUMBER: '.
            ACCEPT NUM1.
            DISPLAY 'ENTER SECOND NUMBER: '.
            ACCEPT NUM2.
            MULTIPLY NUM1 BY NUM2
                GIVING RESULT.
            DISPLAY 'THE MULTIPLICATION IS: ' RESULT.
            STOP RUN.
       END PROGRAM HELLO-WORLD.