IDENTIFICATION DIVISION.
      PROGRAM-ID. ADVANCED-CALCULATOR.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-1 PIC S9(4)V COLOR RED.

       01 INPUT-2 PIC S9(4)V COLOR BLUE.

       01 PROCESS-DATA PIC S9(4)V.
       01 CALC-RESULT PIC X COLOR PURPLE.

       PROCEDURE DIVISION.
       START-PROGRAM.
           PERFORM INPUT-1-PROMPT.
           ACCEPT INPUT-1.
           PERFORM INPUT-2-PROMPT.
           ACCEPT INPUT-2.
           PERFORM CALCULATION.
           PERFORM DISPLAY-RESULT.
           STOP RUN.

      INPUT-1-PROMPT.
            DISPLAY "ENTER FIRST NUMBER:".
      INPUT-2-PROMPT.
            DISPLAY "ENTER SECOND NUMBER:".

      CALCULATION.
            MULTIPLY INPUT-1 BY INPUT-2 GIVING PROCESS-DATA.
            ADD 100 TO PROCESS-DATA.

      DISPLAY-RESULT.
            MOVE PROCESS-DATA TO CALC-RESULT.
            DISPLAY "CALCULATION RESULT:" CALC-RESULT.