PERFORM WITH TEST AFTER UNTIL LOW-VALUES = TRUE
     VARYING X FROM 1 BY 1 UNTIL X = 10
      DISPLAY 'Value of X is: ' X
      ADD X TO SUM.
      IF X > 5
         DISPLAY 'X is greater than 5'
      END-IF
      PERFORM 10 TIMES
         ADD 2 TO PRODUCT
      END-PERFORM
      DISPLAY 'Value of a complex expression: ' (X * PRODUCT) - SUM
      IF X = 10
         DISPLAY 'X is equal to 10'
      ELSE
         DISPLAY 'X is not equal to 10'
      END-IF
END-PERFORM.