IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  NUM-OF-ITEMS PIC 99 VALUE ZERO.
       77  ITEM-CODE PIC X(10) OCCURS 0 TO 999 TIMES
           DEPENDING ON NUM-OF-ITEMS.
       01  ITEM-RECORD.
           05  ITEM-NAME        PIC X(20).
           05  ITEM-PRICE       PIC 999V99.
       01  TOTAL-PRICE           PIC 999V99.
       PROCEDURE DIVISION.
       PERFORM UNTIL NUM-OF-ITEMS = ZERO
           DISPLAY "Enter item code: "
           ACCEPT ITEM-CODE(NUM-OF-ITEMS)
           COMPUTE TOTAL-PRICE = TOTAL-PRICE + ITEM-PRICE(NUM-OF-ITEMS)
           ADD 1 TO NUM-OF-ITEMS
       END-PERFORM.
       DISPLAY "Total price: "
       DISPLAY TOTAL-PRICE.
       STOP RUN.