IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(20) VALUE "HELLO, WORLD!".
PROCEDURE DIVISION.
DISPLAY WS-MESSAGE.
STOP RUN.