IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
      * This program calculates the average of three numbers
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(3).
       01 NUM2 PIC 9(3).
       01 NUM3 PIC 9(3).
       01 AVG PIC 9(4)V9(2).

       PROCEDURE DIVISION.
       DISPLAY "Enter first number: ".
       ACCEPT NUM1.
       DISPLAY "Enter second number: ".
       ACCEPT NUM2.
       DISPLAY "Enter third number: ".
       ACCEPT NUM3.

       COMPUTE AVG = (NUM1 + NUM2 + NUM3) / 3.

      * Inline comment
       DISPLAY "The average is: " AVG.

       STOP RUN.