IDENTIFICATION DIVISION.
       PROGRAM-ID. CODE-SNIPPET.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
        SELECT INFILE ASSIGN TO "INPUTFILE.TXT"
           FILE STATUS IS INFILE-STATUS.
           
        SELECT OUTFILE ASSIGN TO "OUTPUTFILE.TXT"
           FILE STATUS IS OUTFILE-STATUS.

        DATA DIVISION.
        FILE SECTION.
        FD INFILE.
        01 INFILE-RECORD.
           05 INFILE-ID PIC 9(4).
           05 INFILE-NAME PIC X(25).
        
        FD OUTFILE.
        01 OUTFILE-RECORD.
           05 OUTFILE-ID PIC 9(4).
           05 OUTFILE-NAME PIC X(25).
           05 OUTFILE-AMOUNT PIC 9(10)V99.
        
        WORKING-STORAGE SECTION.
        01 INFILE-STATUS PIC XX.
        01 OUTFILE-STATUS PIC XX.
        01 INFILE-COUNT PIC 9(3) VALUE 0.
        01 OUTFILE-COUNT PIC 9(3) VALUE 0.
        01 INFILE-INVALID-COUNT PIC 9(3) VALUE 0.
        01 OUTFILE-INVALID-COUNT PIC 9(3) VALUE 0.
        01 TOTAL-AMOUNT PIC 9(12)V99 VALUE 0.
        
        PROCEDURE DIVISION.
        000-START.
            OPEN INPUT INFILE
                OUTPUT OUTFILE.
                
        100-READ.
            READ INFILE
                AT END MOVE "YES" TO INFILE-STATUS.
        
        200-PROCESS.
            IF INFILE-STATUS = "NO"
                PERFORM 300-WRITE-VALID
            ELSE
                PERFORM 400-WRITE-INVALID.
                
        300-WRITE-VALID.
            ADD 1 TO INFILE-COUNT.
            IF OUTFILE-AMOUNT > 0
                ADD OUTFILE-AMOUNT TO TOTAL-AMOUNT
            WRITE OUTFILE FROM OUTFILE-RECORD
                INVALID KEY MOVE "YES" TO OUTFILE-STATUS.
        
        400-WRITE-INVALID.
            ADD 1 TO INFILE-INVALID-COUNT.
            WRITE "INVALID RECORD" INVALID KEY MOVE "YES" TO OUTFILE-STATUS.
        
        500-NEXT.
            IF INFILE-STATUS = "NO"
                GO TO 100-READ.
            CLOSE INFILE OUTFILE.
            DISPLAY "TOTAL NUMBER OF VALID RECORDS: " INFILE-COUNT
            DISPLAY "TOTAL NUMBER OF INVALID RECORDS: " INFILE-INVALID-COUNT
            DISPLAY "TOTAL AMOUNT: " TOTAL-AMOUNT.
        
        STOP RUN.