IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-A PIC 9(3) VALUE 123.
01 NUM-B PIC 9(2) VALUE 45.
01 SUM PIC 9(4) VALUE ZERO.
PROCEDURE DIVISION.
ADD NUM-A TO SUM.
ADD NUM-B TO SUM.
DISPLAY 'The calculated sum is: ' SUM.
STOP RUN.