IDENTIFICATION DIVISION.   //specifies program name and identification
PROGRAM-ID. MYPROGRAM.     //assigns program name "MYPROGRAM"

DATA DIVISION.             //specifies program's data
WORKING-STORAGE SECTION.   //defines variables and constants to be used for calculations

01 NUMONE PIC 9(3) VALUE 123.   //defines variable NUMONE with numeric value 123
01 NUMTWO PIC 9(3) VALUE 456.   //defines variable NUMTWO with numeric value 456
01 RESULT PIC 9(4).              //defines variable to store result of calculation

PROCEDURE DIVISION.          //specifies detail of program operations
MAIN-PROGRAM.                //main procedure begins
    COMPUTE RESULT = NUMONE + NUMTWO.   //computes sum of NUMONE and NUMTWO and stores in RESULT
    DISPLAY "The sum of " NUMONE " and " NUMTWO " is: " RESULT.   //displays result with message
    
    STOP RUN.                  //stops program execution
END PROGRAM MYPROGRAM.        //ends program