000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO-WORLD.
000300
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700
000800 01 MESSAGE PIC X(14) VALUE "HELLO, WORLD!".
000900
001000 PROCEDURE DIVISION.
001100     DISPLAY MESSAGE.
001200
001300     STOP RUN.
001400* This is a simple COBOL program that displays the message "HELLO, WORLD!".