IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLEPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  TOTAL-COUNT  PIC 9(3) VALUE 0.
       01  INDEX        PIC 9(2) VALUE 1.
       01  NAME-LIST.
           02  NAME     OCCURS 10 TIMES PIC X(10).
       PROCEDURE DIVISION.
       PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > 10
           DISPLAY "Enter name " INDEX
           ACCEPT NAME-LIST(INDEX)
       END-PERFORM.
       PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > 10
           ADD 1 TO TOTAL-COUNT
           DISPLAY "Name " INDEX "is" NAME-LIST(INDEX)
       END-PERFORM.
       DISPLAY "Total names entered: " TOTAL-COUNT.
       STOP RUN.