IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-PROGRAM.       # program declaration
       AUTHOR. YOUR-NAME.                # name of author
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NUM-EMPLOYEES PIC 9(3).        # declare variable with size of 3 digits
       77 EMPLOYEE-INFO OCCURS 20 TIMES. # declare array with 20 elements
            05 EMPLOYEE-NAME PIC X(20).  # 1st element for employee name
            05 EMPLOYEE-ID PIC 9(5).     # 2nd element for employee ID
            05 EMPLOYEE-SALARY PIC 9(6). # 3rd element for employee salary
       PROCEDURE DIVISION.
       ACCEPT NUM-EMPLOYEES FROM CONSOLE. # take input from user for number of employees
       PERFORM VARYING I FROM 1 BY 1      # loop through each element in array
             UNTIL I > NUM-EMPLOYEES
          DISPLAY "Enter Employee Name: ". # prompt user for employee name
          ACCEPT EMPLOYEE-NAME(I) FROM CONSOLE. # take input and store in array at index I
          DISPLAY "Enter Employee ID: ".   # prompt user for employee ID
          ACCEPT EMPLOYEE-ID(I) FROM CONSOLE. # take input and store in array at index I
          DISPLAY "Enter Employee Salary: ". # prompt user for employee salary
          ACCEPT EMPLOYEE-SALARY(I) FROM CONSOLE. # take input and store in array at index I
       END-PERFORM.
       DISPLAY "Employee Information".         # display header for employee information
       PERFORM VARYING I FROM 1 BY 1           # loop through each element in array
             UNTIL I > NUM-EMPLOYEES
          DISPLAY "Name: " EMPLOYEE-NAME(I).   # display employee name
          DISPLAY "ID: " EMPLOYEE-ID(I).       # display employee ID
          DISPLAY "Salary: " EMPLOYEE-SALARY(I). # display employee salary
       END-PERFORM.
       STOP.                                  # stop program execution
       END PROGRAM COBOL-PROGRAM.