Identification Division.
Program-ID. ARRAY-SUM.
Data Division.
Working-Storage Section.
01 ARRAY.
   05 NUMBERS OCCURS 10 TIMES.
      10 VALUE PIC 9(2).
01 SUM PIC 9(3).
Procedure Division.
Begin.
   Move 0 to SUM
   Perform Varying I from 1 by 1 until I > 10
      Add NUMBERS (I) TO SUM
   End-Perform
   Display "Sum of numbers is : " SUM
   Stop Run.
End Program ARRAY-SUM.