IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.
AUTHOR. JOE SMITH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT INPUT-FILE ASSIGN TO "INPUT.TXT". 
   SELECT OUTPUT-FILE ASSIGN TO "OUTPUT.TXT".

DATA DIVISION.
FILE SECTION.
   FD INPUT-FILE
      RECORD CONTAINS 80 CHARACTERS
      BLOCK CONTAINS 10 RECORDS
      DATA RECORD IS INPUT-RECORD.
   01 INPUT-RECORD.
      05 NAME PIC X(20).
      05 ADDRESS PIC X(30).
      05 AGE PIC 9(3).

   FD OUTPUT-FILE
      RECORD CONTAINS 80 CHARACTERS
      BLOCK CONTAINS 10 RECORDS
      DATA RECORD IS OUTPUT-RECORD.
   01 OUTPUT-RECORD.
      05 NAME PIC X(20).
      05 ADDRESS PIC X(30).
      05 RESULT PIC 9(5).

WORKING-STORAGE SECTION.
   01 TOTAL-AGE PIC 9(4) VALUE ZERO.

PROCEDURE DIVISION.
   PERFORM INITIALIZE-FILE.
   PERFORM READ-INPUT-FILE UNTIL INPUT-RECORD = END-OF-FILE.
   PERFORM CALCULATE-RESULT.
   PERFORM WRITE-OUTPUT-FILE.
   PERFORM CLOSE-FILES.
   STOP RUN.

INITIALIZE-FILE.
   OPEN INPUT-FILE.
   OPEN OUTPUT-FILE.

READ-INPUT-FILE.
   READ INPUT-FILE INTO INPUT-RECORD.

CALCULATE-RESULT.
   ADD AGE TO TOTAL-AGE.

WRITE-OUTPUT-FILE.
   MOVE NAME TO OUTPUT-RECORD.
   MOVE ADDRESS TO OUTPUT-RECORD.
   MOVE TOTAL-AGE TO OUTPUT-RECORD.
   WRITE OUTPUT-FILE FROM OUTPUT-RECORD.

CLOSE-FILES.
   CLOSE INPUT-FILE.
   CLOSE OUTPUT-FILE.

END-OF-FILE.
   EXIT.