IDENTIFICATION DIVISION.                                                            * *** Comment line
      PROGRAM-ID. complex-code.                                                           * Program name
      AUTHOR. Jane Doe.                                                                   * Author's name
      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
            SELECT input-file ASSIGN TO "input.txt".                                      * Input file name
            SELECT output-file ASSIGN TO "output.txt".                                    * Output file name
      DATA DIVISION.
      FILE SECTION.
      FD input-file.
      01 input-record.
            02 input-name PIC X(20).                                                      * Define the input record structure
            02 input-age PIC 99.
            02 input-gender PIC X.
      FD output-file.
      01 output-record.
            02 output-name PIC X(20).                                                     * Define the output record structure
            02 output-age PIC 99.
            02 output-gender PIC X.
      WORKING-STORAGE SECTION.                                                             * Define working storage variables
      01 count PIC 99.
      01 total PIC 999.
      01 average PIC V99.
      PROCEDURE DIVISION.
      OPEN INPUT input-file.                                                               * Open input file
      OPEN OUTPUT output-file.                                                             * Open output file
      ACCEPT count FROM CONSOLE.                                                            * Accept user input for count variable
      PERFORM READ-DATA VARYING count FROM 1 BY 1                                           * Loop until count number of records
        UNTIL count = 0
          READ input-file INTO input-record                                                 * Read one record from input file
          PERFORM PROCESS-DATA                                                              * Perform calculations on data
          WRITE output-record                                                               * Write record to output file
      CLOSE input-file.                                                                      * Close input file
      CLOSE output-file.                                                                     * Close output file
      PERFORM CALC-AVERAGE.                                                                   * Calculate the average
      DISPLAY "The total number of records is " count "."                                    * Display message to the console
      DISPLAY "The average age is " average "."                                              * Display average age to the console
      STOP.                                                                                  * End program execution
      PROCESS-DATA SECTION.
      MULTIPLY input-age BY 2 GIVING total.                                                   * Multiply age by 2 and store in total
      ADD input-age TO total.                                                                 * Add age to total
      DIVIDE total BY 3 GIVING average.                                                       * Divide total by 3 and store in average
      CALC-AVERAGE SECTION.
      DIVIDE total BY count GIVING average.                                                   * Divide total by count and store in average