IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 INPUT-STRING PIC X(50).
           01 LENGTH PIC 9(02).
           01 CHAR-ARRAY.
               02 CHAR-INDEX PIC 9(02).
               02 CHAR-VALUE PIC X(01).
           01 ALPHABET REDEFINES CHAR-ARRAY PIC X(26).
           01 NUMBERS REDEFINES CHAR-ARRAY PIC X(10).
           
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Enter a string:".
           ACCEPT INPUT-STRING.
           MOVE FUNCTION LENGTH(INPUT-STRING) TO LENGTH.
           
       PERFORM VARYING CHAR-INDEX FROM 1 BY 1 UNTIL CHAR-INDEX > LENGTH
           IF CHAR-VALUE (CHAR-INDEX) NUMERIC
               MOVE CHAR-VALUE (CHAR-INDEX) TO NUMBERS (CHAR-INDEX)
           ELSE
               CONTINUE
           END-IF
       END-PERFORM.
       
       IF NUMBERS (1) = "A"
           DISPLAY "The first character is A".
       ELSE
           DISPLAY "The first character is not A".
       END-IF.
       
       COMPUTE NUM-LENGTH = FUNCTION LENGTH(NUMBERS).
       
       IF NUM-LENGTH = 0
           DISPLAY "There are no numbers in the string".
       ELSE
           DISPLAY "There are " NUM-LENGTH "numbers in the string".
       END-IF.
       STOP RUN.