ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO 'STUDENT.DAT'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE.
       01 STUDENT-RECORD.
           05 STUDENT-ID     PIC X(10).
           05 STUDENT-NAME   PIC X(20).
           05 COURSE-DETAILS OCCURS 3 TIMES.
               10 COURSE-NAME  PIC X(20).
               10 COURSE-GRADE PIC 9.
 LEVEL 78 COURSE.
       PROCEDURE DIVISION.
       OPEN INPUT STUDENT-FILE.
       PERFORM READ-STUDENT-FILE UNTIL EOF.
       CLOSE STUDENT-FILE.
       STOP RUN.
       READ-STUDENT-FILE.
           DISPLAY 'Student ID: ' STUDENT-ID
           DISPLAY 'Student Name: ' STUDENT-NAME.
           PERFORM READ-COURSE-DETAILS VARYING COURSE-INDEX FROM 1 BY 1
               UNTIL COURSE-INDEX > 3.
       READ-COURSE-DETAILS.
           DISPLAY 'Course Name: ' COURSE-NAME (COURSE-INDEX)
           DISPLAY 'Course Grade: ' COURSE-GRADE (COURSE-INDEX).
       FILE-STATUS.
           EVALUATE TRUE
               WHEN (FILE-STATUS = '00')
                   CONTINUE
               WHEN (FILE-STATUS = '10')
                   DISPLAY 'End of File Reached'
               WHEN (FILE-STATUS = '20')
                   DISPLAY 'Invalid Record'
               WHEN (FILE-STATUS = '30')
                   DISPLAY 'File Locked'
               WHEN (FILE-STATUS = '31')
                   DISPLAY 'File Open Failed'
               WHEN (FILE-STATUS = '41')
                   DISPLAY 'Read Failed'.
       END-EVALUATE.