IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INP1-TAPE ASSIGN TO 'INP1'.
       DATA DIVISION.
       INPUT-OUTPUT SECTION.
       FILE SECTION.
       FD INP1-TAPE.
       01 INPUT-RECORD.
           05 INP1-EMPLOYEE-ID  PIC X(6).
           05 INP1-EMPLOYEE-NAME PIC X(30).
           05 INP1-HOURS-WORKED  PIC 9(3).
           05 INP1-PAY-RATE      PIC 9(3).
           05 INP1-TOTAL-PAY     PIC 9(4)V99.
       WORKING-STORAGE SECTION.
       01 TOTAL-PAY PIC 9(5)V99.
       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT INP1-TAPE
           PERFORM UNTIL ARE-THERE-NO-MORE-RECORDS
               PERFORM READ-DATA-POINT
               PERFORM CALCULATE-TOTAL-PAY
           END-PERFORM.
           PERFORM DISPLAY-RESULTS.
           CLOSE INP1-TAPE
           STOP RUN.
       200-READ-DATA-POINT.
           READ INP1-TAPE INTO INPUT-RECORD
           AT END
               SET ARE-THERE-NO-MORE-RECORDS TO TRUE
           NOT AT END
               ADD INP1-HOURS-WORKED TO TOTAL-PAY
           END-READ.
       300- CALCULATE-TOTAL-PAY.
           COMPUTE TOTAL-PAY = INP1-HOURS-WORKED * INP1-PAY-RATE
           ADD TOTAL-PAY TO INP1-TOTAL-PAY.
       400- DISPLAY-RESULTS.
           DISPLAY "Employee ID:" INP-EMPLOYEE-ID
           DISPLAY "Employee Name:" INP-EMPLOYEE-NAME
           DISPLAY "Total Pay:" INP-EMPLOYEE-TOTAL-PAY
           END PROGRAM PROGRAM1.