IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUM PARAMETER PIC 9(4) VALUE 0.
01 INDEX PIC 9(4) VALUE 0.
01 FACTORIAL PIC 9(4) VALUE 1.

PROCEDURE DIVISION.

MAIN-LOOP.
IF NUM LESS THAN 1 
    DISPLAY "INVALID INPUT" 
    STOP RUN.
DIVIDE 1 BY NUM GIVING FACTORIAL.
ADD 1 TO INDEX.
MULTIPLY FACTORIAL BY INDEX GIVING FACTORIAL.
IF INDEX LESS THAN NUM GO TO MAIN-LOOP.
DISPLAY "FACTORIAL OF " NUM " IS " FACTORIAL.
STOP RUN.