IDENTIFICATION DIVISION.                                          
PROGRAM-ID. SampleProgram.
AUTHOR. Author Name.
DATE-WRITTEN. 01/01/2021.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 some-var PIC X(10) VALUE 'Hello'.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    PERFORM DISPLAY-MESSAGE
    PERFORM ADD-TWO-NUMBERS
    PERFORM DISPLAY-MESSAGE
    STOP RUN.

DISPLAY-MESSAGE.
    DISPLAY some-var
    DISPLAY 'This is a sample program in COBOL.'.

ADD-TWO-NUMBERS.
    COMPUTE some-var = 1 + 2.