LOOP-TOP.* COUNTER VARIABLE SET TO 0
           MOVE ZERO TO COUNTER. 
MULTIPLY.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
                COMPUTE COUNTER = COUNTER + 1.
                IF COUNTER = 5 
                    CONTINUE.
                ELSE
                    MOVE COUNTER TO TEMP-NUM.
                    IF TEMP-NUM = 3 
                       MULTIPLY TEMP-NUM BY 10. 
                    ELSE
                       SUBTRACT 1 FROM TEMP-NUM 
                       

*USE DIVISIONS AND ADDITIONS TO CREATE COMPLEX CALCULATIONS
                       

               END-IF.
                IF I < 5 
                   ADD 2 TO TEMP-NUM.
                    IF TEMP-NUM > 5 
                        DIVIDE TEMP-NUM BY 2 ROUNDING UP 
                       

*USE CONDITIONALS AND LOOPS FOR DYNAMIC CALCULATIONS

                        END-IF.
                END-IF.
           END-PERFORM.
LOOP-BOTTOM.

*PRINT FINAL RESULT
           DISPLAY "FINAL COUNT: " COUNTER.
           STOP RUN.