*****************************************************************
      **                                                             **
     **  THIS PROGRAM CALCULATES THE AVERAGE OF 10 NUMBERS ENTERED   **
    **   BY THE USER. IT ALSO DISPLAYS THE SUM OF THE NUMBERS AND    **
   **    FINDS THE LARGEST AND SMALLEST NUMBER FROM THE INPUT.      **
  **                                                                 **
 **     AUTHOR: JOHN DOE                                           **
 *******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-AVERAGE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE  ASSIGN TO "USER.INPUT".
           SELECT OUTPUT-FILE ASSIGN TO "USER.OUTPUT".
       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE.
       01  INPUT-NUMBERS        PIC 9(3).
       FD  OUTPUT-FILE.
       01  OUTPUT-VALUES        PIC 9(5)V9(2).
       WORKING-STORAGE SECTION.
       01  SUM-OF-NUMBERS       PIC 9(5).
       01  AVERAGE              PIC 9(5)V9(2).
       01  NUM-OF-INPUTS        PIC 9(3).
       01  LARGEST-NUMBER       PIC 9(3).
       01  SMALLEST-NUMBER      PIC 9(3).
       PROCEDURE DIVISION.
       BEGIN.
           OPEN INPUT INPUT-FILE
           OPEN OUTPUT OUTPUT-FILE
           PERFORM UNTIL NUM-OF-INPUTS = 10
               ACCEPT INPUT-NUMBERS
               WRITE INPUT-NUMBERS TO OUTPUT-VALUES
               ADD INPUT-NUMBERS TO SUM-OF-NUMBERS
               IF INPUT-NUMBERS > LARGEST-NUMBER
                   MOVE INPUT-NUMBERS TO LARGEST-NUMBER
               END-IF
               IF INPUT-NUMBERS < SMALLEST-NUMBER
                   MOVE INPUT-NUMBERS TO SMALLEST-NUMBER
               END-IF
               ADD 1 TO NUM-OF-INPUTS
           END-PERFORM
           DIVIDE SUM-OF-NUMBERS BY NUM-OF-INPUTS GIVING AVERAGE
           WRITE "THE AVERAGE IS " AVERAGE TO OUTPUT-FILE
           WRITE "THE SUM IS " SUM-OF-NUMBERS TO OUTPUT-FILE
           WRITE "THE LARGEST NUMBER IS " LARGEST-NUMBER TO OUTPUT-FILE
           WRITE "THE SMALLEST NUMBER IS " SMALLEST-NUMBER TO OUTPUT-FILE
           CLOSE INPUT-FILE OUTPUT-FILE
           STOP RUN.
       END.