01 CUSTOMER-RECORD.
       05 CUSTOMER-NAME          PIC X(20).
       05 CUSTOMER-ADDRESS.
          10 ADDRESS-LINE-1      PIC X(30).
          10 ADDRESS-LINE-2      PIC X(30).
          10 CITY                PIC X(20).
          10 STATE               PIC X(2).
          10 ZIP                 PIC 9(5).
       05 CUSTOMER-PAYMENT       PIC S9(6)V99.
       
    01 PAYMENT-TABLE.
       05 PAYMENT                OCCURS 12 TIMES
                                  INDEXED BY PAYMENT-INDEX.
          10 PAYMENT-AMOUNT      PIC S9(6)V99.
          10 PAYMENT-DATE.
             15 PAYMENT-MONTH    PIC 99.
             15 PAYMENT-YEAR     PIC 9999.
             
    01 TOTAL-PAYMENT VARYING FILLER PIC S9(6)V99.
    
    PROCEDURE DIVISION.
      PERFORM 3 TIMES
          PERFORM READ-CUSTOMER
          PERFORM CALCULATE-TOTAL-PAYMENT
          PERFORM WRITE-CUSTOMER  
      END-PERFORM.
      
    READ-CUSTOMER.
        DISPLAY "Enter customer name> ".
        ACCEPT CUSTOMER-NAME.
        DISPLAY "Enter customer address> ".
        ACCEPT ADDRESS-LINE-1, ADDRESS-LINE-2, CITY, STATE, ZIP.
        DISPLAY "Enter customer payment> ".
        ACCEPT CUSTOMER-PAYMENT.
        
    CALCULATE-TOTAL-PAYMENT.
        PERFORM VARYING PAYMENT-INDEX FROM 1 BY 1 UNTIL PAYMENT-INDEX > 12
             ADD PAYMENT(PAYMENT-INDEX) TO TOTAL-PAYMENT
        END-PERFORM.
        
    WRITE-CUSTOMER.
        DISPLAY "Customer: " CUSTOMER-NAME.
        DISPLAY "Address: " ADDRESS-LINE-1 ", " ADDRESS-LINE-2 ", " CITY ", " STATE " " ZIP.
        DISPLAY "Total Payment: $" TOTAL-PAYMENT.