IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-SUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5).
       01 NUM2 PIC 9(5).
       01 SUM PIC 9(6).
       PROCEDURE DIVISION.
       DISP _"Enter first number:".
       ACCEPT NUM1.
       DISP "Enter second number:".
       ACCEPT NUM2.
       COMPUTE SUM = NUM1 + NUM2.
       DISP "The sum of" NUM1 "and" NUM2 "is" SUM.
       STOP RUN.