IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIRST-NUMBER PIC 9(5)V9(2).
01 SECOND-NUMBER PIC 9(5)V9(2).
01 RESULT PIC 9(5)V9(2).
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "Enter the first number:"
    ACCEPT FIRST-NUMBER
    DISPLAY "Enter the second number:"
    ACCEPT SECOND-NUMBER
    COMPUTE RESULT = (FIRST-NUMBER + SECOND-NUMBER) / 2
    DISPLAY "Average of two numbers is: ",RESULT
STOP RUN.