IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SUM.
       AUTHOR. JOHN SMITH.
       DATE-WRITTEN. 03/01/2021.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-1 PIC 99.
       01 NUM-2 PIC 99.
       01 SUM PIC 99.
       PROCEDURE DIVISION.
           DISPLAY "Enter first number: ".
           ACCEPT NUM-1.
           DISPLAY "Enter second number: ".
           ACCEPT NUM-2.
           COMPUTE SUM = NUM-1 + NUM-2.
           DISPLAY "The sum is " SUM.
           STOP RUN.