IDENTIFICATION DIVISION.
    PROGRAM-ID. COLLATZ-SEQUENCE.
    ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 COUNT                   PIC 9(3) VALUE 1.
    01 INITIAL-NUMBER          PIC 9(9) VALUE 25.
    01 OUTPUT-NUMBER           PIC 9(9).
    PROCEDURE DIVISION.
        PERFORM UNTIL INITIAL-NUMBER = 1
            IF INITIAL-NUMBER MOD 2 = 0
                DIVIDE INITIAL-NUMBER BY 2 GIVING OUTPUT-NUMBER
            ELSE
                MULTIPLY INITIAL-NUMBER BY 3 ADD 1 GIVING OUTPUT-NUMBER
            END-IF
            DISPLAY 'Iteration ' COUNT ': ' OUTPUT-NUMBER
            ADD 1 TO COUNT
            MOVE OUTPUT-NUMBER TO INITIAL-NUMBER
        END-PERFORM.
    STOP RUN.