PROCEDURE DIVISION.
MOVE 'HELLO' TO WS-STRING.            * Moves the string 'HELLO' into variable WS-STRING
DISPLAY WS-STRING ' WORLD'.           * Displays 'HELLO WORLD' on the screen
IF WS-INDEX > 1                       * Checks if variable WS-INDEX is greater than 1
   PERFORM WS-SUBROUTINE               * Calls the subroutine WS-SUBROUTINE
ELSE
   PERFORM WS-OTHER-SUBROUTINE         * Calls the subroutine WS-OTHER-SUBROUTINE
END-IF.

WS-SUBROUTINE.
   ADD 1 TO WS-INDEX.                  * Adds 1 to variable WS-INDEX
   DISPLAY 'This is a subroutine.'.    * Displays 'This is a subroutine' on the screen
   GOBACK.                             * Returns to the calling program

WS-OTHER-SUBROUTINE.
   SUBTRACT 1 FROM WS-INDEX.           * Subtracts 1 from variable WS-INDEX
   DISPLAY 'This is another subroutine.'.  * Displays 'This is another subroutine' on the screen
   GOBACK.                             * Returns to the calling program
END PROGRAM.