IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE  ASSIGN TO "INPUT.DAT".
           SELECT OUTFILE ASSIGN TO "OUTPUT.DAT".

       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 IN-RECORD.
          05 IN-NAME       PIC X(20).
          05 IN-AGE        PIC 99.
          05 IN-SALARY     PIC 9(6).

       FD OUTFILE.
       01 OUT-RECORD.
          05 OUT-NAME      PIC X(20).
          05 OUT-AGE       PIC 99.
          05 OUT-SALARY    PIC 9(6).

       WORKING-STORAGE SECTION.
       01 WS-FLAG        PIC X.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           OPEN INPUT INFILE
           OPEN OUTPUT OUTFILE
           READ INFILE INTO IN-RECORD
           PERFORM UNTIL IN-RECORD = "EOF"
               MOVE IN-NAME TO OUT-NAME
               MOVE IN-AGE TO OUT-AGE
               MOVE IN-SALARY TO OUT-SALARY
               WRITE OUT-RECORD
               READ INFILE INTO IN-RECORD
           END-PERFORM
           CLOSE INFILE
           CLOSE OUTFILE.

       INVALID-LOGIC.
           DISPLAY "Invalid input file!".

       END PROGRAM MYPROGRAM.