IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.
       AUTHOR. YOUR NAME HERE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-ITEMS PIC S9(4) COMP.
       01 RAND-NUMBER PIC S9(4) COMP.
       01 NUM-ARRAYS.
           05 NUM-ARRAY OCCURS 100 TIMES
              PIC S9(4) COMP.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM INIT-VALUES.
           PERFORM GENERATE-RAND-NUM.
           PERFORM SORT.
           DISPLAY 'Sorted Array:'.
           PERFORM PRINT-ARRAY.
           STOP RUN.
       INIT-VALUES.
           MOVE 100 TO NUM-ITEMS.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-ITEMS
               COMPUTE RAND-NUMBER = FUNCTION RANDOM(100)
               MOVE RAND-NUMBER TO NUM-ARRAY(I)
           END-PERFORM.
       GENERATE-RAND-NUM.
           DISPLAY 'Enter a random number: ' WITH NO ADVANCING.
           ACCEPT RAND-NUMBER.
       SORT.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-ITEMS
               PERFORM VARYING J FROM I+1 BY 1 UNTIL J > NUM-ITEMS
                   IF NUM-ARRAY(I) > NUM-ARRAY(J)
                       MOVE NUM-ARRAY(I) TO TEMP
                       MOVE NUM-ARRAY(J) TO NUM-ARRAY(I)
                       MOVE TEMP TO NUM-ARRAY(J)
                   END-IF
               END-PERFORM
           END-PERFORM.
       PRINT-ARRAY.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-ITEMS
               DISPLAY NUM-ARRAY(I)
           END-PERFORM.