IDENTIFICATION DIVISION.
      PROGRAM-ID. SAMPLE-PROGRAM.
      
      ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT INPUT-FILE ASSIGN TO 'INFILE.DAT'.
      SELECT OUTPUT-FILE ASSIGN TO 'OUTFILE.DAT'.
      
      DATA DIVISION.
      FILE SECTION.
      FD INPUT-FILE.
      01 INPUT-RECORD.
         05 NAME  PIC X(20).
         05 ID    PIC 9(9).
         05 GRADE PIC 99.
         05 TOTAL-PAYMENT PIC 9999999.99.
      FD OUTPUT-FILE.
      01 OUTPUT-RECORD.
         05 NAME-OUT       PIC X(20).
         05 ID-OUT         PIC 9(9).
         05 GRADE-OUT      PIC 99.
         05 AMOUNT-OUT     PIC 99999V99.
      
      WORKING-STORAGE SECTION.
      01 WORK-VAR.
         05 TOTAL-AMOUNT          PIC 999999.99.
         05 RECORD-COUNT          PIC 9(3).
         05 TEMP-NAME             PIC X(20).
         05 TEMP-AMOUNT           PIC 99999.99.
         05 TEMP-ID               PIC 9(9).
         05 TEMP-GRADE            PIC 99.
      
      PROCEDURE DIVISION.
      100-OPEN-FILES SECTION.
      OPEN INPUT INPUT-FILE, OUTPUT OUTPUT-FILE.
      
      200-READ-RECORD SECTION.
      READ INPUT-FILE INTO INPUT-RECORD
         AT END MOVE 'END OF FILE' TO TEMP-NAME
         GO TO 300-PRINT-TOTAL.
      
      300-CALCULATE-AMOUNT SECTION.
      MULTIPLY TOTAL-PAYMENT BY .85
         GIVING TEMP-AMOUNT.
      ADD TOTAL-AMOUNT TO TEMP-AMOUNT
         GIVING TOTAL-AMOUNT.
      MOVE NAME TO TEMP-NAME.
      MOVE ID TO TEMP-ID.
      MOVE GRADE TO TEMP-GRADE.
      
      400-WRITE-RECORD SECTION.
      WRITE OUTPUT-RECORD FROM WORK-VAR.
      
      500-INCREMENT-COUNT SECTION.
      ADD 1 TO RECORD-COUNT.
      
      600-PRINT-TOTAL SECTION.
      DISPLAY 'TOTAL AMOUNT: ' TOTAL-AMOUNT.
      DISPLAY 'TOTAL RECORDS: ' RECORD-COUNT.
      
      900-CLOSE-FILES SECTION.
      CLOSE INPUT-FILE, OUTPUT-FILE.
      
      END PROGRAM SAMPLE-PROGRAM.