IDENTIFICATION DIVISION.
 PROGRAM-ID. EXAMPLE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-EMPLOYEE-TABLE.
  05 WS-EMPLOYEE-TABLE-LINE OCCURS 100 TIMES.
     10 WS-EMPLOYEE-NAME           PIC X(20).
     10 WS-EMPLOYEE-AGE            PIC 99.
     10 WS-EMPLOYEE-SALARY         PIC 9(6)V99.
     10 WS-EMPLOYEE-DEPARTMENT     PIC X(15).
 
 PROCEDURE DIVISION.
 MAIN-PROCEDURE.
     PERFORM INITIALIZATION-ROUTINE.
     PERFORM PROCESS-EMPLOYEES UNTIL EOF.
     PERFORM TERMINATION-ROUTINE.
     STOP RUN.
 
 INITIALIZATION-ROUTINE.
     OPEN INPUT EMPLOYEE-FILE.
 
 PROCESS-EMPLOYEES.
     READ EMPLOYEE-FILE
         AT END SET EOF-FLAG TO TRUE
     END-READ.
     IF NOT EOF-FLAG
         MOVE EMPLOYEE-NAME TO WS-EMPLOYEE-NAME(EMPLOYEE-LINE)
         MOVE EMPLOYEE-AGE TO WS-EMPLOYEE-AGE(EMPLOYEE-LINE)
         MOVE EMPLOYEE-SALARY TO WS-EMPLOYEE-SALARY(EMPLOYEE-LINE)
         MOVE EMPLOYEE-DEPARTMENT TO WS-EMPLOYEE-DEPARTMENT(EMPLOYEE-LINE)
         ADD 1 TO EMPLOYEE-LINE
     END-IF.
 
 TERMINATION-ROUTINE.
     CLOSE EMPLOYEE-FILE.
 
  END PROGRAM EXAMPLE.