IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROGRAM.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "input.txt".
           SELECT OUTPUT-FILE ASSIGN TO "output.txt".

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 RECORD-IN.
           02 NAME PIC X(20).
           02 ID PIC 9(5).
           02 GRADE1 PIC 9(2).
           02 GRADE2 PIC 9(2).
           02 GRADE3 PIC 9(2).
           02 GRADE4 PIC 9(2).
           02 GRADE5 PIC 9(2).
       FD OUTPUT-FILE.
       01 RECORD-OUT PIC X(50).

       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.
           PERFORM UNTIL EOF = TRUE
               READ INPUT-FILE INTO RECORD-IN
               PERFORM CALC-AVERAGE
               MOVE RECORD-OUT TO OUTPUT-RECORD-OUT
               WRITE OUTPUT-RECORD-OUT
           END-PERFORM
           CLOSE INPUT-FILE
           CLOSE OUTPUT-FILE
           STOP RUN.

       CALC-AVERAGE.
           COMPUTE AVERAGE = (GRADE1 + GRADE2 + GRADE3 + GRADE4 + GRADE5)/5.
           MOVE NAME TO OUTPUT-RECORD-OUT.
           MOVE ID TO OUTPUT-RECORD-OUT.
           MOVE AVERAGE TO OUTPUT-RECORD-OUT.
           MOVE "Student average calculated." TO OUTPUT-RECORD-OUT.
           PERFORM CHECK-EXCELLENT
           PERFORM CHECK-PASSING.

       CHECK-EXCELLENT.
           IF AVERAGE > 90
               MOVE "Excellent" TO OUTPUT-RECORD-OUT
               GO TO CHECK-GRADES.
       
       CHECK-PASSING.
           IF AVERAGE < 65
               MOVE "Failing" TO OUTPUT-RECORD-OUT.
               GO TO CHECK-GRADES.
       
       CHECK-GRADES.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
               IF GRADE[I] < 65
                   DISPLAY "Student failed course.".
                   GO TO EXIT-LOOP.
               END-IF
           END-PERFORM.
           MOVE "All grades satisfactory." TO OUTPUT-RECORD-OUT.

       EXIT-LOOP.
           EXIT.