IDENTIFICATION DIVISION.
PROGRAM-ID. MY-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS.
   05 NUM1 PIC 9(5) VALUE 100.
   05 NUM2 PIC 9(5) VALUE 200.
   05 NUM3 PIC 9(5) VALUE 300.

PROCEDURE DIVISION.
DISPLAY 'The three numbers are: '.
DISPLAY NUM1.
DISPLAY NUM2.
DISPLAY NUM3.

COMPUTE NUM3 ROUNDED = (NUM1 + NUM2) / 2.

DISPLAY 'The average of the first two numbers is: ' NUM3.
STOP RUN.