IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(5) VALUE 12345.
       01 NUM2 PIC 9(5) VALUE 98765.
       01 RESULT PIC 9(7).
       PROCEDURE DIVISION.
       DISPLAY "NUM1: " NUM1.
       DISPLAY "NUM2: " NUM2.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.
       DISPLAY "RESULT: " RESULT.
       STOP RUN.