IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
      *This program displays the message 'Hello, World!' to the user*
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-HELLO PIC X(12) VALUE 'Hello, World!'.
       PROCEDURE DIVISION.
           DISPLAY WS-HELLO.
           STOP RUN.