IDENTIFICATION DIVISION.
      PROGRAM-ID. EXAMPLE-PROGRAM.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 FIRST-NUMBER PIC 9(3).
      01 SECOND-NUMBER PIC 9(3).
      01 SUM PIC 9(4).
      PROCEDURE DIVISION.
 
          ADD FIRST-NUMBER TO SECOND-NUMBER GIVING SUM.
 
          DISPLAY "The sum is: " SUM.

      STOP RUN.