IDENTIFICATION DIVISION.                                     // Begin Identification Division
       PROGRAM-ID. CUSTOMER-INFO.                                    // Specify Program ID
      *                                                              // Documentation Comment
       AUTHOR. YOUR-NAME.                                            // Specify Author
       INSTALLATION.                                                 // Comment for Installation
       SECURITY.                                                     // Comment for Security
       DATE-WRITTEN. MMDDYYYY.                                        // Specify Date Written
      *                                                              // Documentation Comment
       ENVIRONMENT DIVISION.                                         // Begin Environment Division
       CONFIGURATION SECTION.                                        // Begin Configuration Section
      *                                                              // Documentation Comment
       INPUT-OUTPUT SECTION.                                         // Begin Input-Output Section
       FILE-CONTROL.                                                 // Begin File Control
           SELECT CUSTOMER-MSTR ASSIGN TO "C:\CUSTOMER.TXT"          // Specify File Name and Location
           ORGANIZATION IS LINE SEQUENTIAL.                          // Specify File Organization
           FILE STATUS IS WS-CUSTOMER-STATUS.                        // Specify File Status
          *                                                         // Documentation Comment
       DATA DIVISION.                                                // Begin Data Division
       FILE SECTION.                                                 // Begin File Section
       FD CUSTOMER-MSTR.                                             // Specify File Description
       01 CUSTOMER-RECORD.                                           // Begin Record Description
          02 CUST-ID PIC 9(5).                                       // Customer ID Field
          02 CUST-NAME PIC X(25).                                    // Customer Name Field
          02 CUST-ADDRESS PIC X(50).                                 // Customer Address Field
          02 CUST-AGE PIC 9(3).                                      // Customer Age Field
          02 CUST-SSN PIC 9(9).                                      // Customer SSN Field
          02 CUST-EMAIL PIC X(30).                                   // Customer Email Field
          02 CUST-PHONE PIC X(15).                                   // Customer Phone Number Field
       WORKING-STORAGE SECTION.                                      // Begin Working-Storage Section
       01 WS-CUSTOMER-STATUS PIC XX.                                 // File Status Variable
       01 WS-ERROR-MESSAGE PIC X(50).                                // Error Message Variable
       01 WS-COUNT PIC 9(5).                                         // Count Variable
      *                                                              // Documentation Comment
       PROCEDURE DIVISION.                                           // Begin Procedure Division
      *                                                              // Documentation Comment
       MAIN-PROGRAM.                                                 // Specify Main Program
           OPEN INPUT CUSTOMER-MSTR                                  // Open File for Input
           READ CUSTOMER-MSTR                                       // Read First Record
           AT END MOVE "NO DATA FOUND IN FILE" TO WS-ERROR-MESSAGE   // Check for Empty File
               DISPLAY WS-ERROR-MESSAGE                               // Display Error Message
               GO TO END-PROGRAM                                     // End Program if File is Empty
           END-READ.                                                 // End Read
           PERFORM UNTIL WS-COUNT = 99999                            // Loop Until End of File or Max Count Reached
               DISPLAY "CUSTOMER ID :" CUST-ID                        // Display Customer ID
               DISPLAY "CUSTOMER NAME :" CUST-NAME                    // Display Customer Name
               DISPLAY "CUSTOMER AGE :" CUST-AGE                      // Display Customer Age
               MOS 2                                                 // Move on to Next Record
               READ CUSTOMER-MSTR                                   // Read Next Record
               AT END MOVE "END OF FILE REACHED" TO WS-ERROR-MESSAGE   // Check for End of File
                   DISPLAY WS-ERROR-MESSAGE                           // Display Error Message
                   GO TO END-PROGRAM                                 // End Program if End of File is Reached
               END-READ.                                             // End Read
               ADD 1 TO WS-COUNT                                      // Increment Count Variable
           END-PERFORM.                                              // End Loop
      *                                                               // Documentation Comment
       END-PROGRAM.                                                  // End Program
           CLOSE CUSTOMER-MSTR.                                      // Close File
           STOP RUN.                                                 // Stop Program Execution