IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9(10) VALUE 100.
       01 NUM2 PIC 9(10) VALUE 50.
       01 RESULT PIC 9(10) VALUE 0.
       PROCEDURE DIVISION.
       SUBTRACT NUM2 FROM NUM1 GIVING RESULT.
       DISPLAY "The result of NUM1 - NUM2 is: " RESULT.
       ADD NUM2 TO NUM1 GIVING RESULT.
       DISPLAY "The result of NUM1 + NUM2 is: " RESULT.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT.
       DISPLAY "The result of NUM1 * NUM2 is: " RESULT.
       DIVIDE NUM1 BY NUM2 GIVING RESULT.
       DISPLAY "The result of NUM1 / NUM2 is: " RESULT.
       STOP RUN.