IDENTIFICATION DIVISION.
 PROGRAM-ID. example-program.
DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 STUDENT-INFO.
 05 STUDENT-ID PIC 9(6).
 05 STUDENT-NAME PIC X(20).
 05 STUDENT-GRADE.
   10 MIDTERM-EXAM PIC 999V99.
   10 FINAL-EXAM PIC 999V99.
   10 ASSIGNMENTS OCCURS 5 TIMES
       INDEXED BY ASSIGNMENT-INDEX.
       15 ASSIGNMENT-NAME PIC X(15).
       15 ASSIGNMENT-GRADE PIC 99V99.
 05 STUDENT-AVERAGE PIC 999V99.
 05 STUDENT-RANKING PIC 9(2).
PROCEDURE DIVISION.
  PERFORM INITIALIZATION.
  PERFORM READ-STUDENT-INFO UNTIL STUDENT-ID = 000000.
  PERFORM CALCULATE-STUDENT-AVERAGE.
  PERFORM CALCULATE-STUDENT-RANKING.
  PERFORM DISPLAY-RESULTS.
STOP RUN.
INITIALIZATION.
  MOVE ZEROS TO STUDENT-INFO.
  MOVE 1 TO ASSIGNMENT-INDEX.
  DISPLAY "ENTER STUDENT ID (6 DIGITS):".
  ACCEPT STUDENT-ID.
READ-STUDENT-INFO.
  DISPLAY "ENTER STUDENT NAME:".
  ACCEPT STUDENT-NAME.
  DISPLAY "ENTER MIDTERM EXAM GRADE (XXX.XX):".
  ACCEPT MIDTERM-EXAM.
  DISPLAY "ENTER FINAL EXAM GRADE (XXX.XX):".
  ACCEPT FINAL-EXAM.
  DISPLAY "ENTER ASSIGNMENT GRADES (XX.XX) SEPARATED BY SPACES".
  PERFORM VARYING ASSIGNMENT-INDEX FROM 1 BY 1
    UNTIL ASSIGNMENT-INDEX > 5
    ACCEPT ASSIGNMENT-GRADE( ASSIGNMENT-INDEX )
    IF ASSIGNMENT-GRADE( ASSIGNMENT-INDEX ) = 00.00
       CONTINUE
    END-IF
  END-PERFORM.
CALCULATE-STUDENT-AVERAGE.
  COMPUTE STUDENT-AVERAGE ROUNDED =
   ((MIDTERM-EXAM * 0.3) + (FINAL-EXAM * 0.4) +
    (ASSIGNMENT-GRADE(1) + ASSIGNMENT-GRADE(2) +
     ASSIGNMENT-GRADE(3) + ASSIGNMENT-GRADE(4) +
     ASSIGNMENT-GRADE(5)) * 0.1) / 4.
CALCULATE-STUDENT-RANKING.
  IF STUDENT-AVERAGE >= 90
     MOVE 1 TO STUDENT-RANKING
  ELSE IF STUDENT-AVERAGE >= 80
     MOVE 2 TO STUDENT-RANKING
  ELSE IF STUDENT-AVERAGE >= 70
     MOVE 3 TO STUDENT-RANKING
  ELSE IF STUDENT-AVERAGE >= 60
     MOVE 4 TO STUDENT-RANKING
  ELSE
     MOVE 5 TO STUDENT-RANKING.
DISPLAY-RESULTS.
  DISPLAY "STUDENT ID: " STUDENT-ID.
  DISPLAY "STUDENT NAME: " STUDENT-NAME.
  DISPLAY "MIDTERM EXAM GRADE: " MIDTERM-EXAM.
  DISPLAY "FINAL EXAM GRADE: " FINAL-EXAM.
  DISPLAY "AVERAGE ASSIGNMENT GRADES:".
  PERFORM VARYING ASSIGNMENT-INDEX FROM 1 BY 1
    UNTIL ASSIGNMENT-INDEX > 5
    DISPLAY ASSIGNMENT-NAME( ASSIGNMENT-INDEX ) ": " ASSIGNMENT-GRADE( ASSIGNMENT-INDEX ).
  END-PERFORM.
  DISPLAY "STUDENT AVERAGE: " STUDENT-AVERAGE.
  DISPLAY "STUDENT RANKING: " STUDENT-RANKING.