MOVE 100 TO COUNT.                   *Sets COUNT variable to 100
PERFORM UNTIL COUNT = 0.             *Starts loop until COUNT reaches 0
    DISPLAY COUNT                    *Outputs COUNT value
    SUBTRACT 1 FROM COUNT.           *Subtracts 1 from COUNT variable
END-PERFORM.                         *Ends loop
EVALUATE TRUE                        *Starts evaluate statement
    WHEN COUNT = 100                 *Checks if COUNT is 100
        DISPLAY "Hundred"            *Outputs "Hundred" if condition is met
    WHEN COUNT = 50                  *Checks if COUNT is 50
        DISPLAY "Fifty"              *Outputs "Fifty" if condition is met
    WHEN OTHER                       *Executes when no conditions are met
        DISPLAY "Not a valid count"  *Outputs "Not a valid count"
END-EVALUATE.                        *Ends evaluate statement
STOP.                                *Ends program execution