IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(5).
01 F PIC 9(50).
PROCEDURE DIVISION.
START.
DISPLAY "ENTER A NUMBER: ".
ACCEPT N.
IF N = 0 OR N = 1
   SET F TO 1
ELSE
   MULTIPLY FACTORIAL (N - 1) BY N GIVING F.
DISPLAY "THE FACTORIAL OF ",N, " IS ",F.
STOP RUN.
FACTORIAL SECTION.
MULTIPLY I BY N GIVING K.
ADD K TO I.
PERFORM UNTIL I = N
      DISPLAY I.
      SET I TO N.
THIS-PROCEDURE.
SET FACTORIAL TO 0
MOVE 1 TO FACTORIAL.
PERFORM N TIME
   ADD N TO FACTORIAL.
STOP RUN.