IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATOR.

DATA DIVISION.
01 NUM1 PIC 9(5).
01 NUM2 PIC 9(5).
01 RESULT PIC 9(5).

PROCEDURE DIVISION.
    MOVE 10000 TO NUM1.
    MOVE 5000 TO NUM2.
    ADD NUM1 TO NUM2.
    DISPLAY "The sum of NUM1 and NUM2 is:".
    DISPLAY RESULT.
    STOP RUN.