IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST-CODE.
       AUTHOR. JOHN DOE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO 'STUDENTS.DAT'.
           SELECT GRADES-FILE ASSIGN TO 'GRADES.DAT'.

       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE
           LABEL RECORDS ARE STANDARD.
       01 STUDENT-RECORD.
           05 STUDENT-ID      PIC X(5).
           05 STUDENT-NAME    PIC X(20).
           05 STUDENT-AGE     PIC 9(3).
           05 STUDENT-MAJOR   PIC X(10).

       FD GRADES-FILE
           LABEL RECORDS ARE STANDARD.
       01 GRADE-RECORD.
           05 COURSE-CODE     PIC X(6).
           05 STUDENT-ID      PIC X(5).
           05 COURSE-GRADE    PIC 9(3).

       WORKING-STORAGE SECTION.
       01 STUDENT-COUNT        PIC 9(3) VALUE 0.
       01 COURSE-AVERAGE       PIC 9(3)V9(2).

       PROCEDURE DIVISION.
       100-MAIN.
           INITIALIZE STUDENT-COUNT TO 0.
           OPEN INPUT STUDENT-FILE.
           OPEN INPUT GRADES-FILE.

           PERFORM UNTIL STUDENT-FILE NOT AT END OR
                        GRADES-FILE NOT AT END
               READ STUDENT-FILE
                   AT END SET END-OF-FILE TO TRUE
               READ GRADES-FILE
                   AT END SET END-OF-FILE TO TRUE
               IF STUDENT-ID = GRADE-RECORD (2:5)
                   ADD 1 TO STUDENT-COUNT
                   COMPUTE COURSE-AVERAGE = (COURSE-AVERAGE + COURSE-GRADE)/2
               END-IF
           END-PERFORM.

           DISPLAY "Number of students: " STUDENT-COUNT.
           DISPLAY "Course average: " COURSE-AVERAGE.

           CLOSE STUDENT-FILE.
           CLOSE GRADES-FILE.
           STOP RUN.