IDENTIFICATION DIVISION.
PROGRAM-ID. CHECK-SUM.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 NUMBER-COUNT PIC 9(5).

PROCEDURE DIVISION.
   INITIALIZATION.
   DISPLAY "Enter a number to sum: ".
   ACCEPT NUMBER-COUNT

   MAIN-PARA.
   DISPLAY "Started Calculation".
   PERFORM CALCULATION THROUGH NUMBER-COUNT

   CALC-PARA.
   ADD 1 TO NUMBER-COUNT
   DISPLAY "Current Number: " NUMBER-COUNT
   MULTIPLY NUMBER-COUNT BY 2
   DISPLAY "Doubled Number: " NUMBER-COUNT
   SUBTRACT 10 FROM NUMBER-COUNT
   DISPLAY "Subtracted 10: " NUMBER-COUNT
   DIVIDE NUMBER-COUNT BY 2
   DISPLAY "Half of Number: " NUMBER-COUNT
   PERFORM CHECK IF-COUNT-EQUAL-STOP

   IF-COUNT-EQUAL-STOP.
   IF NUMBER-COUNT = 0
   DISPLAY "Reached stopping number."
   STOP RUN.