IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATE-SAVINGS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  AMOUNT-DEPOSITED    PIC 9(9)V99.
       01  NUM-OF-YEARS        PIC 99.
       01  INTEREST-RATE       PIC 9(2)V99.
       01  TOTAL-SAVINGS       PIC 9(11)V99.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY "Enter amount deposited: ".
           ACCEPT AMOUNT-DEPOSITED.

           DISPLAY "Enter number of years: ".
           ACCEPT NUM-OF-YEARS.

           IF NUM-OF-YEARS > 10 THEN
               COMPUTE INTEREST-RATE = 5.5
           ELSE 
               COMPUTE INTEREST-RATE = 3.5

           PERFORM CALCULATE-SAVINGS VARYING YEARS FROM 1 BY 1 UNTIL YEARS > NUM-OF-YEARS
           DISPLAY "Total savings for " YEARS "years is " TOTAL-SAVINGS

           STOP RUN.

       CALCULATE-SAVINGS.
           COMPUTE TOTAL-SAVINGS = (AMOUNT-DEPOSITED * (1 + (INTEREST-RATE / 100)) ** YEARS)