Identification Division.
Program-ID. SortNumbers.

Environment Division.
Configuration Section.
Source-Computer. MyComputer-001.
Object-Computer. YourComputer-001.

Data Division.
Working-Storage Section.
    01 Index INTEGER VALUE 1.
    01 NumberOfNumbers INTEGER VALUE 10. 
    01 NumbersToSort OCCURS 10 TIMES.
        05 NumberToSorts INTEGER.
    01 OutputMessage STRING VALUE "Sorted numbers are:".

Procedure Division.
    Begin.
        Display "Please enter 10 numbers to be sorted:" with no advancing.
        Perform display-input until Index > NumberOfNumbers.
        Perform sort-numbers until Index >NumberOfNumbers.
        Display OutputMessage.
        perform write-output.
        stop run.

DISPLAY-INPUT.
    Accept NumbersToSort(Index).
    Add 1 to Index.

SORT-NUMBERS.
    Perform varying i from 1 by 1 until i > NumberOfNumbers
            until Index = 0
        if NumbersToSort(Index) > NumbersToSort(Index + 1)
            Multiply NumbersToSort(Index) by -1.
            Multiply NumbersToSort(Index + 1) by -1.
            Subtract NumbersToSort(Index) from NumbersToSort(Index + 1).
            Subtract NumbersToSort(Index + 1) from NumbersToSort(Index).
            Multiply NumbersToSort(Index) by -1.
            Multiply NumbersToSort(Index + 1) by -1.
        end-if.
    end-perform.

WRITE-OUTPUT.
    Perform varying i from 1 by 1 until i > NumberOfNumbers
        Display NumbersToSort(i).