IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE-PROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM1 PIC 999.
77 NUM2 PIC 999.
77 RESULT PIC 999.

PROCEDURE DIVISION.
    MOVE 123 TO NUM1.
    MOVE 456 TO NUM2.
    COMPUTE RESULT = (NUM1 * 2) + (NUM2 * 3).
    DISPLAY "The result is: ", RESULT.

STOP RUN.