identification division.
program-id. FIBONACCI-SEQUENCE.

environment division.
configuration section.
special-names.
  console is crt.

data division.
working-storage section.
  01 NUMBER-OF-TERMS PIC 9(2) VALUE 10. /* number of terms to display in sequence */
  01 TERM-1 PIC 9(5) VALUE 0. /* first number in sequence */
  01 TERM-2 PIC 9(5) VALUE 1. /* second number in sequence */
  01 COUNT PIC 9(2) VALUE 2. /* loop counter to track number of terms displayed */
  01 NEXT-TERM PIC 9(5). /* variable to store the next term in sequence */

procedure division.
  perform display-heading. /* display header containing program name and explanation */
  perform display-terms /* display first two terms and then enter loop to calculate remaining terms */
  perform varying COUNT from 3 by 1 until COUNT > NUMBER-OF-TERMS /* loop through remaining terms */
    perform calculate-next-term /* calculate the next term in the sequence */
    perform display-next-term /* display the next term */
  end-perform.
  stop run.

display-heading section.
  display "Fibonacci Sequence Program".
  display "This program displays the first n terms of the Fibonacci sequence.".
  display "e.g. If n = 5, the sequence will be 0, 1, 1, 2, 3".

display-terms section.
  display "The first two terms in the sequence are:".
  display TERM-1.
  display TERM-2.

calculate-next-term section.
  add TERM-1, TERM-2 giving NEXT-TERM. /* add the last two terms to get next term */
  move TERM-2 to TERM-1. /* shift terms to prepare for next calculation */
  move NEXT-TERM to TERM-2.

display-next-term section.
  display NEXT-TERM.