WORKING-STORAGE SECTION.
           01 INTEGER-VARIABLE PIC S9(9) COMP-3.
           01 DECIMAL-VARIABLE PIC 9(15)V9(3) COMP-3.
           01 FIXED-DECIMAL-VARIABLE PIC 9(5)V99.
           01 STRING-VARIABLE PIC X(20).
           01 CONDITION-VARIABLE PIC X.
       PROCEDURE DIVISION.
           MOVE 123 TO INTEGER-VARIABLE.
           ADD 456 TO INTEGER-VARIABLE.
           DISPLAY "The result of the addition is: " INTEGER-VARIABLE.
           MOVE 123.45 TO DECIMAL-VARIABLE.
           MULTIPLY 234.56 BY DECIMAL-VARIABLE.
           DISPLAY "The result of the multiplication is: " DECIMAL-VARIABLE.
           MOVE "Hello" TO STRING-VARIABLE.
           INSPECT STRING-VARIABLE REPLACING ALL "H" BY "W".
           DISPLAY "The result of the replacement is: " STRING-VARIABLE.
           PERFORM CHECK-CONDITION.
           DISPLAY "The value of the conditional variable is: " CONDITION-VARIABLE.
       CHECK-CONDITION.
           IF INTEGER-VARIABLE > 1000
              MOVE "greater than 1000" TO CONDITION-VARIABLE
           ELSE IF INTEGER-VARIABLE < 1000
              MOVE "less than 1000" TO CONDITION-VARIABLE
           ELSE
              MOVE "equal to 1000" TO CONDITION-VARIABLE.