IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULATE-SUM.
DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM1 PIC 99 VALUE 10.
77 NUM2 PIC 99 VALUE 20.
77 SUM PIC 99.
PROCEDURE DIVISION.
DISPLAY "ADDING NUM1 AND NUM2".
MOVE NUM1 TO SUM.
ADD NUM2 TO SUM.
DISPLAY "THE SUM IS:".
DISPLAY SUM.
STOP RUN.
END PROGRAM CALCULATE-SUM.