IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO-WORLD.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 WS-ONE PIC X(5) VALUE "HELLO".
      01 WS-TWO PIC X(6) VALUE "WORLD!".
      PROCEDURE DIVISION.
      DISPLAY WS-ONE, " ", WS-TWO.
      STOP RUN.