01 STUDENT-RECORD.                                     
          03 STUDENT-NAME      PIC X(20).                      
          03 STUDENT-ID        PIC 9(9).                       
          03 STUDENT-ADDRESS   PIC X(30).                      
                                                             
       01 COURSE-RECORD.                                       
          03 COURSE-NAME       PIC X(20).                      
          03 COURSE-ID         PIC 9(9).                       
          03 COURSE-STATUS     PIC X.                          
                                                             
       01 GRADE-RECORD.                                        
          03 STUDENT-ID        PIC 9(9).                       
          03 COURSE-ID         PIC 9(9).                       
          03 COURSE-GRADE      PIC X.                          
                                                             
       01 COURSES-ENROLLED.                                    
          03 NUM-COURSES      PIC 9(3).                        
          03 COURSE-LIST.                                      
             05 COURSE            PIC 9(9).                    
                
       EVALUATE COURSE-STATUS                                     
          WHEN 'C'                                                 
             REPLACE 'Course completed successfully'                
          WHEN 'D'                                                 
             REPLACE 'Course dropped by student'                    
          WHEN 'W'                                                 
             REPLACE 'Course withdrawn by student'                  
          END-EVALUATE