IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLEPROGRAM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUM-A         PIC 9(5).
01  NUM-B         PIC 9(5).
01  RESULT        PIC 9(5).
01  TEMP PIC 9(5).
01  CTR PIC S9(3) COMP VALUE ZERO.
01  BASE-HIGH WUSS-NUMERIC PIC 9(5).

PROCEDURE DIVISION.
BEGIN PROGRAM.
    DISPLAY "ENTER TWO NUMBERS TO BE MULTIPLIED : ".
    ACCEPT NUM-A.
    ACCEPT NUM-B.
    IF NUM-A IS NUMERIC AND NUM-B IS NUMERIC THEN
        PERFORM MULTIPLY-DIVIDE-RTN-SUBROUTINE
    END-IF.
    DISPLAY "RESULT = ", RESULT.
STOP RUN.

MULTIPLY-DIVIDE-RTN-SUBROUTINE.
    MULTIPLY RESULT BY NUM-A GIVING TEMP
    PERFORM VARYING CTR FROM 1 BY 1
        UNTIL CTR > NUM-B
        ADD TEMP TO RESULT
    END-PERFORM.
END PROGRAM.