IDENTIFICATION DIVISION.
       PROGRAM-ID. Main.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT input-file ASSIGN TO "input.txt".
           SELECT output-file ASSIGN TO "output.txt".

       DATA DIVISION.
       FILE SECTION.
       FD input-file.
       01 input-record.
           05 input-name   PIC X(20).
           05 input-age    PIC 9(3).
           05 input-gender PIC X.
       FD output-file.
       01 output-record.
           05 output-name   PIC X(20).
           05 output-group  PIC 9(2).
           05 output-avg-age PIC 9(3).

       WORKING-STORAGE SECTION.
       77 total-records          PIC 9(3).
       77 total-male-records     PIC 9(3).
       77 total-female-records   PIC 9(3).
       77 sum-ages-male          PIC 9(5)V99.
       77 sum-ages-female        PIC 9(5)V99.
       77 average-age-male       PIC 9(3)V99.
       77 average-age-female     PIC 9(3)V99.

       PROCEDURE DIVISION.
       OPEN INPUT input-file.
       OPEN OUTPUT output-file.

       PERFORM READ-INPUT UNTIL input-name = "END".

       MOVE total-male-records TO output-group.
       COMPUTE average-age-male = sum-ages-male / total-male-records.
       MOVE average-age-male TO output-avg-age.
       WRITE output-record.

       MOVE total-female-records TO output-group.
       COMPUTE average-age-female = sum-ages-female / total-female-records.
       MOVE average-age-female TO output-avg-age.
       WRITE output-record.

       CLOSE input-file, output-file.
       STOP RUN.

       READ-INPUT.
           READ input-file INTO input-record
               AT END MOVE "END" TO input-name.

           IF input-gender = "M"
               ADD 1 TO total-male-records
               ADD input-age TO sum-ages-male
           ELSE
               ADD 1 TO total-female-records
               ADD input-age TO sum-ages-female.