* This program calculates the minimum payment on a credit card

      IDENTIFICATION DIVISION.
      PROGRAM-ID. MIN_PAY_CALC.

      DATA DIVISION.
      WORKING-STORAGE SECTION.

      01 MIN-PAYMENT PIC 9(6)V99.
      01 MONTHLY-INTEREST PIC 9(4)V99.
      01 CURRENT-BALANCE PIC 9(7)V99.
      01 PREVIOUS-BALANCE PIC 9(7)V99.
      01 MIN-PAY-RATE PIC 9(3).

      PROCEDURE DIVISION.

      DISPLAY "Enter the current balance on your credit card."
      ACCEPT CURRENT-BALANCE.

      DISPLAY "Enter the previous balance on your credit card."
      ACCEPT PREVIOUS-BALANCE.

      DISPLAY "Enter the minimum payment rate."
      ACCEPT MIN-PAY-RATE.

      COMPUTE MONTHLY-INTEREST = (PREVIOUS-BALANCE * 0.01) / 12.

      IF CURRENT-BALANCE > 0
        COMPUTE MIN-PAYMENT = MAX(CURRENT-BALANCE * (MIN-PAY-RATE / 100), 20)
      ELSE
        MOVE 0 TO MIN-PAYMENT
      END-IF.

      DISPLAY "The minimum payment is $" MIN-PAYMENT.

      STOP RUN.