IDENTIFICATION DIVISION.                                  * Start of program
PROGRAM-ID. CALCULATE.                                     * Program name

DATA DIVISION.                                             * Start of data division
WORKING-STORAGE SECTION.                                   * Declaring variables

01 SALES-RECORD.                                           * Group level data item
   02 REGION PIC X(10) VALUE "EAST".                        * Sub level data item
   02 QUARTER-1 PIC 9(9) VALUE 100000.                      * Sub level data item
   02 QUARTER-2 PIC 9(9) VALUE 200000.                      * Sub level data item
   02 QUARTER-3 PIC 9(9) VALUE 15000.                       * Sub level data item
   02 QUARTER-4 PIC 9(9) VALUE 80000.                       * Sub level data item

01 TOTAL-SALES PIC 9(9).                                   * Group level data item

PROCEDURE DIVISION.                                        * Start of procedure division
1. CALCULATE-TOTAL.
   COMPUTE TOTAL-SALES = QUARTER-1 + QUARTER-2 + QUARTER-3 + QUARTER-4.
   DISPLAY "Total Sales = " TOTAL-SALES.                    * Display result to user