Identification Division.
Program-ID. TestProgram.

Data Division.
Working-Storage Section.

  01 Counters.
     05 LoopCounter       Pic 99.
     05 TotalMarks        Pic 99.
     05 HighestMark       Pic 99.

  01 StudentDetails.
     05 Name              Pic X(20).
     05 RollNumber        Pic 999.
     05 Marks.
        10 English        Pic 99.
        10 Science        Pic 99.
        10 Math           Pic 99.

  01 SchoolDetails.
     05 SchoolName        Pic X(30).
     05 Address           Pic X(50).
     05 City              Pic X(20).
     05 State             Pic X(20).
     05 ZipCode           Pic 99999.

Procedure Division.
Main-Program.

  Perform Initialize-Counters

  Perform Get-School-Details

  Perform Until LoopCounter >= 10
    Perform Get-Student-Details
    Perform Calculate-TotalMarks
    Perform Determine-Highest-Mark
    Perform Print-Student-Details
    Add 1 to LoopCounter
  End-Perform.

  Display "The student with the highest mark is " HighestMark.

  Stop Run.

Initialize-Counters.
  Move 0 to LoopCounter
  Move 0 to TotalMarks
  Move 0 to HighestMark.

Get-School-Details.
  Display "Please enter school name:" with no advancing
  Accept SchoolName
  Display "Please enter address:" with no advancing
  Accept Address
  Display "Please enter city:" with no advancing
  Accept City
  Display "Please enter state:" with no advancing
  Accept State
  Display "Please enter zip code:" with no advancing
  Accept ZipCode.

Get-Student-Details.
  Move 0 to English, Science, Math
  Display "Please enter student name:" with no advancing
  Accept Name
  Display "Please enter roll number:" with no advancing
  Accept RollNumber
  Display "Please enter marks for English:" with no advancing
  Accept English
  Display "Please enter marks for Science:" with no advancing
  Accept Science
  Display "Please enter marks for Math:" with no advancing
  Accept Math.

Calculate-TotalMarks.
  Add English, Science, Math giving TotalMarks.

Determine-Highest-Mark.
  If TotalMarks > HighestMark
    Move TotalMarks to HighestMark.

Print-Student-Details.
  Display "Name: " Name
  Display "Roll Number: " RollNumber
  Display "English: " English
  Display "Science: " Science
  Display "Math: " Math.