DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  NUM1 PIC 9(3).
       01  NUM2 PIC 9(3).
       01  RESULT PIC 9(4).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Enter first number: ".
           ACCEPT NUM1.
           DISPLAY "Enter second number: ".
           ACCEPT NUM2.

           PERFORM MULTIPLY
           PERFORM DIVIDE
           DISPLAY "Result of multiplication and division is: ".
           DISPLAY RESULT.
           STOP RUN.

       MULTIPLY.
           MULTIPLY NUM1 BY NUM2 GIVING RESULT.

       DIVIDE.
           DIVIDE NUM1 INTO NUM2 GIVING RESULT.