IDENTIFICATION DIVISION.
PROGRAM-ID. EXAMPLE.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NUMBERS OCCURS 10 TIMES.
    05 NUM1 PIC 9(3) VALUE 12.
    05 NUM2 PIC 9(3) VALUE 5.
    05 RESULT PIC 9(3).

PROCEDURE DIVISION.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
    COMPUTE RESULT = NUM1 / NUM2
    DISPLAY "Result of division is: ", RESULT
END-PERFORM.
    
STOP RUN.