ENVIRONMENT DIVISION.
      INPUT-OUTPUT SECTION.
      FD MY-INPUT-FILE.
      01 RECORD-INPUT.
         05 FIELD1 PIC X(5).
         05 FIELD2 PIC X(10).
         05 FIELD3 PIC X(15).
      FD MY-OUTPUT-FILE.
      01 RECORD-OUTPUT.
         05 FIELD1 PIC X(5).
         05 FIELD2 PIC X(20).
         05 FIELD3 PIC X(25).
         05 FIELD4 PIC X(30).
         05 FIELD5 PIC X(35).
      WORKING-STORAGE SECTION.
      01 FILE-STATUS PIC XX.
      01 TOTAL-RECORDS PROCEDURE DIVISION.
      OPEN INPUT MY-INPUT-FILE.
      OPEN OUTPUT MY-OUTPUT-FILE.
      PERFORM UNTIL FILE-STATUS = '10'
         READ MY-INPUT-FILE
           AT END MOVE '10' TO FILE-STATUS
         END-READ
         PERFORM VALIDATE-DATA
         WRITE RECORD-OUTPUT
         END-PERFORM
      CLOSE MY-INPUT-FILE.
      CLOSE MY-OUTPUT-FILE.
      STOP RUN.
      
      VALIDATE-DATA.
      	IF FIELD1 IS NUMERIC
      		MOVE FIELD2 TO FIELD4
      	ELSE
      		MOVE 'ERROR' TO FIELD4
      	END-IF
      	IF FIELD3 IS LOW-VALUE
      		MOVE 'EMPTY' TO FIELD5
      	ELSE
      		MOVE FIELD3 TO FIELD5
      	END-IF.