Identification Division.    `  
Program-ID. HELLO-WORLD.  
Environment Division.  
Configuration Section.  
Source-Computer. IBM-PC.  
Object-Computer. IBM-PC.  
Data Division.  
File Section.  
Working-Storage Section.  
01 Name              Pic X(10) Value "Hello".  
01 End-Name          Pic X(10) Value "World".  
01 Tens              Pic S9(2) Comp Value 1.  
01 Units             Pic S9(2) Comp Value 2.  
01 Result            Pic S9(3) Comp.  
Procedure Division.  
Add Tens to Units Giving Result.  
Display Name End-Name " " Result.  
Stop Run.