DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INPUT-NUMBER PIC 9(4) VALUE 1234.
       01 REVERSED-NUMBER PIC 9(4).
       PROCEDURE DIVISION.
           PERFORM THROUGH-INPUT-LOOP UNTIL INPUT-NUMBER = 0.
           DISPLAY "Reversed number is" REVERSED-NUMBER.
           STOP RUN.
     
       THROUGH-INPUT-LOOP.
           MULTIPLY REVERSED-NUMBER BY 10.
           DIVIDE INPUT-NUMBER BY 10 GIVING INPUT-NUMBER.
           ADD INPUT-NUMBER TO REVERSED-NUMBER.