IDENTIFICATION DIVISION.
       PROGRAM-ID. Main.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-OF-STUDENTS-PIC FILE RECORD IS 9(4).
       01 NUM-OF-STUDENTS VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           OPEN INPUT NUM-OF-STUDENTS-PIC.
           READ NUM-OF-STUDENTS-PIC.
           MOVE NUM-OF-STUDENTS-PIC TO NUM-OF-STUDENTS.
           IF NUM-OF-STUDENTS < 0
               DISPLAY "Error: Invalid number of students."
           ELSE
               DISPLAY "Number of students: " NUM-OF-STUDENTS
               PERFORM CALCULATE-STATISTICS
           END-IF.
           CLOSE NUM-OF-STUDENTS-PIC.
      .
       CALCULATE-STATISTICS.
           WORKING-STORAGE SECTION.
           01 STUDENT-RECORD FILE RECORD.
           02 STUDENT-NAME PIC X(20).
           02 STUDENT-GRADE PIC 99.
           02 STUDENT-AVERAGE COMPUTE STUDENT-AVERAGE = (STUDENT-GRADE / 2).
           01 HIGHEST-GRADE VALUE ZEROES.
           01 LOWEST-GRADE VALUE 100.
           01 TOTAL-GRADES VALUE ZEROES.
           01 AVERAGE-GRADE VALUE ZEROES.
           01 LOOP-COUNTER INDEX IS 1.
           OPEN INPUT STUDENT-RECORD.
           PERFORM READ-STUDENT-RECORD UNTIL LOOP-COUNTER > NUM-OF-STUDENTS.
           PERFORM CALCULATE-HIGHEST-GRADE.
           PERFORM CALCULATE-LOWEST-GRADE.
           PERFORM CALCULATE-AVERAGE-GRADE.
           DISPLAY "Highest grade: " HIGHEST-GRADE
           DISPLAY "Lowest grade: " LOWEST-GRADE
           DISPLAY "Average grade: " AVERAGE-GRADE
           CLOSE STUDENT-RECORD.
      .
       CALCULATE-HIGHEST-GRADE.
           IF STUDENT-GRADE > HIGHEST-GRADE
               MOVE STUDENT-GRADE TO HIGHEST-GRADE.
      .
       CALCULATE-LOWEST-GRADE.
           IF STUDENT-GRADE < LOWEST-GRADE
               MOVE STUDENT-GRADE TO LOWEST-GRADE.
       .
       CALCULATE-AVERAGE-GRADE.
           COMPUTE TOTAL-GRADES = TOTAL-GRADES + STUDENT-GRADE.
           COMPUTE AVERAGE-GRADE = TOTAL-GRADES / NUM-OF-STUDENTS.
       .
       READ-STUDENT-RECORD.
           READ STUDENT-RECORD AT END MOVE ZEROES TO STUDENT-RECORD.
           ADD 1 TO LOOP-COUNTER.
       .
       END PROGRAM Main.