IDENTIFICATION DIVISION.
       PROGRAM-ID. Profit_Calculation.
       AUTHOR. John Doe.
      * This program calculates the profit for a company.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SALES-AMOUNT PIC 9(6)V99.
       01 COSTS-AMOUNT PIC 9(6)V99.
       01 PROFIT-AMOUNT PIC 9(6)V99.
       PROCEDURE DIVISION.
       001-CALCULATE-PROFIT.
           MULTIPLY SALES-AMOUNT BY 0.75 GIVING PROFIT-AMOUNT.
           SUBTRACT COSTS-AMOUNT FROM PROFIT-AMOUNT GIVING PROFIT-AMOUNT.
           DISPLAY "The total profit is: " PROFIT-AMOUNT.
       002-EXIT.
           STOP RUN.
       END PROGRAM Profit_Calculation.