IDENTIFICATION DIVISION.
       PROGRAM-ID. LONG-COMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-1 PIC 9(10).
       01 VAR-2 PIC 9(10).
       01 RESULT PIC 9(10).
       PROCEDURE DIVISION.
           ADD VAR-1, VAR-2 GIVING RESULT.
           MOVE 0 TO VAR-1 VAR-2.
           PERFORM CALCULATION.
           DISPLAY "The result of the calculation is " RESULT.
       CALCULATION.
           MULTIPLY VAR-1 BY VAR-2.
           SUBTRACT VAR-1 FROM VAR-2.
           DIVIDE VAR-2 INTO VAR-1 GIVING VAR-1 REMAINDER VAR-2.