IDENTIFICATION DIVISION.
       PROGRAM-ID. test-cobol.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SALES-TABLE.
          05 REGION-HEADER.
             10 REGION-NAME PIC X(20).
             10 FISCAL-YEAR PIC 9(4).
             10 QUARTER-ONE.
                15 JANUARY PIC 9(5).
                15 FEBRUARY PIC 9(5).
                15 MARCH PIC 9(5).
             10 QUARTER-TWO.
                15 APRIL PIC 9(5).
                15 MAY PIC 9(5).
                15 JUNE PIC 9(5).
             10 QUARTER-THREE.
                15 JULY PIC 9(5).
                15 AUGUST PIC 9(5).
                15 SEPTEMBER PIC 9(5).
             10 QUARTER-FOUR.
                15 OCTOBER PIC 9(5).
                15 NOVEMBER PIC 9(5).
                15 DECEMBER PIC 9(5).

       PROCEDURE DIVISION.
       MAIN-PROCESS.
           PERFORM INPUT-REGION-HEADER
           PERFORM CALCULATE-SALES-TABLE
           PERFORM PRINT-SALES-TABLE
           STOP RUN.

       INPUT-REGION-HEADER.
           DISPLAY "Enter region name: ".
           ACCEPT REGION-NAME.
           DISPLAY "Enter fiscal year: ".
           ACCEPT FISCAL-YEAR.

       CALCULATE-SALES-TABLE.
           COMPUTE JANUARY = 5000 * FISCAL-YEAR.
           COMPUTE FEBRUARY = 4000 * FISCAL-YEAR.
           COMPUTE MARCH = 3000 * FISCAL-YEAR.
           COMPUTE APRIL = 2000 * FISCAL-YEAR.
           COMPUTE MAY = 1000 * FISCAL-YEAR.
           COMPUTE JUNE = 500 * FISCAL-YEAR.
           COMPUTE JULY = 4000 * FISCAL-YEAR.
           COMPUTE AUGUST = 3000 * FISCAL-YEAR.
           COMPUTE SEPTEMBER = 2000 * FISCAL-YEAR.
           COMPUTE OCTOBER = 1000 * FISCAL-YEAR.
           COMPUTE NOVEMBER = 500 * FISCAL-YEAR.
           COMPUTE DECEMBER = 400 * FISCAL-YEAR.

       PRINT-SALES-TABLE.
           DISPLAY REGION-NAME " Sales Table:".
           DISPLAY "Jan   Feb   Mar   Qtr 1".
           DISPLAY JANUARY FEBRUARY MARCH QUARTER-ONE.
           DISPLAY "Apr   May   Jun   Qtr 2".
           DISPLAY APRIL MAY JUNE QUARTER-TWO.
           DISPLAY "Jul   Aug   Sep   Qtr 3".
           DISPLAY JULY AUGUST SEPTEMBER QUARTER-THREE.
           DISPLAY "Oct   Nov   Dec   Qtr 4".
           DISPLAY OCTOBER NOVEMBER DECEMBER QUARTER-FOUR.