IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       AUTHOR. JOE SMITH.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
               SELECT IN-FILE ASSIGN TO "INFILE.TXT".
               SELECT OUT-FILE ASSIGN TO "OUTFILE.TXT".
       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE
               RECORDING MODE IS F.
       01 IN-RECORD PIC X(50).
       FD OUT-FILE
               RECORDING MODE IS F.
       01 OUT-RECORD PIC X(50).
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC 9(9) VALUE 0.
       01 WS-COUNT PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       OPEN INPUT IN-FILE.
       OPEN OUTPUT OUT-FILE.
       PERFORM UNTIL WS-COUNT EQUAL TO 10
               READ IN-FILE INTO IN-RECORD
               IF IN-RECORD = "END"
               GO TO OUTPUT-FILE
               ELSE
               ADD 1 TO WS-COUNT
               END-IF
       END-PERFORM.
       OUTPUT-FILE.
       PERFORM VARYING WS-NUMBER FROM 1 BY 2 UNTIL WS-NUMBER
       IS GREATER THAN 10.
               MOVE WS-NUMBER TO OUT-RECORD
               WRITE OUT-RECORD
               END-PERFORM.
       CLOSE IN-FILE OUT-FILE.
       STOP RUN.