IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTING-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'FILE1.DAT'.
           SELECT OUTPUT-FILE ASSIGN TO 'FILE2.DAT'.
                    
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-RECORD.
           05 INPUT-FIELD PIC X(10).

       SD OUTPUT-FILE.
       01 OUTPUT-RECORD.
           05 OUTPUT-FIELD PIC X(10).

       WORKING-STORAGE SECTION.
       01 NUM-RECORDS PIC 9(2) VALUE 10.
       01 SORT-TABLE.
           05 SORT-KEY PIC X(10) OCCURS 10 TIMES INDEXED BY IDX.
       01 IDX PIC 99 VALUE 1.
       01 TEMP-RECORDS.
           05 TEMP-KEY PIC X(10) OCCURS 10 TIMES INDEXED BY IDY.
           05 TEMP-RECORD PIC X(10).

       PROCEDURE DIVISION.
       000-BEGIN.
           PERFORM 100-READ-RECORDS.
           PERFORM 200-SORT-RECORDS.
           PERFORM 300-WRITE-RECORDS.
           STOP RUN.

       100-READ-RECORDS.
       OPEN INPUT INPUT-FILE
       FOR READ WITH LOCK.
       PERFORM VARYING IDX FROM 1 BY 1
       UNTIL IDX > NUM-RECORDS
           READ INPUT-FILE INTO INPUT-RECORD
           AT END MOVE 'END' TO INPUT-FIELD
           NOT AT END MOVE INPUT-FIELD TO SORT-KEY(IDX)
           END-READ
       END-PERFORM.
       CLOSE INPUT-FILE.

       200-SORT-RECORDS.
       PERFORM VARYING IDX FROM 1 BY 1
       UNTIL IDX > NUM-RECORDS
           PERFORM VARYING IDY FROM IDX+1 BY 1
           UNTIL IDY > NUM-RECORDS
               IF SORT-KEY(IDX) > SORT-KEY(IDY)
                   MOVE SORT-KEY(IDX) TO TEMP-RECORD(IDX)
                   MOVE OUTPUT-RECORD(IDY) TO TEMP-RECORD(IDY)
                   MOVE TEMP-RECORD(IDX) TO SORT-KEY(IDY)
               END-IF
           END-PERFORM
       END-PERFORM.

       300-WRITE-RECORDS.
       OPEN OUTPUT OUTPUT-FILE
       FOR WRITE WITH LOCK.
       PERFORM VARYING IDX FROM 1 BY 1
       UNTIL IDX > NUM-RECORDS
           MOVE TEMP-RECORD(IDX) TO INPUT-FIELD
           MOVE INPUT-FIELD TO OUTPUT-FIELD
           WRITE OUTPUT-RECORD
       END-PERFORM.
       CLOSE OUTPUT-FILE.
       
       END PROGRAM SORTING-PROGRAM.