*** PRODUCTION RECORD SORT ***
** THIS PROGRAM SORTS PRODUCTION RECORDS BY LOCATION **
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTPROD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PROD-OUT-FILE ASSIGN TO 'PRODUCTION-SORTED.TXT'.
           SELECT PROD-IN-FILE ASSIGN TO 'PRODUCTION-TO-SORT.TXT'.
       DATA DIVISION.
       FILE SECTION.
       FD PROD-OUT-FILE
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 0 RECORDS.
       01 PROD-OUT-REC.
           05 PRODUCT-CODE PIC A(5).
           05 PRODUCT-NAME PIC A(25).
           05 PRODUCT-QUANTITY PIC 9(4).
           05 PRODUCT-PRICE PIC 9(4)V99.
       FD PROD-IN-FILE
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 0 RECORDS.
       01 PROD-IN-REC.
           05 PRODUCT-CODE-IN PIC A(5).
           05 PRODUCT-NAME-IN PIC A(25).
           05 PRODUCT-QUANTITY-IN PIC 9(4).
           05 PRODUCT-PRICE-IN PIC 9(4)V99.
       WORKING-STORAGE SECTION.
       01 SORT-CONTROL-IN.
           05 RUNDATE-IN.
               10 RUNYEAR-IN PIC 9(4).
               10 RUNMONTH-IN PIC XX.
               10 RUNDAY-IN PIC XX.
           05 RUNTIME-IN.
               10 HOUR-IN PIC XX.
               10 MINUTE-IN PIC XX.
       01 SORT-CONTROL-OUT.
           05 RUNDATE-OUT.
               10 RUNYEAR-OUT PIC 9(4).
               10 RUNMONTH-OUT PIC XX.
               10 RUNDAY-OUT PIC XX.
           05 RUNTIME-OUT.
               10 HOUR-OUT PIC XX.
               10 MINUTE-OUT PIC XX.
       01 PROD-SORT-TABLE.
           05 PROD-SORT-TABLE-R.
               10 SORTFIELD PIC A(25) VALUE 'PRODUCT-CODE-IN'.
               10 STARTPOS PIC 9(3) VALUE 1.
               10 SORTLEN PIC 9(2) VALUE 5.
               10 SORTDIRECTION PIC A(3) VALUE 'ASC'.
               10 ALPHANUMFLAG PIC A(3) VALUE 'NUM'.
               10 IGNORELEADINGZEROS PIC A(3) VALUE 'NO'.


       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT PROD-IN-FILE
                OUTPUT PROD-OUT-FILE.
           READ PROD-IN-FILE
                AT END MOVE 'TRUE' TO EOF.
           PERFORM UNTIL EOF = 'TRUE'
               MOVE PRODUCT-CODE-IN IN PROD-IN-REC
                   TO PRODUCT-CODE OUT PROD-REC
               MOVE PRODUCT-NAME-IN IN PROD-IN-REC
                   TO PRODUCT-NAME OUT PROD-REC
               MOVE PRODUCT-QUANTITY-IN IN PROD-IN-REC
                   TO PRODUCT-QUANTITY OUT PROD-REC
               MOVE PRODUCT-PRICE-IN IN PROD-IN-REC
                   TO PRODUCT-PRICE OUT PROD-REC
               WRITE PROD-REC.
               READ PROD-IN-FILE
                   AT END MOVE 'TRUE' TO EOF
           END-PERFORM.
           CLOSE PROD-IN-FILE
                 PROD-OUT-FILE.
           STOP RUN.
       END PROGRAM SORTPROD.