IDENTIFICATION DIVISION.
PROGRAM-ID. SORT-ARRAY.
* This program sorts an array of integers in ascending order
* using the bubble sort algorithm.
DATA DIVISION.
WORKING-STORAGE SECTION.
* Define array of integers with 10 elements
01 ARRAY-OF-INTEGERS.
   05 ARRAY-SIZE      PIC 9(2) COMP VALUE 10.
   05 ARRAY-ELEMENTS  OCCURS 10 TIMES.
      10 ARRAY-ELEMENT  PIC 9(3).
PROCEDURE DIVISION.
SORT-ARRAY-START.
* Initialize array with random numbers
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
      COMPUTE ARRAY-ELEMENT (I) = FUNCTION RANDOM(100)
   END-PERFORM.
* Use bubble sort algorithm to sort array in ascending order
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE - 1
      PERFORM VARYING J FROM 1 BY 1 UNTIL J > ARRAY-SIZE - I
         IF ARRAY-ELEMENT (J) > ARRAY-ELEMENT (J+1)
* Swap elements if they are out of order
            MOVE ARRAY-ELEMENT (J+1) TO TEMP-ELEMENT
            MOVE ARRAY-ELEMENT (J) TO ARRAY-ELEMENT (J+1)
            MOVE TEMP-ELEMENT TO ARRAY-ELEMENT (J)
         END-IF
      END-PERFORM.
* Output the sorted array
   PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
      DISPLAY "Element " I " of array is " ARRAY-ELEMENT (I)
   END-PERFORM.
SORT-ARRAY-EXIT.
STOP RUN.