IDENTIFICATION DIVISION.
     PROGRAM-ID. my-program.
     DATA DIVISION.
     WORKING-STORAGE SECTION.
     01 num1     PIC S9(4)V99.
     01 num2     PIC S9(4)V99.
     01 result   PIC S9(4)V99.
     PROCEDURE DIVISION.
     ACCEPT num1.
     ACCEPT num2.
     COMPUTE result = num1 + num2.
     DISPLAY "The sum is " result.
     STOP RUN.