IDENTIFICATION DIVISION.
PROGRAM-ID. GENERATE-ARRAY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARRAY-SIZE PIC 9(2) VALUE 10.
01 NUMBERS PIC 9(5) OCCURS ARRAY-SIZE TIMES.
01 TEMP PIC 9(5).

PROCEDURE DIVISION.
PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > ARRAY-SIZE
    MOVE FUNCTION RANDOM(99999) TO NUMBERS(INDEX)
END-PERFORM.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > ARRAY-SIZE
    PERFORM VARYING J FROM 1 BY 1 UNTIL J > ARRAY-SIZE - I
        IF NUMBERS(J) > NUMBERS(J + 1)
            MOVE NUMBERS(J) TO TEMP
            MOVE NUMBERS(J + 1) TO NUMBERS(J)
            MOVE TEMP TO NUMBERS(J + 1)
        END-IF
    END-PERFORM
END-PERFORM.
DISPLAY "Generated array: "
PERFORM VARYING INDEX FROM 1 BY 1 UNTIL INDEX > ARRAY-SIZE
    DISPLAY "Number at index " INDEX " is " NUMBERS(INDEX)
END-PERFORM.

STOP RUN.