IDENTIFICATION DIVISION.
        PROGRAM-ID. HELLO-WORLD.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 MESSAGE PIC X(14) VALUE "HELLO, WORLD!".
        PROCEDURE DIVISION.
        DISPLAY MESSAGE.
        STOP RUN.