IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
AUTHOR. YOUR NAME.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
DECIMAL POINT IS COMMA.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT IN-FILE ASSIGN TO "INPUT.TXT".
SELECT OUT-FILE ASSIGN TO "OUTPUT.TXT".

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 INPUT-RECORD.
05 IN-NAME PIC X(20).
05 IN-AGE PIC 99.
05 IN-GENDER PIC X.
FD OUT-FILE.
01 OUTPUT-RECORD.
05 OUT-NAME PIC X(20).
05 OUT-AGE-DISPLAY PIC X(4).
05 OUT-GENDER PIC X.
WORKING-STORAGE SECTION.
01 TEMP-AGE PIC 99.

PROCEDURE DIVISION.
MAIN-ROUTINE.
OPEN INPUT IN-FILE
OUTPUT OUT-FILE
PERFORM READ-FILE
UNTIL EOF-FLAG
CLOSE IN-FILE
OUT-FILE
STOP RUN.

READ-FILE.
READ IN-FILE AT END
COMPUTE EOF-FLAG = 1
NOT AT END
PERFORM PROCESS-DATA
PERFORM DISPLAY-OUTPUT
END-READ.

PROCESS-DATA.
MOVE IN-AGE TO TEMP-AGE
COMPUTE OUT-AGE-DISPLAY = FUNCTION NUMVAL(TEMP-AGE)
IF IN-GENDER = "M"
MOVE "MALE" TO OUT-GENDER
ELSE
MOVE "FEMALE" TO OUT-GENDER.

DISPLAY-OUTPUT.
DISPLAY "NAME: " IN-NAME
DISPLAY "AGE: " OUT-AGE-DISPLAY
DISPLAY "GENDER: " OUT-GENDER
MOVE SPACES TO OUTPUT-RECORD
MOVE IN-NAME TO OUT-NAME
MOVE OUT-AGE-DISPLAY TO OUT-AGE
MOVE OUT-GENDER TO OUT-GENDER
WRITE OUTPUT-RECORD.