IDENTIFICATION DIVISION.
      PROGRAM-ID. PRINT-MESSAGE.
      ENVIRONMENT DIVISION.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
        01 MESSAGE-TEXT PIC X(50) VALUE "Hello world!".
      PROCEDURE DIVISION.
      MAIN-PARA.
           MOVE SPACES TO MESSAGE-TEXT
              DISPLAY "The message is: "
              DISPLAY MESSAGE-TEXT.
           STOP RUN.
      END PROGRAM PRINT-MESSAGE.