IDENTIFICATION DIVISION.
PROGRAM-ID. payment-processing.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-370.
OBJECT-COMPUTER. IBM-370.

DATA DIVISION.
FILE SECTION.

FD CUSTOMER-FILE.
01 CUSTOMER-RECORD.
   03 CUSTOMER-ID PIC X(10).
   03 CUSTOMER-NAME PIC X(20).
   03 CUSTOMER-BALANCE PIC 9(6)V99.

FD TRANSACTION-FILE.
01 TRANSACTION-RECORD.
   03 TRANSACTION-ID PIC X(10).
   03 TRANSACTION-DATE PIC X(10).
   03 TRANSACTION-AMOUNT PIC 9(6)V99.

WORKING-STORAGE SECTION.

77 TOTAL-TRANSACTIONS PIC 9(6)V99.
77 PAYMENT-TOTAL PIC 9(6)V99.

PROCEDURE DIVISION.

DISPLAY "***PAYMENT PROCESSING STARTED***".

OPEN INPUT CUSTOMER-FILE.
OPEN INPUT TRANSACTION-FILE.

PERFORM UNTIL TOTAL-TRANSACTIONS = '999999'

    READ CUSTOMER-FILE
    AT END
       DISPLAY "CUSTOMER FILE ENDED"
    END-READ
    
    READ TRANSACTION-FILE
    AT END
       DISPLAY "TRANSACTION FILE ENDED"
    END-READ
    
    IF CUSTOMER-RECORD.CUSTOMER-ID = TRANSACTION-RECORD.TRANSACTION-ID
       SUBTRACT TRANSACTION-RECORD.TRANSACTION-AMOUNT FROM CUSTOMER-RECORD.CUSTOMER-BALANCE
       ADD TRANSACTION-RECORD.TRANSACTION-AMOUNT TO PAYMENT-TOTAL
       ADD 1 TO TOTAL-TRANSACTIONS
       
       DISPLAY "CUSTOMER " CUSTOMER-RECORD.CUSTOMER-NAME " HAS A NEW BALANCE OF " CUSTOMER-RECORD.CUSTOMER-BALANCE
    END-IF
    
END-PERFORM.

DISPLAY "TOTAL TRANSACTIONS PROCESSED: " TOTAL-TRANSACTIONS.
DISPLAY "TOTAL PAYMENTS PROCESSED: " PAYMENT-TOTAL.

DISPLAY "***PAYMENT PROCESSING COMPLETED***".

CLOSE CUSTOMER-FILE.
CLOSE TRANSACTION-FILE.

STOP RUN.