IDENTIFICATION DIVISION.
       PROGRAM-ID. MARKET.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-FILE  ASSIGN "INVENTORY.dat"
           SELECT ORDERS-FILE ASSIGN "ORDERS.dat".
       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS INVENTORY-RECORD.
       01 INVENTORY-RECORD.
           05 ITEM-CODE PIC X(5).
           05 ITEM-NAME PIC X(30).
           05 ITEM-PRICE PIC 999V99.


       FD ORDERS-FILE
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS ORDERS-RECORD.
       01 ORDERS-RECORD.
           05 CUSTOMER-NAME PIC X(30).
           05 ORDER-DATE PIC X(10).
           05 ORDERED-ITEMS OCCURS 10 TIMES
               INDEXED BY ITEM-INDEX.
               10 ORDERED-ITEM-CODE PIC X(5).
               10 ORDERED-QUANTITY PIC 999V99.


       WORKING-STORAGE SECTION.
       01 TOTAL-SALES PIC 9999999.
       01 ITEM-TOTALS OCCURS 10 TIMES
           INDEXED BY ITEM-INDEX.
           05 ITEM-CODE-TOTAL PIC X(5).
           05 ITEM-SALES-TOTAL PIC 999999V99.


       PROCEDURE DIVISION.
       100-MAIN-ROUTINE.
           OPEN INPUT INVENTORY-FILE
           OPEN INPUT ORDERS-FILE
           PERFORM 200-PROCESS-ORDERS
           CLOSE INVENTORY-FILE
           CLOSE ORDERS-FILE
           STOP RUN.


       200-PROCESS-ORDERS.
           MOVE 0 TO TOTAL-SALES
           PERFORM UNTIL ORDERS-FILE-EOF = "Y"
               READ ORDERS-FILE
               AT END MOVE "Y" TO ORDERS-FILE-EOF
               NOT AT END
                   PERFORM 300-PROCESS-ORDER
           END-PERFORM.


       300-PROCESS-ORDER.
           READ INVENTORY-FILE
           AT END DISPLAY "Item does not exist"
           NOT AT END
               ADD ORDERED-QUANTITY(ITEM-INDEX) TO ITEM-SALES-TOTAL(ITEM-INDEX)
               MULTIPLY ITEM-PRICE BY ORDERED-QUANTITY(ITEM-INDEX)
               ADD ITEM-PRICE TO TOTAL-SALES.