IDENTIFICATION DIVISION.
       PROGRAM-ID. print-numbers.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 i PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
           DISPLAY "THIS PROGRAM PRINTS NUMBERS FROM 1 TO 100:".
           PERFORM VARYING i FROM 1 BY 1 UNTIL i > 100
               DISPLAY i.
           STOP RUN.