IDENTIFICATION DIVISION. 
     PROGRAM-ID. HELLO.

     DATA DIVISION.
     WORKING-STORAGE SECTION.
     01 NAME PIC X(10) VALUE 'JANE SMITH'.
     01 GREETING PIC X(20) VALUE 'HELLO'.

     PROCEDURE DIVISION.
     DISPLAY GREETING ' ' NAME '.' 
     STOP RUN.