$ SET SOURCEFORMAT"FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TestProgram.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT InputFile ASSIGN TO "input.txt".
           SELECT OutputFile ASSIGN TO "output.txt".
       DATA DIVISION.
       FILE SECTION.
       FD InputFile.
       01 inputData.
          05 inputField1 PIC X(10).
          05 inputField2 PIC 9(2).
          05 inputField3 PIC X(15).
       FD OutputFile.
       01 outputData.
          05 outputField1 PIC X(10).
          05 outputField2 PIC 9(3).
          05 outputField3 PIC X(25).
       WORKING-STORAGE SECTION.
       01 tempData.
          05 tempField1 PIC X(10).
          05 tempField2 PIC 9(2).
          05 tempField3 PIC X(15).
       PROCEDURE DIVISION.
           OPEN INPUT InputFile.
           OPEN OUTPUT OutputFile.
           PERFORM UNTIL InputFile = " ".
               READ InputFile INTO inputData.
               MOVE inputField1 TO tempField1.
               MOVE inputField2 TO tempField2.
               MOVE inputField3 TO tempField3.
               STRING tempField1 " " tempField2 "-" tempField3
                  DELIMITED BY SIZE INTO outputField1.
               MOVE tempField3 TO outputField2.
               STRING tempField2 tempField1 " " tempField3
                  DELIMITED BY SIZE INTO outputField3.
               WRITE outputData.
           END-PERFORM.
           CLOSE InputFile.
           CLOSE OutputFile.
           STOP RUN.