IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE    ASSIGN TO "EXAMPLE.IN"
                           ORGANIZATION IS SEQUENTIAL.

           SELECT OUT-FILE   ASSIGN TO "EXAMPLE.OUT"
                           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD IN-FILE.
       01 IN-RECORD.
           02 IN-NAME         PIC X(20).
           02 IN-AGE          PIC 99.
           02 IN-GENDER       PIC X.

       FD OUT-FILE.
       01 OUT-RECORD.
           02 OUT-NAME        PIC X(20).
           02 OUT-AGE         PIC 99.
           02 OUT-GENDER      PIC X.
           02 OUT-ADULT       PIC X(3).


       WORKING-STORAGE SECTION.
       01 COUNT               PIC 9(2).
       01 ADULT-AGE           PIC 99.
       01 ADULT-ERROR         PIC 9(2).
       01 ADULT-SWITCH        PIC X VALUE "N".

       PROCEDURE DIVISION.
          OPEN INPUT IN-FILE
          OPEN OUTPUT OUT-FILE
          PERFORM UNTIL ADULT-SWITCH = "Y"
              READ IN-FILE
                 AT END SET ADULT-SWITCH TO "Y"
              END-READ
              IF IN-AGE > ADULT-AGE
                 PERFORM CALC-ADULT
              END-IF
              WRITE OUT-RECORD
              ADD 1 TO COUNT
          END-PERFORM
          DISPLAY "There are " COUNT "adults in the file."

       CALC-ADULT SECTION.
          IF IN-AGE >= 18
             MOVE "YES" TO OUT-ADULT
             ADD 1 TO ADULT-ERROR
          ELSE
             MOVE "NO" TO OUT-ADULT
          END-IF.

       CLOSE IN-FILE OUT-FILE
       STOP RUN.