IDENTIFICATION DIVISION.  //start of Identification Division
PROGRAM-ID. CALCULATOR.  //program name
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-1 PIC 99.  //defining variable NUM-1 as a 2 digit number
01 NUM-2 PIC 99.  //defining variable NUM-2 as a 2 digit number
01 RESULT PIC 999.  //defining variable RESULT as a 3 digit number
PROCEDURE DIVISION.
    DISPLAY "Enter first number: " WITH NO ADVANCING. //prompt user to enter first number
    ACCEPT NUM-1 FROM CONSOLE.  //input first number from user and store in NUM-1
    DISPLAY "Enter second number: " WITH NO ADVANCING.  //prompt user to enter second number
    ACCEPT NUM-2 FROM CONSOLE.  //input second number from user and store in NUM-2

    IF NUM-2 = 00 //if NUM-2 is equal to 0
        DISPLAY "Error: Cannot divide by 0." WITH NO ADVANCING.  //display error message
    ELSE
        DIVIDE NUM-1 BY NUM-2 GIVING RESULT.  //perform division and store result in RESULT
        DISPLAY "Result of division is: " RESULT WITH NO ADVANCING.  //display result message
    END-IF.

STOP RUN. //end of program