identification division.
       program-id. example-program.

       data division.
       working-storage section.
       01 numbers.
          05 num1 pic 9(3) value 123.
          05 num2 pic 9(3) value 456.
          05 num3 pic 9(3) value 0.
       01 result pic 9(4).

       procedure division.
       compute result = num1 + num2 * num3.
       display "The result is " result.

       stop run.