IDENTIFICATION DIVISION.
PROGRAM-ID. complexCode.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 num1 PIC 9(3) VALUE 123.
01 num2 PIC 9(3) VALUE 456.
01 result PIC 9(4).

PROCEDURE DIVISION.
MULTIPLY num1 BY num2 GIVING result.

DISPLAY "The result of the multiplication is: ", result.

STOP RUN.