IDENTIFICATION DIVISION.          
       PROGRAM-ID. SAMPLE-PROGRAM.        
       LINKAGE SECTION.                   
       * Define input variables.          
       01 INPUT-VARIABLES.                
           05 INPUT-VAR-A       PIC X(10). 
           05 INPUT-VAR-B       PIC 9(2).  
           05 INPUT-VAR-C       PIC S9(4). 
       * Define output variables.         
       01 OUTPUT-VARIABLES.               
           05 OUTPUT-VAR-A      PIC X(10). 
           05 OUTPUT-VAR-B      PIC 9(2).  
           05 OUTPUT-VAR-C      PIC S9(4). 
       PROCEDURE DIVISION USING           
           INPUT-VARIABLES                 
           OUTPUT-VARIABLES                
       * Perform calculations.            
           ADD INPUT-VAR-B TO INPUT-VAR-C  
           GIVING OUTPUT-VAR-B             
           IF INPUT-VAR-C > 0              
               MULTIPLY INPUT-VAR-A BY INPUT-VAR-C
               GIVING OUTPUT-VAR-A         
           ELSE                            
               DIVIDE INPUT-VAR-A BY INPUT-VAR-B 
               GIVING OUTPUT-VAR-A         
           END-IF                           
           IF OUTPUT-VAR-B > 10            
               SUBTRACT OUTPUT-VAR-B FROM OUTPUT-VAR-C
               GIVING OUTPUT-VAR-C         
           ELSE                            
               ADD OUTPUT-VAR-B TO OUTPUT-VAR-C    
               GIVING OUTPUT-VAR-A         
           END-IF.                          
       * Display output variables.         
           DISPLAY "Output A: " OUTPUT-VAR-A.
           DISPLAY "Output B: " OUTPUT-VAR-B.
           DISPLAY "Output C: " OUTPUT-VAR-C.
       STOP RUN.