PROGRM1.             * Program name
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.   * Program identification
       AUTHOR. JOHN DOE.     * Author name
       DATE-WRITTEN. 2020-10-01.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  NUM1             PIC X(4).     * Variable for first number
       77  NUM2             PIC X(4).     * Variable for second number
       77  SUM              PIC X(4).     * Variable for sum
       PROCEDURE DIVISION.
       BEGIN.
            DISPLAY "Enter first num:".
            ACCEPT NUM1.
            DISPLAY "Enter second num:".
            ACCEPT NUM2.
            ADD NUM1, NUM2 TO SUM.         * Adding first and second number and storing in sum
            DISPLAY "Sum is: ", SUM.
            STOP RUN.