IDENTIFICATION DIVISION.
PROGRAM-ID. COBOL-PROGRAM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-NUM PIC 9(6).
01 OUTPUT-NUM PIC 9(6).
PROCEDURE DIVISION.
MAIN-PARA.
ACCEPT INPUT-NUM.
MULTIPLY INPUT-NUM BY 2 GIVING OUTPUT-NUM.
DISPLAY 'The doubled value of ', INPUT-NUM, ' is: ', OUTPUT-NUM.
STOP RUN.