% A family tree in Prolog

% Facts
female(mary).
female(sally).
female(lucy).
male(john).
male(steve).
male(bob).
married(john, mary).
married(steve, sally).
parent(john, lucy).
parent(mary, lucy).
parent(steve, bob).
parent(sally, bob).

% Rules
mother(X, Y) :- female(X), parent(X, Y).
father(X, Y) :- male(X), parent(X, Y).
sibling(X, Y) :- parent(Z, X), parent(Z, Y), X \= Y.
grandparent(X, Y) :- parent(X, Z), parent(Z, Y).

% Example queries
?- female(mary). % Does mary exist in the database of females?
Yes  % Output: true

?- married(john, sally). % Are John and Sally married?
No % Output: false

?- parent(steve, bob). % Is Steve the parent of Bob?
Yes  % Output: true

?- grandparent(john, bob). % Is John the grandparent of Bob?
Yes  % Output: true

?- sibling(lucy, bob). % Are Lucy and Bob siblings?
No % Output: false