% This is a prolog code snippet for creating a knowledge base and querying for data

% Define predicate "parent" with two arguments
parent(john, adam).
parent(john, lisa).
parent(mark, chris).
parent(mark, sophia).
parent(jessica, lisa).

% Define predicate "male" with one argument
male(john).
male(mark).
male(chris).

% Define predicate "female" with one argument
female(jessica).
female(lisa).
female(sophia).

% Define rule "father" with two arguments
father(X, Y) :-
    parent(X, Y),
    male(X).

% Define rule "mother" with two arguments
mother(X, Y) :-
    parent(X, Y),
    female(X).

% Query for all the parents of lisa
?- parent(X, lisa).

% Output:
% X = john ;
% X = jessica

% Query for all the fathers of lisa
?- father(X, lisa).

% Output:
% X = john

% Query for all the parents of chris
?- parent(X, chris).

% Output:
% X = mark

% Query for all the mothers of sophia
?- mother(X, sophia).

% Output:
% X = jessica